const questionPools = {
    Myanmar: {
        sectionA: {
            questions: [
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မြန်မာစကားသံနှင့် အနက်အဓိပ္ပာယ်ဆောင်းပါးကို ရေးသားသူမှာ __________ ဖြစ်သည်။", choices: [{ text: "လှသမိန်" }, { text: "ဦးဖေမောင်တင်" }, { text: "မောင်ခင်မင်(ဓနုဖြူ)" }, { text: "ဆရာဇော်ဂျီ" }], answer: ["မောင်ခင်မင်(ဓနုဖြူ)"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အချို့ဗျည်းသံများကို အနက်အဓိပ္ပာယ် အတိုင်းအဆကို လျော့ပါးသွားစေလိုပါက __________ နိုင်သည်။", choices: [{ text: "အသံလျော့သုံး" }, { text: "နှစ်ကြိမ်ထပ်" }, { text: "ကာရန်တူ တ-ဗျည်းနှစ်လုံးဆင့်တွဲ" }, { text: "ဆန့်ကျင်ဘက်အသုံးပြု" }], answer: ["ကာရန်တူ တ-ဗျည်းနှစ်လုံးဆင့်တွဲ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "နေရာဒေသ၊ အရပ်မျက်နှာကို အစွဲပြုသည့် ဓလေ့သုံးစကားများသည် __________ ဖြစ်သည်။", choices: [{ text: "စကားပြေ" }, { text: "ကဗျာ" }, { text: "ရသစာတမ်း" }, { text: "ဆောင်းပါးစကားပြေ" }], answer: ["ဆောင်းပါးစကားပြေ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“ခု - သူနဲ့ ခင်ခင်ကြီး ‘လမ်းစပြတ်’ခဲ့ပြီ” တွင် ‘လမ်းစပြတ်’ သည် __________ ဟုအနက်ရသည်။", choices: [{ text: "‘လမ်းပျောက်သည်’" }, { text: "‘လမ်းတွင်ကျန်ခဲ့သည်’" }, { text: "‘အဆက်အသွယ်ပြတ်သည်’" }, { text: "‘လမ်း၏အစပြတ်သွားသည်’" }], answer: ["‘အဆက်အသွယ်ပြတ်သည်’"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဗန်းစကားပေါ်ပေါက်လာပုံများ ဆောင်းပါးစကားပြေကို __________ မှ ကောက်နုတ်ထားသည်။", choices: [{ text: "မြန်မာစကားမြန်မာရုပ်ပုံလွှာ" }, { text: "မြန်မာ့ဓလေ့သုံးစကားများ" }, { text: "အတ္ထဗေဒနိဒါန်း" }, { text: "မြန်မာစာပေအဆီအနှစ်" }], answer: ["မြန်မာစာပေအဆီအနှစ်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဗန်းစကားများတွင် __________ ။", choices: [{ text: "စည်းစနစ်အခြေခံများ ရှိသည်။" }, { text: "စည်းစနစ်အခြေခံများ မရှိပါ။" }, { text: "သတ်မှတ်ချက်များ ရှိသည်။" }, { text: "အကြောင်းအရာ ကန့်သတ်သည်။" }], answer: ["စည်းစနစ်အခြေခံများ မရှိပါ။"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မမျှော်လင့်ဘဲ ကံအားလျော်စွာ အောင်မြင်သောအခါ __________ ဟု ဆိုကြသည်။", choices: [{ text: "ဖွတ်မရဓားမဆုံး" }, { text: "မိုးရွာတုန်းရေခံ" }, { text: "ကြက်ကန်းဆန်အိုးတိုး" }, { text: "မြွေပါလည်းဆုံး သားလည်းဆုံး" }], answer: ["ကြက်ကန်းဆန်အိုးတိုး"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အသွင်ကွဲမြန်မာစကားများဆောင်းပါးစကားပြေကို သင်ကြားရခြင်း၏ ရည်ရွယ်ချက်မှာ __________ ဖြစ်သည်။", choices: [{ text: "မြန်မာစကားသံတို့၏ သဘောသဘာဝကို နားလည်စေရန်" }, { text: "စကားသံနှင့်အနက်အဓိပ္ပာယ်ကို သိရှိစေရန်" }, { text: "မြန်မာစကားသံနှင့်အနက်အဓိပ္ပာယ်တို့၏ ဆက်သွယ်ပုံကို သိနားလည်ပြီး လက်တွေ့ အသုံးပြုနိုင်စေရန်" }, { text: "အသွင်ကွဲမြန်မာစကားအားလုံး၏ တန်းတူရည်တူရှိမှုနှင့် အသွင်ကွဲပုံများကို နားလည် သိရှိစေရန်" }], answer: ["အသွင်ကွဲမြန်မာစကားအားလုံး၏ တန်းတူရည်တူရှိမှုနှင့် အသွင်ကွဲပုံများကို နားလည် သိရှိစေရန်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အသွင်ကွဲမြန်မာစကားတွင် ရခိုင်ဒေသိယစကား၌ ‘ရေ ကို /ရီ/၊ ဖြူ ကို __________\’  ဟု လျှာလိပ်သံဖြင့် ပြောသည်။", choices: [{ text: "/ဖြူ/" }, { text: "/ဖယူ/" }, { text: "/ဖရူ/" }, { text: "/ဗယူ/" }], answer: ["/ဖရူ/"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အသွင်ကွဲမြန်မာစကား၌ ထားဝယ်၊ တောင်ရိုး၊ အင်းသားတို့တွင် ‘ကျား’ ကို /က္လား/ ၊ ပြန် ကို /ပ္လြန်/’ ဟု __________ ဖြင့် ပြောသည်ကို လည်း လေ့လာတွေ့ရှိရသည်။", choices: [{ text: "လဆွဲသံ" }, { text: "ယသံ" }, { text: "လျှာလိပ်သံ" }, { text: "ဟထိုးသံ" }], answer: ["လဆွဲသံ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စကားသင်္ကေတရောသုံးခြင်းဆိုသည်မှာ ဘာသာစကားတစ်မျိုးကို သုံးစွဲနေစဉ်အတွင်း အခြားဘာသာစကားတစ်မျိုး၏ အစိတ်အပိုင်းများကို __________ အသုံးပြုခြင်းမျိုးဖြစ်သည်။", choices: [{ text: "သီးသန့်" }, { text: "ဖယ်ထုတ်" }, { text: "ရောနှော" }, { text: "အသစ်ထွင်" }], answer: ["ရောနှော"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ယနေ့ခေတ်တွင် စကားသင်္ကေတရောသုံးခြင်းသည် __________ ဖြစ်ရာ ဘာသာစကားဖွံ့ဖြိုးတိုးတက်ရေး အတွက် အကျိုးရှိအောင်ကြိုးပမ်းဆောင်ရွက်ကြရမည်ဖြစ်သည်။", choices: [{ text: "မရှိမဖြစ်" }, { text: "အသုံးပြုသူများလာ၍" }, { text: "စကားလုံးတိုးပွားမှု" }, { text: "ခေတ်၏လိုအပ်ချက်" }], answer: ["ခေတ်၏လိုအပ်ချက်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဥပစာဆောင်းပါးစကားပြေကို သင်ကြားရခြင်း၏ ရည်ရွယ်ချက်မှာ လူမှုဆက်ဆံရေး နယ်ပယ်တွင် စကားပြောရာ၌ တင်စားသုံးသော ဥပစာအသုံးအနှုန်းတို့ကို __________ ဖြစ်သည်။", choices: [{ text: "နားလည်စေရန်" }, { text: "သတိပြုမိစေရန်" }, { text: "လက်တွေ့အသုံးချပြောဆိုနိုင်စေရန်" }, { text: "ဂရုပြုမိစေရန်" }], answer: ["လက်တွေ့အသုံးချပြောဆိုနိုင်စေရန်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "‘စည်းလွတ်ဝါးလွတ်’ ဟူသော ဝေါဟာရသည် __________ ဖြစ်သည်။", choices: [{ text: "လုပ်ငန်းဆောင်တာကို အခြေပြုသော ဥပစာ" }, { text: "အာရုံခံစားမှုကို အခြေပြုသည့် ဥပစာ" }, { text: "လူ့ကိုယ်ခန္ဓာကို အခြေပြုသည့် ဥပစာ" }, { text: "အပြုအမူအခြေအနေကို အခြေပြုသည့် ဥပစာ" }], answer: ["လုပ်ငန်းဆောင်တာကို အခြေပြုသော ဥပစာ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "လုပ်ငန်းဆောင်တာအခြေပြုဥပစာကို ဖော်ပြပါ။", choices: [{ text: "မျက်နှာလိုက်" }, { text: "မျက်နှာကြီးရာဟင်းဖတ်ပါ" }, { text: "ရေလိုက်ငါးလိုက်" }, { text: "ဆိုင်းမဆင့်ဗုံမဆင့်" }], answer: ["ဆိုင်းမဆင့်ဗုံမဆင့်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ကျစွာမင်းနှင့် မိထွေးတော် စကားပြေကို __________ တွင် ရေးသားခဲ့သည်။", choices: [{ text: "ပုဂံခေတ်" }, { text: "ပင်းယခေတ်" }, { text: "အင်းဝခေတ်" }, { text: "တောင်ငူခေတ်" }], answer: ["ပုဂံခေတ်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ကျစွာမင်းနှင့် မိထွေးတော် စကားပြေ အမျိုးအစားမှာ __________ ဖြစ်သည်။", choices: [{ text: "မွန်ကျောက်စာစကားပြေ" }, { text: "ကျောက်စာစကားပြေ" }, { text: "ဆောင်းပါးစကားပြေ" }, { text: "သုတစကားပြေ" }], answer: ["ကျောက်စာစကားပြေ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "သစ္စာ ပညာ ဝီရိယ စကားပြေကို ရေးသားသူမှာ __________ ဖြစ်သည်။", choices: [{ text: "မှော်ပီဆရာသိန်း" }, { text: "သခင်ကိုယ်တော်မှိုင်း" }, { text: "ယောမင်းကြီးဦးဖိုးလှိုင်" }, { text: "အမျိုးသားပညာဝန်ဦးဖိုးကျား" }], answer: ["ယောမင်းကြီးဦးဖိုးလှိုင်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ယောမင်းကြီးဦးဖိုးလှိုင်သည် __________ စသည့် မင်းအဆက်ဆက်တွင် အမှုထမ်းခဲ့သူဖြစ်သည်။", choices: [{ text: "ပုဂံမင်း၊ မင်းတုန်းမင်း၊ သီပေါမင်း" }, { text: "သာယာဝတီမင်း၊ မင်းတုန်းမင်း၊ သီပေါမင်း" }, { text: "ဘိုးတော်ဘုရား၊ မင်းတုန်းမင်း၊ သီပေါမင်း" }, { text: "အလောင်းဘုရား၊ မင်းတုန်းမင်း၊ သီပေါမင်း" }], answer: ["သာယာဝတီမင်း၊ မင်းတုန်းမင်း၊ သီပေါမင်း"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ရွှေငွေ စိန်ကျောက် တို့သည်လည်း မြေကြီးကို တူးဆွ၍ လူတို့ __________ အကျိုးကိုသာ ခံစား၍ နေကြရသည်ကို စေ့စေ့ဆင်ခြင်လေ သိမြင်လေ ဖြစ်လိမ့်မည်။", choices: [{ text: "လုံ့လ" }, { text: "ဝီရိယ" }, { text: "လုံ့လဝီရိယ" }, { text: "ဉာဏ်ပညာ" }], answer: ["လုံ့လဝီရိယ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဘုရားဖူးသွားခြင်းစကားပြေတွင် စာရေးသူက __________ ခြင်းသည် အဓိကကျကြောင်း အသိပေးလိုရင်း ဖြစ်သည်။", choices: [{ text: "ဘုရားဖူးသွား" }, { text: "ဘုရားစကားနားထောင်" }, { text: "ဘုရားရှိခိုး" }, { text: "အလှူငွေလှူဒါန်း" }], answer: ["ဘုရားစကားနားထောင်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အမျိုးသားပညာဝန်ဦးဖိုးကျားသည် အစိုးရရာထူးထက် __________ အဖြစ် တာဝန်ထမ်းရခြင်းကို ပိုမို နှစ်သက်တန်ဖိုးထားသည်။", choices: [{ text: "ကျောင်းဆရာ" }, { text: "စာရေးဆရာ" }, { text: "ပရဟိတသမား" }, { text: "အမျိုးသားပညာဝန်" }], answer: ["အမျိုးသားပညာဝန်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဘုရားဖူးသွားခြင်းစကားပြေတွင် စာရေးသူက မောင်ထွန်းမောင်၏ __________ စိတ်ကို ပေါ်လွင်အောင် ဖော်ကျူးထားသည်။", choices: [{ text: "ကရုဏာ" }, { text: "မေတ္တာ" }, { text: "ပရဟိတ" }, { text: "ကြင်နာ" }], answer: ["ပရဟိတ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "လူ့အသည်းစကားပြေသည် တက္ကသိုလ်မောင်မောင်ကြီး၏ __________ ဆိုင်ရာ ဆောင်းပါးတစ်ပုဒ် ဖြစ်သည်။", choices: [{ text: "လူမှုရေး" }, { text: "အတွေးအမြင်" }, { text: "ဘာသာရေး" }, { text: "ကိုးကွယ်မှု" }], answer: ["အတွေးအမြင်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မည်သည့်ဘာသာဝင်မဆို သေပြီးသည့်နောက် ဘဝသစ်၌ __________ ကို တမ်းတတတ်ကြသည်။", choices: [{ text: "အေးချမ်းပျော်ရွှင်မှု" }, { text: "လူ့ဘဝ" }, { text: "နတ်စည်းစိမ်" }, { text: "ချမ်းသာကြွယ်ဝမှု" }], answer: ["အေးချမ်းပျော်ရွှင်မှု"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဘာသာတရားဆိုသည်မှာ လူ့အသည်း နှလုံးသားအတွင်း၌ ကိန်းအောင်းနေသော __________ ဖြစ်သည်။", choices: [{ text: "စွဲလမ်းမှု" }, { text: "ယုံကြည်မှု" }, { text: "အသိတရား" }, { text: "အယူဝါဒ" }], answer: ["ယုံကြည်မှု"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အမှောင်သည် __________ စာပေ အမျိုးအစားဖြစ်သည်။", choices: [{ text: "ဆောင်းပါး" }, { text: "ရသစာတမ်း" }, { text: "ဝတ္ထု" }, { text: "ပြဇာတ်" }], answer: ["ရသစာတမ်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အမှောင်ဓာတ်သည် __________ ပေါ်လာရေးအတွက် အမှီခံ ဖြစ်သည်။", choices: [{ text: "အလင်းရောင်" }, { text: "ဉာဏ်အလင်းရောင်" }, { text: "ကြောက်စိတ်" }, { text: "ရဲရင့်စိတ်" }], answer: ["ဉာဏ်အလင်းရောင်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မိဘမဲ့ ပညာရှိကလေး သမ္မတဖြစ်လာပုံ ပုံပြင်တွင် ဉာဏ်ပညာထက်မြက်ပြီး _____ ရှိလျှင် ခေါင်းဆောင်ကောင်းတစ်ယောက် ဖြစ်လာနိုင်ပုံ အသိအမြင် သင်ခန်းစာ ရရှိစေနိုင်ပါသည်။", choices: [{ text: "ဗျတ္တိ" }, { text: "ဖြူစင်မှု" }, { text: "သတ္တိ" }, { text: "နားလည်မှု" }], answer: ["သတ္တိ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မိဘမဲ့ ပညာရှိကလေး သမ္မတဖြစ်လာပုံ ပုံပြင်တွင် ကုန်ဇက်သည် ၎င်းအားချုပ်ထားစဉ် ရေတံခွန်အနီးရှိ သစ်ပင် အပေါ်သို့ နေ့စဉ်လာပြီး “ယင်ဖောင် ယင်ဖောင်” ဟု အော်လျက်ရှိသော မျောက်အိုကြီး၏ အသံပြု ပုံ ကို သတိရ ပြီး ကွမ်းအစ်ကို ဆောင်ရွက်လိုက်ရာ အောင်မြင်ခဲ့လေသည်။ ယင်ဖောင် ဟူသည့် ဝေါဟာရ၏ အဓိပ္ပာယ်မှာ _____ ဟု အဓိပ္ပာယ်ရသည်။", choices: [{ text: "အဖုံးကိုဖွင့်" }, { text: "နှုတ်ဖွင့်" }, { text: "ထိန်းဖွင့်" }, { text: "လှည့်ဖွင့်" }], answer: ["လှည့်ဖွင့်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "လူအချင်းချင်း သွေးစည်းညီညွတ်မှု ပြိုကွဲလျှင် ကြောက်စရာကောင်းပုံ လုံးဝ ပျက်စီးသွားနိုင်ပုံကို ဖော်ပြထားသော “လူကွဲလျှင် စုန်းဖြစ်မည်” ဟူသောစကားပုံသည် _____ တိုင်းရင်းသားတို့၏ စကားပုံဖြစ်သည်။", choices: [{ text: "ကချင်" }, { text: "ကရင်" }, { text: "ကရင်နီ" }, { text: "ချင်း" }], answer: ["ကရင်နီ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ချင်းတိုင်းရင်းသားစကားပုံဖြစ်သည့် _____ စကားပုံသည် အချင်းချင်းစည်းလုံး ညီညွတ်မှုမရှိလျှင် ပြင်ပက ဝင်လာပြီး ဒုက္ခပေးနိုင်ကြောင်း ဟူသည့် ဘဝအသိသင်ခန်းစာရပြီး ဤအသိကို ပြန်လည် အသုံးချနိုင်သည်။", choices: [{ text: "“နွားကွဲ ကျားကိုက်”" }, { text: "“နွားကွဲ ကျားဆွဲ”" }, { text: "“နွားနောက်ကွဲ ကျားပါးစပ်ရောက်”" }, { text: "“နွားကွဲ ကျားကိုက် လူကွဲ အထိနာ”" }], answer: ["“နွားနောက်ကွဲ ကျားပါးစပ်ရောက်”"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပညာရဲရင့် ပွဲလယ်တင့်ကဗျာတွင် ရုပ်အဆင်း အင်္ဂါ မလှပသော်လည်း ပညာရှိသူကိုလူအများက နှစ်လိုစွာလက်ခံ ဆက်ဆံ၊ တန်ဖိုးထားလေးစားကြပြီးနေရာပေးကာ နှစ်သက်မြတ်နိုးခြင်း ခံရ သည် ကို အပြင်ပန်း အားဖြင့် မလှပသော်လည်း အရသာ ချိုမြသောအသီးနှင့်တူပုံကို “ အထူးပြင်လျာ မလှ ပါလည်း ရသာချိုမြ၊ ပနသသို့”မှ ပနသ သည် _____ အသီးဖြစ်သည်။", choices: [{ text: "အုန်းသီး" }, { text: "ဒူးရင်းသီး" }, { text: "ပိန္နဲသီး" }, { text: "နာနတ်သီး" }], answer: ["ပိန္နဲသီး"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပညာရဲရင့် ပွဲလယ်တင့်ကဗျာတွင်“ပထမအရွယ် ၊ အငယ်သော်က ၊ သိပ္ပခေါင်အား၊ တတ်မြောက်မြားမူ၊ တောသားရန်အောင်၊ ခြင်္သေ့ယောင်သို့၊ မရှောင်မညှာ၊ တင်းတင်းမာ၍ ပညာရဲရင့် ပွဲလယ်တင့်လိမ့်”ဟူရာ၌ ပညာတတ်မြောက်ခြင်းဖြင့် ပရိသတ်အလယ်တွင် ခြင်္သေ့မင်းကဲ့သို့ _____ ဖြစ်နေလိမ့်မည်ဟု နားလည်သိရှိစေပါသည်။", choices: [{ text: "မာကျောသန်မာစွာ" }, { text: "မာန်တဝင့်ဝင့်" }, { text: "ရဲရဲရင့်ရင့် ဝင့်ဝင့်ထည်ထည်" }, { text: "ခေါင်းဆောင်ကဲ့သို့" }], answer: ["ရဲရဲရင့်ရင့် ဝင့်ဝင့်ထည်ထည်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပညာရဲရင့်ပွဲလယ်တင့်ကဗျာတွင် “ ရည်သွားယုတ်စိမ့်၊ အားတိုင်းနှိမ့်လည်း၊ မနိမ့်ကိုယ်ပင်၊ ကျေးဇူးအင်ကြောင့်၊ ညွန်တွင်စွန့်ပစ်၊ မဏိစစ်သို့၊ မညစ်မညူး၊ ဂုဏ်ရောင်မြူးအံ့” ဟူ၍ ရေးဖွဲ့ထားခြင်းဖြင့် ပညာရှာသည့် ပညာရှိသည့်သူကို မည်သို့ပင် နှိမ့်ချသော်လည်း ညွန်တွင် စွန့်ပစ်သည့် ______ ကဲ့သို့ ပင်ကိုယ်အရောင် တောက်ပြောင်မြဲ တောက်ပရပုံကို ရေးဖွဲ့ထားခြင်း ပညာနှင့် ပတ်သက်၍ဘဝတွင် ပြန်လည် အသုံးချနိုင်သော အသိအမြင် ဗဟုသုတ ရရှိပါသည်။", choices: [{ text: "ကျောက်စိမ်း" }, { text: "ငွေ" }, { text: "ပုလဲ" }, { text: "ပတ္တမြား" }], answer: ["ပတ္တမြား"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“တံခွန်တိုင် သိကြားထင့်” ကဗျာကို မည်သူ ရေးသနည်း။", choices: [{ text: "ဦးကြီး" }, { text: "ရှင်မဟာရဋ္ဌသာရ" }, { text: "ဦးပုည" }, { text: "မျိုးမြင့်ဆွေ" }], answer: ["ဦးပုည"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဦးပုညသည် ကုန်းဘောင်ခေတ် မြန်မာ ပြည်သူ၊ ပြည်သားတို့၏ဘဝ __________ ကို တွေ့မြင်ပြီး ကဗျာ စပ်ဆိုခဲ့ပါသည်။", choices: [{ text: "ပြည့်စုံကြွယ်ဝမှု" }, { text: "စိတ်အေးချမ်းသာမှု" }, { text: "ဆင်းရဲကြပ်တည်းမှု" }, { text: "ထင်ရှားကျော်ကြားမှု" }], answer: ["ဆင်းရဲကြပ်တည်းမှု"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အရသာကြီးခြံစပ်သီးကဗျာသည် __________ ကဗျာ အမျိုးအစားဖြစ်သည်။", choices: [{ text: "လေးချိုး" }, { text: "လွမ်းချင်း" }, { text: "သံချို" }, { text: "ဟန်ချင်း" }], answer: ["လွမ်းချင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အရသာကြီးခြံစပ်သီးကဗျာပါ ‘လယ်ညိုဝင်းချိန်’သည် __________ အလင်္ကာအမျိုးအစားဖြစ်သည်။", choices: [{ text: "ဝင်္ကဝုတ္တိ" }, { text: "မြည်သံစွဲ" }, { text: "ရူပက" }, { text: "ဥပမာ" }], answer: ["ဝင်္ကဝုတ္တိ"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပန်းပန်လျက်ပဲ ကဗျာမှ “ ဘဲအုပ်မှာ တစ်ရာနှစ်ရာ ဗေဒါကတစ်ပင်ထဲ(တည်း) အယက် အကန်ခံလို့ ဗေဒါပျံအံကိုခဲ ၊ပန်းပန်လျက်ပဲ” ကဗျာသည် ဘဝအတွက် ကြီးမားသော အနှောင့် အယှက်နှင့် ကြုံရသော အခါ __________ ရမည့် အရာအတွက် အသုံးချနိုင်သည့် အတွေး အမြင် တစ်ခုရရှိပါသည်။", choices: [{ text: "သတ္တိရှိရှိ ရင်ဆိုင်" }, { text: "အံခဲ၍ သတ္တိရှိရှိ ကြံ့ကြံ့ခံရင်ဆိုင်" }, { text: "စိတ်ဓာတ်မကျဘဲရင်ဆိုင်" }, { text: "အနိုင်မခံ အရှုံးမပေးသော စိတ်နှင့်ရင်ဆိုင်" }], answer: ["အံခဲ၍ သတ္တိရှိရှိ ကြံ့ကြံ့ခံရင်ဆိုင်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပန်းပန်လျက်ပဲ ကဗျာတွင် အုန်းလက်ကြွေ၊ ဒီလှိုင်း၊ ဘဲအုပ် တို့ကို ဆရာဇော်ဂျီက သင်္ကေတပြု တင်စားရာတွင် ဤကဗျာမှတစ်ဆင့် မိမိ၏ ဘဝတွင် __________ နှင့်လည်း ရင်ဆိုင်ရသည့်အခါ ဘဝအသိ၊ ဘဝသတ္တိရှိလာရန် အထောက်အကူပြုပါသည်။", choices: [{ text: "ဗိုလ်ကျတတ်သူများ" }, { text: "ပြဿနာရှာတတ်သူများ" }, { text: "ဒုက္ခပေးတတ်သူများ" }, { text: "အုပ်စုဖွဲ့ အနိုင်ကျင့် နှိပ်စက်တတ်သူများ" }], answer: ["အုပ်စုဖွဲ့ အနိုင်ကျင့် နှိပ်စက်တတ်သူများ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“ဖိုးမောင်လာပြီ” ကဗျာကို မည်သူ ရေးသနည်း။", choices: [{ text: "ဇော်ဂျီ" }, { text: "မင်းသုဝဏ်" }, { text: "တင်မိုး" }, { text: "မင်းယုဝေ" }], answer: ["မင်းသုဝဏ်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဆရာမင်းသုဝဏ်သည် “ဖိုးမောင်လာပြီ” ကဗျာတွင် __________ ဟူသည့်အချိန်ကို ထည့်သွင်း ဖွဲ့ဆိုထားပါသည်။", choices: [{ text: "လူခြေတိတ်၌" }, { text: "တိတ်ဆိတ်ချိန်၌" }, { text: "ညအမှောင်၌" }, { text: "မိုးသောက်ချိန်၌" }], answer: ["လူခြေတိတ်၌"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "တက္ကသိုလ်မင်းမော်၏ အမည်ရင်းမှာ __________ ဖြစ်သည်။", choices: [{ text: "ဦးသိန်းဟန်" }, { text: "ဦးဝန်" }, { text: "ဦးထွန်းမြင့်" }, { text: "ဦးဝင်းမောင်" }], answer: ["ဦးထွန်းမြင့်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အဘိုးသခင်ကိုယ်တော်မှိုင်းသို့ ကဗျာကို __________ က ရေးဖွဲ့ခဲ့ပါသည်။", choices: [{ text: "မောင်မောက်" }, { text: "မောင်စွမ်းရည်" }, { text: "ကြည်အောင်" }, { text: "တင်မိုး" }], answer: ["တင်မိုး"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အဘိုးသခင်ကိုယ်တော်မှိုင်းသို့ ကဗျာပါ ‘အဘိုးကဝိ’သည် __________ကို ရည်ညွှန်းသော စကား ဖြစ်သည်။", choices: [{ text: "တင်မိုး" }, { text: "ဦးဖေမောင်တင်" }, { text: "သခင်ကိုယ်တော်မှိုင်း" }, { text: "ဖိုးဝဇီရ" }], answer: ["သခင်ကိုယ်တော်မှိုင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စာရေးဆရာ မောင်ထင်၏ အမည်ရင်းမှာ __________ ဖြစ်သည်။", choices: [{ text: "ဦးသိန်းဟန်" }, { text: "ဦးဝန်" }, { text: "ဦးထင်ဇော်" }, { text: "ဦးထင်ဖတ်" }], answer: ["ဦးထင်ဖတ်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်၏ ဇာတိမြို့မှာ _________ ဖြစ်သည်။", choices: [{ text: "ပုသိမ်" }, { text: "ငပုတော" }, { text: "လပွတ္တာ" }, { text: "မြောင်းမြ" }], answer: ["လပွတ္တာ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စာရေးဆရာ မောင်ထင် ရေးသားခဲ့သော စာများမှ စာပေလောကတွင် ထိပ်တန်းက ရပ်တည်ခဲ့သော ဝတ္ထုမှာ __________ ဖြစ်သည်။", choices: [{ text: "ကိုဒေါင်း" }, { text: "ငဘ" }, { text: "မိုပါဆွန်း" }, { text: "မျိုးဖျက်ရန်သူ" }], answer: ["ငဘ"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်သည်တက္ကသိုလ်တက်စဉ်အနာတိုဖရန့်၊ဗော်လတိုင်းယားစသော __________ စာရေးဆရာကြီး များ ၏ သရော်စာများကို ဖတ်ရှုခဲ့သည်။", choices: [{ text: "အင်္ဂလိပ်" }, { text: "ပြင်သစ်" }, { text: "အီတလီ" }, { text: "အမေရိကန်" }], answer: ["ပြင်သစ်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်၏ ထင်ရှားသော ပြဇာတ်နှစ်ပုဒ်မှာ __________ နှင့် အာဇာနည်မိခင်ပြဇာတ်တို့ ဖြစ်သည်။", choices: [{ text: "ဘာအရေးကြီးဆုံးလဲ" }, { text: "မြို့အုပ်မင်း" }, { text: "ခေတ်သစ်ဆန်းပြီ" }, { text: "လူထုအောင်လံ" }], answer: ["ဘာအရေးကြီးဆုံးလဲ"], multiple: false, marks: 1 },  
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်သည် မြန်မာမဂ္ဂဇင်းကြီးများတွင် ဝတ္ထုတို၊ ဆောင်းပါးများ၊ __________ ရေးသားခဲ့သည်။", choices: [{ text: "ကဗျာ" }, { text: "ဝတ္ထုရှည်" }, { text: "အက်ဆေး" }, { text: "ပြဇာတ်များ" }], answer: ["ပြဇာတ်များ"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်၏ ဂါလီဗာ ခရီးစဉ်သည် အမျိုးသားစာပေ __________ ဆုရရှိခဲ့သည်။", choices: [{ text: "ဝတ္ထုတို" }, { text: "ဘာသာပြန်" }, { text: "ကဗျာ" }, { text: "ဝတ္ထုရှည်" }], answer: ["ဘာသာပြန်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်၏ ဝတ္ထုတိုတွင် __________ သည် ထင်ရှားသည်။", choices: [{ text: "ဂျပန်ခေတ်" }, { text: "ဘာအရေးကြီးဆုံးလဲ" }, { text: "ကိုဒေါင်း" }, { text: "မိုပါဆွန်း" }], answer: ["ကိုဒေါင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မောင်ထင်သည် မြန်မာနိုင်ငံ စာရေးဆရာအသင်း __________ အဖြစ် တာဝန်ယူ လုပ်ကိုင်ခဲ့သည်။", choices: [{ text: "အဖွဲ့ဝင်" }, { text: "အတွင်းရေးမှူး" }, { text: "ဥက္ကဋ္ဌ" }, { text: "နာယက" }], answer: ["ဥက္ကဋ္ဌ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်သည် ၁၈၈၆ ခုတွင် မြန်မာပြည်သည် အင်္ဂလိပ်လက်အောက်သို့ ကျရောက်ခဲ့သောအခါ မြန်မာ့လွတ်လပ်ရေးအတွက် တိုက်ပွဲဝင်ခဲ့သော __________ ခေါင်းဆောင်သည့် တောင်သူလယ်သမား အရေးတော်ပုံ ဖြစ်ရပ်နှင့် ဆက်စပ်ကာ ဖော်ပြထားခြင်းဖြစ်သည်။", choices: [{ text: "ဗိုလ်မင်းရောင်" }, { text: "ဗိုလ်အောင်ကျော်" }, { text: "သခင်ဖိုးလှကြီး" }, { text: "ဆရာစံ" }], answer: ["ဆရာစံ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်တွင် ဦးသက်ကြွင်းက ညိုညိုကို မေးရာ၌ ဆရာစံတို့ရှိသည့် နေရာကို ဖော်ထုတ်ပါက မောင်နေဝင်းကို မသတ်ဟု ဆိုသော်လည်း နေရာကို ပြောပြီးသောအခါ မောင်နေဝင်းကို _____________ သည် ကတိမတည်သော လှည့်ကွက်ပင်ဖြစ်သည်။", choices: [{ text: "အရေးယူခြင်း" }, { text: "ထောင်ချ" }, { text: "သတ်ခြင်း" }, { text: "အပြစ်ယူခြင်း" }], answer: ["သတ်ခြင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဂဠုန်ဆရာစံတို့၏ စခန်းကို မောင်နေဝင်း၊ ဒွေးတုတ်နှင့် ညိုညိုကိုမေးသောအခါ မောင်နေဝင်း၊ ဒွေးတုတ်တို့က မထုတ်ဖော်ခဲ့သော်လည်း ညိုညိုက __________ ဟုဖော်ခဲ့သည်။", choices: [{ text: "မြန်အောင်" }, { text: "ဟင်္သာတ" }, { text: "ငှက်ကြီးကွင်းနားက အင်တော" }, { text: "ပြဒါးရှင်ချောင်းနား" }], answer: ["ငှက်ကြီးကွင်းနားက အင်တော"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်တွင် အပြင်အားပြိုင်မှု တွင် __________ အားပြိုင်မှုသည် ပို၍ ပေါ်လွင်သည်။", choices: [{ text: "နယ်ချဲ့အလိုတော်ရိနှင့် ဒွေးတုတ် ၊မောင်နေဝင်း" }, { text: "နယ်ချဲ့အလိုတော်ရိနှင့် တော်လှန်သူ" }, { text: "နယ်ချဲ့အလိုတော်ရိနှင့် ပတ်ဝန်းကျင်" }, { text: "နယ်ချဲ့အလိုတော်ရိနှင့် သူပုန်" }], answer: ["နယ်ချဲ့အလိုတော်ရိနှင့် ဒွေးတုတ် ၊မောင်နေဝင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်တွင် <br>အမယ်မင်း...မောင့်ကိုယ်က အေးစက်စက်ကြီးပါလား... <br>အော်...တစ်ကိုယ်လုံး စိုလို့ရွှဲလို့\" <br> ဟူသော ညိုညို၏ ပြောစကားသည်မိုးစိုလာသည့်အပြင် ပြဒါးရှင်ချောင်းကို ဖြတ်လာရသည့်သဘောကိုပြသည့် __________ ပြကွက်ဖြစ်သည်။", choices: [{ text: "ယုတ္တိအားဖြည့်" }, { text: "အားပြိုင်" }, { text: "နောက်ခံ" }, { text: "မချင့်မရဲ" }], answer: ["ယုတ္တိအားဖြည့်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဇာတ်ဆောင် အချီအချ ပြောစကားများတွင် ထိုခေတ်သုံး ဝေါဟာရများမှ ဗလူချိစစ်သား ဟူသည်မှာ __________ အနက်ဖြစ်သည်။", choices: [{ text: "၁၉၀၀မှ ၁၉၄၇ ခုနှစ်အထိ တာဝန်ထမ်းဆောင်ခဲ့သော ဗြိတိသျှအိန္ဒိယစစ်တပ်၏ စစ်သားများ" }, { text: "၁၉၂၂မှ ၁၉၄၇ ခုနှစ်အထိ တာဝန်ထမ်းဆောင်ခဲ့သော ဗြိတိသျှအိန္ဒိယစစ်တပ်၏ စစ်သားများ" }, { text: "၁၉၂၂မှ ၁၉၄၇ ခုနှစ်အထိ တာဝန်ထမ်းဆောင်ခဲ့သောအိန္ဒိယစစ်တပ်၏ စစ်သားများ" }, { text: "၁၉၂၂မှ ၁၉၄၇ ခုနှစ်အထိ တာဝန်ထမ်းဆောင်ခဲ့သောတရုတ်စစ်တပ်၏ စစ်သားများ" }], answer: ["၁၉၂၂မှ ၁၉၄၇ ခုနှစ်အထိ တာဝန်ထမ်းဆောင်ခဲ့သော ဗြိတိသျှအိန္ဒိယစစ်တပ်၏ စစ်သားများ"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "သင်သည် ဖရေးတက်၏ ပိရမစ်သီအိုရီကို အသုံးချ၍ အာဇာနည်မိခင်ပြဇာတ်ကို လေ့လာလျှင် ရှေးဦးစွာ ဇာတ်လမ်းစစချင်းလေ့လာရာကို __________ မှစ အသုံးချ လေ့လာရမည်။", choices: [{ text: "ဇာတ် အစ" }, { text: "ဇာတ် အဖွင့်" }, { text: "ဇာတ်ပျိုး၊ ဇာတ်နှိုး" }, { text: "ဇာတ်အခြေ" }], answer: ["ဇာတ်ပျိုး၊ ဇာတ်နှိုး"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်သည် မည်သူတို့ကို တန်ဖိုးထားဂုဏ်ပြုသော ပြဇာတ်ဖြစ်သနည်း။", choices: [{ text: "မောင်နေဝင်း" }, { text: "မစွန့်ဘဲစားချင်သူတွေများတဲ့ခေတ်မှာ စွန့်ပြီးမစားသွားသော အာဇာနည်များ" }, { text: "ဒွေးတုတ်" }, { text: "မောင်ထင်" }], answer: ["မစွန့်ဘဲစားချင်သူတွေများတဲ့ခေတ်မှာ စွန့်ပြီးမစားသွားသော အာဇာနည်များ"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်သည် ဒိဋ္ဌဓမ္မလူ့လောကရှိ တောင်သူလယ်သမားတို့၏ သရုပ်မှန် ဖြစ်ရပ်ပေါ်တွင် အခြေတည်မှီးကာ စာရေးသူ၏ အတွေးအမြင်ကို သူ၏ __________ ဖြင့် ဖန်တီးဇာတ်လမ်းဆင်ထားခဲ့ခြင်း ဖြစ်သည်။", choices: [{ text: "သိမှု" }, { text: "ခံစားမှု" }, { text: "အကြံဉာဏ်" }, { text: "စိတ်ကူးဉာဏ်" }], answer: ["စိတ်ကူးဉာဏ်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အာဇာနည်မိခင်ပြဇာတ်ကို ဖန်တီးထားမှုတွင် __________ သည် အရေးအပါဆုံးဖြစ်သည်။", choices: [{ text: "ဇာတ်လမ်း" }, { text: "ဇာတ်ဆောင်" }, { text: "ကာလနှင့်နေရာ" }, { text: "စကားပြေ" }], answer: ["ဇာတ်လမ်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အရေးနှင့်အပြော ကွာခြားချက်တစ်ရပ်မှာ စာရေးသည့်အခါ ရေးသူ၏အဆိုကို __________ သည့် အကြောင်းပြစကားများ မဖြစ်မနေ ထည့်ရေးပေးရခြင်းဖြစ်သည်။", choices: [{ text: "ထောက်ပံ့" }, { text: "ချေပ" }, { text: "ဖျက်သိမ်း" }, { text: "အစားထိုး" }], answer: ["ထောက်ပံ့"], multiple: false, marks: 1 },
                ], 
                count: 66 
            },
        sectionB: {
            questions: [
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပြောတဲ့အခါနှင့်ရေးတဲ့အခါ မည်သို့ကွာခြားသနည်း။", choices: [{ text: "စာရေးသူကို စာဖတ်သူက နားမလည်တာနဲ့ မေးခွင့်ရှိ" }, { text: "ပြောသူကို နားထောင်သူက နားမလည်လျှင်မေးလို့ရနိုင်သော်လည်း စာဖတ်သူက စာရေးသူကို မေးလို့မရ" }, { text: "ပြောသူကို နားထောင်သူက နားမလည်လျှင် မေးလို့မရ" }, { text: "နားထောင်သူရော စာဖတ်သူပါ နားမလည်တာနဲ့ ပြောသူရော စာရေးသူကိုပါ မေးလို့ရ" }], answer: ["ပြောသူကို နားထောင်သူက နားမလည်လျှင်မေးလို့ရနိုင်သော်လည်း စာဖတ်သူက စာရေးသူကို မေးလို့မရ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အောက်ပါတို့မှ ကျယ်လွန်းသော အဆိုဝါကျကို ရွေးပါ။", choices: [{ text: "ရေလွှာလျှောစီးအားကစားသည် အန္တရာယ်များသည်။" }, { text: "တောင်တက်အားကစားသည် အန္တရာယ်များသည်။" }, { text: "အားကစားများ အားလုံး အန္တရာယ်ရှိသည်။" }, { text: "ရေခဲပြင်စကိတ်စီးအားကစားသည် အန္တရာယ်များသည်။" }], answer: ["အားကစားများ အားလုံး အန္တရာယ်ရှိသည်။"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အောက်ပါတို့မှ ကျဉ်းလွန်းသော အဆိုဝါကျကို ရွေးပါ။", choices: [{ text: "ကျွန်တော်တို့ နောင်ချိုမြို့လေးသည် အလွန်အေးချမ်းသည်။" }, { text: "ကျွန်တော့်ဇာတိ နောင်ချိုမြို့လေးသည် သာယာလှသည်။" }, { text: "ကျွန်တော်သည် မွေးရပ်မြေနောင်ချိုမြို့လေးကို အလွန်တွယ်တာပါသည်။" }, { text: "ကျွန်တော်တို့မြို့က နောင်ချိုမြို့ပါ။" }], answer: ["ကျွန်တော်တို့မြို့က နောင်ချိုမြို့ပါ။"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ရည်ညွှန်းခံနှင့် စာရေးသူ၏ သဘောထားပါလျှင် မည်သို့သော ဝါကျမျိုးဖြစ်သနည်း။", choices: [{ text: "အကြောင်းပြဝါကျ" }, { text: "ထိရောက်သော အဆိုဝါကျ" }, { text: "ဆန္ဒဝါကျ" }, { text: "မေးခွန်းဝါကျ" }], answer: ["ထိရောက်သော အဆိုဝါကျ"], multiple: false, marks: 1 },  
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "မင်္ဂလာထမင်းဆိုင်တွင် အလုပ်လုပ်ရသည်မှာ ကျွန်တော့်အတွက် စိတ်ပျက်စရာ အကောင်းဆုံး ဖြစ်ပါသည် ဟူသော အဆိုကို အထောက်အပံ့မပေးနိုင်သည့် ဝါကျကို ရွေးပါ။", choices: [{ text: "လစာမှာ အလွန်နည်းသည်။" }, { text: "မနက်မိုးလင်းမှ ညသန်းခေါင်ထိအလုပ်လုပ်ရသည်။" }, { text: "ကျွန်တော်သည် အစားအသောက်အလွန်ဇီဇာကြောင်သည်။" }, { text: "အလုပ်ရှင်သည် အလွန်အပေါက်ဆိုးသည်။" }], answer: ["ကျွန်တော်သည် အစားအသောက်အလွန်ဇီဇာကြောင်သည်။"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဆရာစောလူက စာရေးရန်နည်းလမ်း မည်မျှကို လမ်းညွှန်ခဲ့သနည်း။", choices: [{ text: "၁" }, { text: "၃" }, { text: "၄" }, { text: "၅" }], answer: ["၅"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "နည်းလမ်းငါးသွယ်တွင် မပါဝင်သည့် စာရေးနည်းကို ဖော်ပြပါ။", choices: [{ text: "လွတ်လွတ်လပ်လပ်ရေးချ" }, { text: "အားပြိုင်မှုသုံး၍ ရေးနည်း" }, { text: "စာရင်းချရေး" }, { text: "ပုံကြမ်းလောင်းရေး" }], answer: ["အားပြိုင်မှုသုံး၍ ရေးနည်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "လွတ်လွတ်လပ်လပ်ရေးချလိုက်ခြင်းဖြင့် မည်သည့် အကျိုးရနိုင်သနည်း။", choices: [{ text: "အချိန်ကုန်မြန်" }, { text: "ရသမြောက်နိုင်" }, { text: "မှုန်ဝါးနေသော စိတ်ကူးတွေ ရှင်းရှင်းလင်းလင်းဖြစ်လာနိုင်" }, { text: "နာမည်ကြီးစာရေးဆရာဖြစ်နိုင်" }], answer: ["မှုန်ဝါးနေသော စိတ်ကူးတွေ ရှင်းရှင်းလင်းလင်းဖြစ်လာနိုင်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“မိုးရွာပြီ။” ဟူသော ဝါကျကို မည်သို့ အနုစိတ်ရေးနိုင်သနည်း။", choices: [{ text: "မိုးတပေါက်ပေါက်ရွာလာပြီ။" }, { text: "မိုးလာပြီ။" }, { text: "မိုးကျပြီ။" }, { text: "မိုးစဲပြီ။" }], answer: ["မိုးတပေါက်ပေါက်ရွာလာပြီ။"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ပေးထားသော အချက်များသည် နည်းလမ်းငါးသွယ်တွင် မည်သည့်နည်းလမ်းကို အသုံးပြု ရေးသားထားခြင်းဖြစ်သနည်း။","image": "images/myan/sq_76.png", choices: [{ text: "စာရင်းချခြင်း" }, { text: "ကိုယ့်ကိုယ်ကိုယ်မေးခွန်းထုတ်ကြည့်ခြင်း" }, { text: "ပုံကြမ်းလောင်းခြင်း" }, { text: "လွတ်လွတ်လပ်လပ်ရေးချခြင်း" }], answer: ["ကိုယ့်ကိုယ်ကိုယ်မေးခွန်းထုတ်ကြည့်ခြင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“အလုပ်ရှင်ကဆိုး<br>ဆိုင်က အခြေအနေမကောင်း<br>မနက် ၇ နာရီက ည ၈ နာရီထိ အလုပ်လုပ်ရ<br>ရတဲ့ ပိုက်ဆံက ၁၀၀၀<br>နားချိန်မရှိ<br>ဆူသံကြိမ်းသံတွေညံ” စသည်ဖြင့် စိတ်ကူးထဲတွင်ပေါ်လာသမျှကို အစီအစဉ်တကျမဖြစ်သော်လည်း အချက်အလက်များ ချရေးထားသည့် အထက်ဖော်ပြချက်သည် မည်သည့်နည်းလမ်းဖြစ်သနည်း။", choices: [{ text: "စာရင်းချကြည့်ခြင်း" }, { text: "ပုံကြမ်းလောင်းခြင်း" }, { text: "တွဲစပ်ကြည့်ခြင်း" }, { text: "မေးခွန်းထုတ်ကြည့်ခြင်း" }], answer: ["စာရင်းချကြည့်ခြင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အောက်ဖော်ပြချက်သည် မည်သည့်နည်းလမ်းသုံးထားသနည်း။","image": "images/myan/sq_78.png", choices: [{ text: "တွဲစပ်ကြည့်နည်း" }, { text: "လွတ်လွတ်လပ်လပ်ချရေးနည်း" }, { text: "ပုံကြမ်းလောင်းနည်း" }, { text: "မေးခွန်းထုတ်ကြည့်နည်း" }], answer: ["တွဲစပ်ကြည့်နည်း"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ခွန်အားရှိသောစာဖြစ်ရန် မည်သည့်အချက်လိုအပ်သနည်း။", choices: [{ text: "ကဗျာစပ်တတ်ခြင်း" }, { text: "ရေးလိုသည့်အကြောင်းအရာကို ကောင်းစွာနားလည်ခြင်း" }, { text: "ဂုဏ်မြောက်အောင်ရေးတတ်ခြင်း" }, { text: "အလင်္ကာပါအောင် ရေးတတ်ခြင်း" }], answer: ["ရေးလိုသည့်အကြောင်းအရာကို ကောင်းစွာနားလည်ခြင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "တချို့သော စာရေးသူတို့သည် သာမာန်ကာလျှံကာမျှအသိကို တကယ်သိထင်ပြီး ဖြန်းသန်းကာ ရေးတတ်ပြောတတ်ခြင်းသည် မည်သည်ကို ဖော်ပြသနည်း။", choices: [{ text: "အချက်ကျကျရေးတတ်ပြောတတ်ခြင်း" }, { text: "ကြံ့ခိုင်ကျစ်လျစ်သော ဝါကျမျိုးသုံးခြင်း" }, { text: "စကားပြေပြစ်စွာပြောခြင်း" }, { text: "ရေးလိုပြောလိုသော အကြောင်းအရာကို ကောင်းစွာ နားမလည်ခြင်း" }], answer: ["ရေးလိုပြောလိုသော အကြောင်းအရာကို ကောင်းစွာ နားမလည်ခြင်း"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“လှပသောအိမ်ထမင်းများကို မမက သေသေချာချာ ချက်ထားသည်။” ဟူသော ဝါကျသည် ဘာကြောင့် ခွန်အားရှိသောစာ မဖြစ်သနည်း။", choices: [{ text: "အထူးပြုပုဒ် “လှပသော” ကို နေရာမှန် မသုံးထားသောကြောင့်" }, { text: "အထူးပြုပုဒ် “သေသေချာချာ” ကို နေရာမှန်မသုံးသောကြောင့်" }, { text: "ကတ္တားပုဒ် \"မမ\"ကို ဝါကျအစတွင်မရေးသောကြောင့်" }, { text: "“ကို” နှင့် “အား” မှားသုံးသောကြောင့်" }], answer: ["အထူးပြုပုဒ် “လှပသော” ကို နေရာမှန် မသုံးထားသောကြောင့်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အဘိဓာန်ကဲ့သို့ စကားလုံးများတတ်ထားသော်လည်း ခွန်အားရှိသောစာမျိုး မရေးတတ်ခြင်းမှာ အဘယ်ကြောင့်နည်း။", choices: [{ text: "ကြံ့ခိုင်ကျစ်လျစ်သောဝါကျမျိုး မတည်ဆောက်တတ်သောကြောင့်" }, { text: "ရွေးချယ်တတ်သည့်အသိဉာဏ်မရှိသောကြောင့်" }, { text: "ရေးလိုသည်ကို သေချာမသိသောကြောင့်" }, { text: "သဒ္ဒါမတတ်သောကြောင့်" }], answer: ["ရွေးချယ်တတ်သည့်အသိဉာဏ်မရှိသောကြောင့်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အချက်ကျကျရေးတတ်ခြင်းသည် မည်သို့နည်း။", choices: [{ text: "သူ့နေရာနှင့်သူ တိကျမှန်ကန်သော စကားများ ရွေးချယ်သုံးနှုန်းတတ်ခြင်း" }, { text: "ကျစ်လျစ်အောင်ရေးတတ်ခြင်း" }, { text: "ရသမြောက်အောင်ရေးတတ်ခြင်း" }, { text: "အလင်္ကာပါအောင် ရေးတတ်ခြင်း" }], answer: ["သူ့နေရာနှင့်သူ တိကျမှန်ကန်သော စကားများ ရွေးချယ်သုံးနှုန်းတတ်ခြင်း"], multiple: false, marks: 1 },  
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ရန်ကုန်ဘဆွေပြောသည့် စာရေးနည်းနှစ်မျိုးကိုဖော်ပြပါ။", choices: [{ text: "တိုက်ရိုက်ရေးနည်းနှင့် သွယ်ဝိုက်ရေးနည်း" }, { text: "အလင်္ကာနှင့်ရသမြောက်အောင်ရေးနည်း" }, { text: "သဒ္ဒါမှန်မှန်ရေးနည်းနှင့် အနက်မှန်အောင်ရေးနည်း" }, { text: "အားပြိုင်မှုရေးနည်းနှင့် ရှုထောင့်မှန်အောင်ရေးနည်း" }], answer: ["တိုက်ရိုက်ရေးနည်းနှင့် သွယ်ဝိုက်ရေးနည်း"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စာရေးသူတို့သည် ဘာကြောင့် စာရေးကြသနည်း။", choices: [{ text: "မိမိခံစားရသည်ကို စာဖတ်သူတို့ခံစားနားလည်နိုင်ရန်" }, { text: "နာမည်ကြီးချင်သောကြောင့်" }, { text: "စား ဝတ်နေရေးအဆင်ပြေချင်သောကြောင့်" }, { text: "သဒ္ဒါမှန်မှန်ရေးတတ်ချင်သောကြောင့်" }], answer: ["မိမိခံစားရသည်ကို စာဖတ်သူတို့ခံစားနားလည်နိုင်ရန်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စာရေးသူသည် မိမိစာကို ဖတ်ကောင်းစေရန် မည်သည့်စကားလုံးများကို သုံးနှုန်းတတ်သနည်း။", choices: [{ text: "ဖတ်ဖူးသောရှေးစာများမှ စကားလုံးလှလှလေးများ" }, { text: "နာမဝိသေသနစကားလုံးများ" }, { text: "ကြိယာဝိသေသနစကားလုံးများ" }, { text: "ဝိဘတ်စကားလုံးများ" }], answer: ["ဖတ်ဖူးသောရှေးစာများမှ စကားလုံးလှလှလေးများ"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "အောက်ပါတို့မှ အမည်ကို တိုက်ရိုက်ရေးနည်းဖြင့် ပေါ်လွင်အောင် ရှင်းလင်းရေးသားထားချက်ကို ဖော်ပြပါ။", choices: [{ text: "ကျွန်တော်က ကျောင်းသားပါ။" }, { text: "မြင်းပန်းထိမ်ဟု ခေါ်တွင်ရခြင်းအကြောင်းရင်းကား ပန်းထိမ်လုပ်ရင်း မြင်းမွေးသောကြောင့်တည်း။" }, { text: "သူက ဆိုးတယ်။" }, { text: "မမက ကူညီတတ်တယ်။" }], answer: ["မြင်းပန်းထိမ်ဟု ခေါ်တွင်ရခြင်းအကြောင်းရင်းကား ပန်းထိမ်လုပ်ရင်း မြင်းမွေးသောကြောင့်တည်း။"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“ပခုက္ကူလှေထိုးသား ကိုနက်ပုနှင့် မြင်းခြံငရုတ်ခင်းမှ မအိမ်ကောင်း တို့၏ တစ်ဦးတည်းသော အဖေရော အမေရောတူသည့် သမီးချောကား ယခုရန်ကုန်တက္ကသိုလ် ကျောင်းတော်ကြီး၌ မြင့်မားသော ဆံထုံးကြီးရှင်ဖြစ်လျက် “ကက်သလိန်း ဂေါက်တေးပု၊ ကက်သလိန်း ဂေါက်တေးပု” ဟူသောအမည်ဖြင့် ကျောင်းသားတို့ ပါးစပ်ဖျားတွင် ရေပန်းစားလျက်ရှိသည်။” ဟူသော အဖွဲ့သည် မည်သည့်ရေးနည်းဖြင့် မည်သည်ကိုပေါ်လွင်အောင်ရေးထားသနည်း။", choices: [{ text: "အမည်ကို တိုက်ရိုက်ရေးနည်းဖြင့်ရေး" }, { text: "အမည်ကို သွယ်ဝိုက်ရေးနည်းဖြင့်ရေး" }, { text: "အမည်ကို ထင်ရှားအောင်ရေး" }, { text: "အမည်ကို ကွယ်ဝှက်ရေး" }], answer: ["အမည်ကို တိုက်ရိုက်ရေးနည်းဖြင့်ရေး"], multiple: false, marks: 1 },  
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ရသဖန်တီးသူသည် အဘယ်ကြောင့် အခရာဖြစ်သနည်း။", choices: [{ text: "ရသဖန်တီးသူသည် နာမည်ကြီးသောကြောင့်" }, { text: "ရသစာပေကို ချစ်မြတ်နိုးသောကြောင့်" }, { text: "ရသဖြစ်ပေါ်စေသည့် အကြောင်းရင်းခံဖြစ်သောကြောင့်" }, { text: "စာဖတ်သူကို ဆွဲဆောင်နိုင်သောကြောင့်" }], answer: ["ရသဖြစ်ပေါ်စေသည့် အကြောင်းရင်းခံဖြစ်သောကြောင့်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ရသဖန်တီးသူ၊ ရသနှင့် ရသခံစားသူ တွင် မည်သည့်ပညာရှင်တို့၏ အဆိုအမိန့်များကို သိရှိခဲ့သနည်း။", choices: [{ text: "ဆရာဇော်ဂျီနှင့် ဆရာမောင်ခင်မင်(ဓနုဖြူ)" }, { text: "ဆရာရွှေဥဒေါင်းနှင့် ဆရာပီမိုးနင်း" }, { text: "ဆရာစောလူနှင့် ဆရာမောင်ခင်မင်(ဓနုဖြူ)" }, { text: "ဆရာရန်ကုန်ဘဆွေနှင့် ဆရာဇေယျ" }], answer: ["ဆရာဇော်ဂျီနှင့် ဆရာမောင်ခင်မင်(ဓနုဖြူ)"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ရသစာပေဆိုင်ရာစိတ်ကူးဉာဏ်နှင့် စိတ်ကူးယဉ် မည်သို့ ကွာခြားသနည်း။", choices: [{ text: "စိတ်ကူးဉာဏ်ကို စာရေးသူကလုပ်၊ စိတ်ကူးယဉ်ကို စာဖတ်သူကလုပ်" }, { text: "ရသစာပေဆိုင်ရာစိတ်ကူးဉာဏ်သည်ပတ်ဝန်းကျင်ကို သတိပြုမိစေ ဘဝအသိနှင့် ဘဝအမြင်ပေးနိုင်၊ စိတ်ကူးယဉ်သည် တကယ့်လောကနှင့်ကင်းလွတ်" }, { text: "ရသစာပေဆိုင်ရာစိတ်ကူးဉာဏ်သည် ခက်ခဲ၊ စိတ်ကူးယဉ်သည် လွယ်ကူ" }, { text: "ရသစာပေဆိုင်ရာစိတ်ကူးဉာဏ်နှင့် စိတ်ကူးယဉ်ခြင်းသည် တန်ဖိုးချင်းကွာ" }], answer: ["ရသစာပေဆိုင်ရာစိတ်ကူးဉာဏ်သည်ပတ်ဝန်းကျင်ကို သတိပြုမိစေ ဘဝအသိနှင့် ဘဝအမြင်ပေးနိုင်၊ စိတ်ကူးယဉ်သည် တကယ့်လောကနှင့်ကင်းလွတ်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စေတနာအနက်အရှိုင်းကွာသောကြောင့် မှီငြမ်းဝတ္ထုသည် ကိုယ်တိုင်ရေးဝတ္ထုလောက် ဘဝအာနိသင်မပေးနိုင်ဟု မိန့်ဆိုချက်ကို ဘာကြောင့် လက်မခံနိုင်သနည်း။", choices: [{ text: "မှီငြမ်းဝတ္ထုတိုင်း စေတနာနည်းပြီး ကိုယ်တိုင်ရေးဝတ္ထုတိုင်း စေတနာကောင်းသောကြောင့်" }, { text: "ကိုယ်တိုင်ရေးဝတ္ထုတိုင်း ဘဝအာနိသင်မပေးနိုင်သကဲ့သို့ မှီငြမ်းဝတ္ထုတိုင်း စေတနာမနည်းနိုင်သောကြောင့် (သာဓက။ The old man and the sea ကို ဘာသာပြန်မှီငြမ်းသည့် ပင်လယ်ပြာနှင့် ကိုတံငါ သည် အာနိသင်အပြည့်ပေးနိုင်)" }, { text: "ကိုယ်တိုင်ရေးဝတ္ထုက ဖတ်ရလွယ်သောကြောင့်" }, { text: "မှီငြမ်းဝတ္ထုက ကိုယ်ပိုင်စိတ်ကူးဉာဏ်မဟုတ်သောကြောင့်" }], answer: ["ကိုယ်တိုင်ရေးဝတ္ထုတိုင်း ဘဝအာနိသင်မပေးနိုင်သကဲ့သို့ မှီငြမ်းဝတ္ထုတိုင်း စေတနာမနည်းနိုင်သောကြောင့် (သာဓက။ The old man and the sea ကို ဘာသာပြန်မှီငြမ်းသည့် ပင်လယ်ပြာနှင့် ကိုတံငါ သည် အာနိသင်အပြည့်ပေးနိုင်)"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဘဝအာနိသင်ရသရနိုင်ပုံကို ရသစာပေတစ်ပုဒ်နှင့် ထင်ဟပ်ဖြေဆိုပါ။", choices: [{ text: "“ပန်းပန်လျက်ပဲ” ကဗျာမှ လောကဓံကို ကြံ့ကြံ့ခံနိုင်သည့်အားမာန်ကို ရနိုင်ခြင်းသည် ဘဝအာနိသင်ရသဖြစ်" }, { text: "ဘုရားဖူးသွားခြင်းသည် သိင်္ဂါရရသခံစားရနိုင်ခြင်းသည် ဘဝအာနိသင်ရသဖြစ်" }, { text: "ဖိုးမောင်လာပြီသည် ကရုဏာရသခံစားရနိုင်ခြင်းသည် ဘဝအာနိသင်ရသဖြစ်" }, { text: "ကျစွာမင်းမိထွေးတော်ကျောက်စာသည် ရုဒ္ဒရသခံစားရနိုင်ခြင်းသည် ဘဝအာနိသင်ရသဖြစ်" }], answer: ["“ပန်းပန်လျက်ပဲ” ကဗျာမှ လောကဓံကို ကြံ့ကြံ့ခံနိုင်သည့်အားမာန်ကို ရနိုင်ခြင်းသည် ဘဝအာနိသင်ရသဖြစ်"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဘယ်လိုဘယ်ပုံရေးသားပုံကို ပြောခြင်းသည် မည်သည်ကို ဆိုလိုသနည်း။", choices: [{ text: "စာရေးဆရာ" }, { text: "ရသစာပေ" }, { text: "ဝတ္ထုဖန်တီးခြင်း" }, { text: "ရေးဟန်" }], answer: ["ရေးဟန်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဆရာကြီးမောင်ခင်မင်(ဓနုဖြူ)က စာရေးရာတွင် အဆင့်မည်မျှရှိသည်ဟု ပြောခဲ့သနည်း။", choices: [{ text: "၁ ဆင့်" }, { text: "၂ ဆင့်" }, { text: "၃ ဆင့်" }, { text: "၄ ဆင့်" }], answer: ["၂ ဆင့်"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "ဘယ်လိုရေးသည် ဆိုသောစကားကို တစ်နည်းအားဖြင့် မည်သို့ဆိုနိုင်သနည်း။", choices: [{ text: "စာရေးနည်းကို ဆိုခြင်းဖြစ်သည်။" }, { text: "“ဘာသာစကားကို ဘယ်လိုအသုံးပြုထားသည်” ဟု ဆိုခြင်း ဖြစ်သည်။" }, { text: "သဒ္ဒါမှန်အောင်ရေးနည်းကို ဆိုခြင်းဖြစ်သည်။" }, { text: "ဝေါဟာရအသုံးမှန်အောင် ရေးခြင်းဖြစ်သည်။" }], answer: ["“ဘာသာစကားကို ဘယ်လိုအသုံးပြုထားသည်” ဟု ဆိုခြင်း ဖြစ်သည်။"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စာရေးသူတစ်ဦး၏ ဟန်ပန်မူရာ၊ သဘောထား၊ ခံစားမှုတို့သည် သူ့စာထဲတွင် အနည်းနှင့်အများ ထင်ဟပ်ပုံပေါ်နေတတ်ခြင်းသည် မည်သည့်ရေးဟန်သဘောဖြစ်သနည်း။", choices: [{ text: "အကြောင်းအရာနှင့်ပုံသဏ္ဌာန်တသားတည်းဖြစ်သည်။" }, { text: "ရွေးချယ်မှုဖြစ်သည်။" }, { text: "ဟန်သည်လူကိုယ်တိုင်ဖြစ်သည်။" }, { text: "နေရာတကျသုံးထားခြင်းဖြစ်သည်။" }], answer: ["ဟန်သည်လူကိုယ်တိုင်ဖြစ်သည်။"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "သိပ္ပံမောင်ဝက “မင်္ဂလာဆောင်တွင် ဖတ်ရမည့်ဩဘာစာကို ဝါကျတိုတို တောင်းတောင်းကလေးများနှင့် ရေးသားမည် ဆိုလျှင် လူရယ်စရာဖြစ်နေပေလိမ့်မည်။ တစ်ယောက်နှင့် တစ်ယောက် အချင်းဖြစ်ပွားသောအကြောင်း၊ မီးလောင်၍ ပြေးလွှားရသော အကြောင်းများကို ရေးသောအခါ မင်္ဂလာဆောင် ဩဘာစာကဲ့သို့ ရေးသားနေမည်ဆိုလျှင် လူရယ်စရာ ဖြစ်သွားမည်ကိုလည်း သတိထားသင့်လှပေသည်” ဟု မိန့်ဆိုဖူးပါသည်။ ဤသည်မှာ မည်သည့်ရေးဟန်ကို သုံးသင့်ကြောင်း လမ်းညွှန်ထားခြင်းဖြစ်သနည်း။", choices: [{ text: "ရေးဟန်သည် နေရာတကျသုံးထားခြင်းဖြစ်သည်။" }, { text: "ဟန်သည်လူကိုယ်တိုင်ဖြစ်သည်။" }, { text: "သိပ္ပံမောင်ဝသည် စာကောင်းရေးနိုင်သည်။" }, { text: "စာရေးကောင်းလျှင် ရေးဟန်ကောင်းသည်။" }], answer: ["ရေးဟန်သည် နေရာတကျသုံးထားခြင်းဖြစ်သည်။"], multiple: false, marks: 1 }, 
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "စာရေးသူတို့သည် စိတ်ကူးဉာဏ် ဦးဆောင်မှုဖြင့် မည်သည်တို့ကို ရွေးချယ်မှုပြု၍ ရသစာပေတို့ကို ဖန်တီးကြသနည်း။", choices: [{ text: "သဒ္ဒါစနစ်" }, { text: "စာရေးနည်းစနစ်" }, { text: "စာပေခေတ်" }, { text: "စကားလုံးများ၊ အလင်္ကာများ၊ ကာရန်စနစ်များ" }], answer: ["စကားလုံးများ၊ အလင်္ကာများ၊ ကာရန်စနစ်များ"], multiple: false, marks: 1 },
                { type: "MCQ", instruction: "အောက်ပါတို့မှ အဖြေမှန်ကို ရွေးပါ။",question: "“ဗိုက်ကြီးသည်” ဟုပြောခြင်း နှင့် “ကိုယ်ဝန်ဆောင်” ဟုပြောခြင်းသည် အဓိပ္ပာယ်တူသော်လည်း အဘယ်ကြောင့် ကွဲပြားနေသနည်း။", choices: [{ text: "ဗိုက်ကြီးသည် ဟု တိုက်ရိုက်ဖော်ပြသည့်အဘိဓာန်အနက် ကြောင့်" }, { text: "ကိုယ်ဝန်ဆောင်သည် စာနာသည့်အငွေ့အသက်ထင်ဟပ်သည့် ဂယက်အနက် ဖြစ်သောကြောင့်" }, { text: "စကားအထားအသိုမှန်သည့် သဒ္ဒါအနက် ကြောင့်" }, { text: "ရှင်းလင်းပြေပြစ်သည့် အနက်ရိုးကြောင့်" }], answer: ["ကိုယ်ဝန်ဆောင်သည် စာနာသည့်အငွေ့အသက်ထင်ဟပ်သည့် ဂယက်အနက် ဖြစ်သောကြောင့်"], multiple: false, marks: 1 }
                ],
                count: 34
            }
    },
    English: {
        sectionA: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "I. Read the passage.",
                    question: "<strong>Elon Musk</strong><br>     Elon Musk, an American entrepreneur, is now one of the richest persons in the world and the CEO or owner of multiple companies including Tesla, SpaceX, and Twitter. He was born in South Africa in 1971. When do you think he started his business? Musk was only 12 when he created a video game and sold it to a computer magazine. He cofounded PayPal, an electronic payment firm in 1999. In 2002, he founded SpaceX, an American spacecraft manufacturer, launch service provider, and satellite communications company. He also operated Starlink, a satellite internet constellation that provides satellite internet access coverage to over 60 countries. This technology enables users to access the internet regardless of their geographical location. In 2004, he became one of the first significant investors as well as the chief executive officer of Tesla, the electric car manufacturer. In 2022, Musk acquired Twitter and changed its logo from the blue bird to \"X\".<br> <br><strong>Steve Jobs</strong><br>Steve Jobs, an American businessman who founded Apple Inc. and NeXT Inc., was born in San Francisco, California, U.S. in 1955. Jobs was only 19 when he started his invention - the Apple I, which he called the logic board. You might be amazed to know where and how he invented it. Jobs and his former high school friend Stephen Wozniak designed it in his family garage with the money obtained by selling Jobs's Volkswagen minibus and Wozniak's programmable calculator. The personal computer, the Apple, appealed to a broad audience and gradually, Jobs became one of the first entrepreneurs. With Jobs's encouragement, Wozniak designed an improved model, the Apple II, complete with a keyboard, and they arranged to have a sleek, molded plastic case manufactured to enclose the unit.<br><br> <strong>Choose the best answer to complete each sentence.</strong><br><br>1. To start a business, Elon Musk sold the video game he created to ______ .<br>A. an electronic payment firm<br>B. multiple companies<br>C. a computer magazine<br>D. Paypal<br><strong>ANSWER: </strong> {1:dropdown:A,B,C,D:C} <br><br>2. Over 60 countries can have internet ______ provided by Starlink.<br>A. access<br>B. constellation  <br>C. coverage<br>D. satellite<br><strong>ANSWER: </strong> {2:dropdown:A,B,C,D:A} <br><br>3. The author uses the rhetorical question \"When do you think he started his business?\" because he wants  ______ .<br>A. the reader to think deeply<br>B. to put emphasis on the age when Elon Musk started creating a video game<br>C. to ask for the reader's opinion<br>D. to shift the focus from when and where he was born to when he started business<br><strong>ANSWER: </strong> {3:dropdown:A,B,C,D:B} <br><br>4. In 2002, Elon Musk founded SpaceX to ______ spacecrafts.<br>A. operate<br>B. provide <br>C. start  <br>D. manufacture<br><strong>ANSWER: </strong> {4:dropdown:A,B,C,D:D} <br><br>5. Before 2022, the logo of Twitter was  ______ .<br>A. a satellite<br>B. the blue bird<br>C. the electric car<br>D. X<br><strong>ANSWER: </strong> {5:dropdown:A,B,C,D:B} <br><br>6. The word \"acquired\" mostly means  ______ .<br>A. developed <br> B. gained<br>C. learned<br>D. obtained<br><strong>ANSWER: </strong> {6:dropdown:A,B,C,D:D} <br><br>7. Steve Jobs sold his Volkswagen minibus to get money to  ______ .<br>A. appeal to a broad audience<br>B. improve the model of the Apple II<br>C. invent the Apple I<br>D. programme a calculator<br><strong>ANSWER: </strong> {7:dropdown:A,B,C,D:C} <br><br>8. Steve Jobs ______ his friend Stephen Wozniak to improve the design of the model Apple II.<br>A. appealed<br>B. arranged<br>C. called<br>D. encouraged<br><strong>ANSWER: </strong> {8:dropdown:A,B,C,D:D} <br><br>9. It can be inferred from the text that the Apple II has a better ______ than the Apple I due to its keyboard and a sleek, molded plastic case.<br>      A. arrangement<br>     B. design<br>     C. enclosure<br>     D. unit<br>     <strong>ANSWER: </strong> {9:dropdown:A,B,C,D:B}<br><br>10. The above passage is mainly about  ______ .<br>     A. advancement of technology<br>     B. famous companies  <br>     C. two Apple computers  <br>     D. two successful entrepreneurs  <br><strong>     ANSWER: </strong> {10:dropdown:A,B,C,D:D} <br>", 
                    marks: 10
                }
            ],
            count: 1
        },
        sectionB: {
            questions: [
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "In the field of business, you need to ______ and challenge the old ways of working.", "choices": [{ "text": "go out on a limb" }, { "text": "stay ahead of the pack" }, { "text": "the bottom line" }, { "text": "think outside the box" }], "answer": ["think outside the box"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "Ko Khant aimed at ______ in digital marketing after earning his master’s degree.", "choices": [{ "text": "asserting one’s own identity" }, { "text": "following one’s own conscience" }, { "text": "developing qualities and skills" }, { "text": "inspiring confidence and trust" }], "answer": ["developing qualities and skills"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "A brave young hero gathered a group of warriors and ______ to battle the invaders.", "choices": [{ "text": "developed qualities and skills" }, { "text": "had a discussion" }, { "text": "founded an army" }, { "text": "made the right decision" }], "answer": ["founded an army"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "It is not a good idea to ______ others’ weaknesses.", "choices": [{ "text": "look at" }, { "text": "sneer at" }, { "text": "wait for" }, { "text": "warn of" }], "answer": ["sneer at"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "There should be humanitarian aid for the most ______ people, especially for those who are in a conflict zone.", "choices": [{ "text": "Beneficial" }, { "text": "optimistic" }, { "text": "ruthless" }, { "text": "vulnerable" }], "answer": ["vulnerable"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "He is such an energetic and self-confident person that he is always ______ about his future.", "choices": [{ "text": "optimistic" }, { "text": "blur" }, { "text": "daunting" }, { "text": "hard" }], "answer": ["optimistic"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "Nowadays, ______ lights are becoming more popular due to the frequent power outages.", "choices": [{ "text": "battery-powered" }, { "text": "electric-powered" }, { "text": "hand-powered" }, { "text": "solar-powered" }], "answer": ["solar-powered"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "The music Sheku created on the cello was ______.", "choices": [{ "text": "anti-jamming" }, { "text": "magic-like" }, { "text": "near-pinpoint" }, { "text": "satellite-guided" }], "answer": ["magic-like"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "There are a couple of things you need to ______ when you are going to take a listening test.", "choices": [{ "text": "come across" }, { "text": "look at" }, { "text": "keep in mind" }, { "text": "wait for" }], "answer": ["keep in mind"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "Every day we jump out of bed with the  ______  ring of the alarm clock, swallow a quick breakfast and then rush to catch the school bus.", "choices": [{ "text": "booming" }, { "text": "chanting" }, { "text": "ear-splitting" }, { "text": "soothing" }], "answer": ["ear-splitting"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "In the poem \"Equality\", the metaphor in the following lines suggests that _____. <br><i>\"You declare you see me dimly<br> through a glass which will not shine\"</i>", "choices": [{ "text": "the men in the society see the speaker while they are drinking alcohol" }, { "text": "society views the speaker through a lens of bias, preventing them from recognizing her true self and purpose" }, { "text": "people in society do not see the speaker clearly because there is a glass between them" }, { "text": "the society say that they see the speaker through a glass that is not clear" }], "answer": ["society views the speaker through a lens of bias, preventing them from recognizing her true self and purpose"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "In the following lines of the poem \"The Solitary Reaper\" the poet uses ______ to exaggerate the beauty of the solitary reaper’s song by comparing it to the song of a nightingale.<br><i> \"No Nightingale did ever chaunt <br>More welcome notes to weary bands\"</i>", "choices": [{ "text": "simile" }, { "text": "metaphor" }, { "text": "hyperbole" }, { "text": "apostrophe" }], "answer": ["hyperbole"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "The theme of the poem \"Equality\" is  ______ .", "choices": [{ "text": "racial and gender inequality" }, { "text": "women’s rights" }, { "text": "barriers for women’s success" }, { "text": "right to education for women" }], "answer": ["racial and gender inequality"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "In the poem \"Ballad of Birmingham\", the poet uses ______ by expressing that the mother considered the church as a secure place for her daughter, yet the daughter’s life was tragically taken in the church bombing.", "choices": [{ "text": "metaphor" }, { "text": "situational irony" }, { "text": "verbal irony" }, { "text": "simile" }], "answer": ["situational irony"], "multiple": false, "marks": 1 },
                { "type": "MCQ", instruction: "Choose the best answer to complete each sentence.", "question": "The following lines of the poem \"Democracy\" mean that the speaker in the poem _____. <br><i>\"I do not need my freedom when I’m dead.<br> I cannot live on tomorrow’s bread.\"</i>", "choices": [{ "text": "is patient and can wait till the time for change comes" }, { "text": "hopes there will be changes in the near future" }, { "text": "will start to try to gain democracy the next day" }, { "text": "cannot wait, but needs the urgent change for democracy" }], "answer": ["cannot wait, but needs the urgent change for democracy"], "multiple": false, "marks": 1 }
            ],
            count: 15
        },
        sectionC: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "Read the passage.", 
                    question: "Throughout history, there have been outstanding persons who have captured the world’s attention. People respect what they do and what they say. Nelson Mandela is one such person. His life has been a remarkable tale of bravery, willpower, and strong beliefs. He said, “People respond in accordance to how you relate to them. If you approach them on the basis of violence, that’s how they’ll react. But if you say we want peace, we want stability, we can then do a lot of things that will contribute towards the progress of our society.” This means people react according to your action. If you use violence, they will react violently. According to Mandela, if we have peace and stability, we can do many things for the development of the country.<br><br>He also added that education should reach everybody in a country. Without education, children can never really meet the challenges they will face. Education is essential for children to play a role in nation-building. As he has said, Mandela has spent a lot of time for children over the years. Like Mandela, there are so many men and women whose contribution to the development of society has been enormous. Some of them are not very famous. But we are very impressed by their actions. Those are heroes or heroines we must never forget. We admire them for their service to society.<br><br>A. Match the words in Column A with their meanings in Column B.<br>Column A Column B<br><br>(1) remarkable {1:dropdown:a. very large, b. help, c. feel great admiration, d. action or words that are intended to hurt people, e. noticeable: e. noticeable}<br><br>(2) violence {2:dropdown:a. very large, b. help, c. feel great admiration, d. action or words that are intended to hurt people, e. noticeable: d. action or words that are intended to hurt people}<br><br>(3) contribute {3:dropdown:a. very large, b. help, c. feel great admiration, d. action or words that are intended to hurt people, e. noticeable: b. help}<br><br>(4) enormous {4:dropdown:a. very large, b. help, c. feel great admiration, d. action or words that are intended to hurt people, e. noticeable:a. very large}<br><br>(5) impressed {5:dropdown:a. very large, b. help, c. feel great admiration, d. action or words that are intended to hurt people, e. noticeable: c. feel great admiration}<br><br><br>B. Choose the best answer.<br><br>1. Why do people respect outstanding individuals like Nelson Mandela?<br>People respect outstanding individuals like Nelson Mandela because of  ______ .<br>A. their attention<br>B. their reactions<br>C. their responses<br>D. their words and actions<br>ANSWER: {6:dropdown:A,B,C,D:D}<br><br>2. According to Mandela, how do people respond when you approach them?<br>People respond ______ when we approach them.<br>A. according to our actions<br>B. according to our relations<br>C. on the basis of peace and stability<br>D. on the basis of violence<br>ANSWER: {7:dropdown:A,B,C,D:A}<br><br>3. What do we need to have to be able to contribute to the development of the country?<br>We need to have ______ to be able to contribute to the development of the country.<br>A. challenges<br>B. education<br>C. peace and stability<br>D. violence<br>ANSWER: {8:dropdown:A,B,C,D:C}<br><br>4. Why are many people who contribute towards the development of the society admired?<br>Many people who contribute towards the development of the society are admired due to  ______ .<br>A. their education<br>B. their fame<br>C. their impression<br>D. their service to society<br>ANSWER: {9:dropdown:A,B,C,D:D}<br><br>5. According to the passage, what kind of people are regarded as heroes or heroines?<br>According to the passage, ______ are regarded as heroes or heroines.<br>A. people who are famous<br>B. people who are impressed<br>C. people who contribute to the development of the country<br>D. people who we never forget<br>ANSWER: {10:dropdown:A,B,C,D:C}",
                    marks: 15
                }
            ],
            count: 1
        },
        sectionD: {
            questions: [
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The lake we __________ go sailing on in summer has now dried up.", "choices": [{"text": "are used to"}, {"text": "used to"}, {"text": "get used to"}, {"text": "be used to"}], "answer": ["used to"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The symptoms of the disease include __________", "choices": [{"text": "fever, headache, and fatigue"}, {"text": "having fever, headache, and fatigue"}, {"text": "fever, headache, and feeling fatigued"}, {"text": "feel sick and feverish, headache, and fatigue"}], "answer": ["fever, headache, and fatigue"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The scientists claimed that the vaccine was safe; ______, they were still hesitant to use it on humans.", "choices": [{"text": "therefore"}, {"text": "however"}, {"text": "for example"}, {"text": "as a result"}], "answer": ["however"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "______ by the thunder, my little puppy hid behind the couch.", "choices": [{"text": "Frightening"}, {"text": "Having fright"}, {"text": "Frightened"}, {"text": "Being frightening"}], "answer": ["Frightened"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "He drove __________ the entire road, ignoring all the traffic rules.", "choices": [{"text": "as if he owns"}, {"text": "as if he owned"}, {"text": "as he owned"}, {"text": "if he owned"}], "answer": ["as if he owned"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "She ______ more if she were younger.", "choices": [{"text": "travels"}, {"text": "is travelling"}, {"text": "will travel"}, {"text": "would travel"}], "answer": ["would travel"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "She has been dieting strictly since June and so far, she ______ six kilos.", "choices": [{"text": "is losing"}, {"text": "has lost"}, {"text": "has been losing"}, {"text": "has been lost"}], "answer": ["has lost"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The function of gerund in the underlined phrase is _____. <br>The secret to success is <u>persevering through challenges</u>.", "choices": [{"text": "the subject of sentence"}, {"text": "the object of a verb"}, {"text": "the object of preposition"}, {"text": "the subject complement"}], "answer": ["the subject complement"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "They were having dinner when somebody ______ on the door.", "choices": [{"text": "knocked"}, {"text": "was knocking"}, {"text": "had knocked"}, {"text": "had been knocking"}], "answer": ["knocked"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "They treated her ______ the queen of the event, showering her with compliments.", "choices": [{"text": "as if she is"}, {"text": "as if she were"}, {"text": "as if they were"}, {"text": "as if they are"}], "answer": ["as if she were"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "Recently, Yuya Khin ______ Japanese language course for 3 months.", "choices": [{"text": "is doing"}, {"text": "has done"}, {"text": "has been doing"}, {"text": "has been done"}], "answer": ["has been doing"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The experiment was conducted and the results ______ by the students.", "choices": [{"text": "recorded"}, {"text": "was recorded"}, {"text": "were recording"}, {"text": "were recorded"}], "answer": ["were recorded"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The building collapsed, ______ four people.", "choices": [{"text": "injuring"}, {"text": "injured"}, {"text": "being injured"}, {"text": "having injured"}], "answer": ["injuring"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "Guests ______ a buffet dinner at the hotel tomorrow.", "choices": [{"text": "will offer"}, {"text": "offer"}, {"text": "will be offered"}, {"text": "are offering"}], "answer": ["will be offered"], "multiple": false, "marks": 1},
                {"type": "MCQ", "instruction": "Choose the best answer.", "question": "The underlined phrase in the following sentence modifies______. <br>It is lovely to see my little cat <u>napping in the sun</u>.", "choices": [{"text": "lovely"}, {"text": "my little cat"}, {"text": "see"}, {"text": "the sun"}], "answer": ["my little cat"], "multiple": false, "marks": 1}
            ],
            count: 15
        },
        sectionE: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "Choose the best expression to complete each conversation.",
                    question: "a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!<br><br>b. Do you know if there are any ATMs nearby?<br><br>c. What motivated you to start this fashion store?<br><br>d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them, the better you’ll remember.<br><br>e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.<br><br><br>Interviewer: {1:dropdown: a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!, b. Do you know if there are any ATMs nearby?, c. What motivated you to start this fashion store?, d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them&comma; the better you’ll remember., e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.: c. What motivated you to start this fashion store?} <br><br>Mary: When I see girls my age, I notice that they really care about fashion and style. And I got the idea to start this business.<br><br>Ko Ko: What do you think is the most important thing we can do as individuals to reduce our environmental impact?<br><br>Htet Myet: {2:dropdown: a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!, b. Do you know if there are any ATMs nearby?, c. What motivated you to start this fashion store?, d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them&comma; the better you’ll remember., e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.: a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!}<br><br> Mo Mo: {3:dropdown: a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!, b. Do you know if there are any ATMs nearby?, c. What motivated you to start this fashion store?, d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them&comma; the better you’ll remember., e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.: b. Do you know if there are any ATMs nearby?} <br><br>Phyo Lay: Actually, there’s one just a block down the street. Go straight and turn left at the traffic lights. It’s in front of the Academy Bank.<br><br> Lin Myat: What do you think of the current pop music? I mean, do you like them?<br><br> Thu Thu: {4:dropdown: a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!, b. Do you know if there are any ATMs nearby?, c. What motivated you to start this fashion store?, d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them&comma; the better you’ll remember., e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.: e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.} <br><br>Yan Paing: I find it difficult to remember the new words I’ve learned lately. Do you have any tips for me?<br><br> Kay Kay: {4:dropdown: a. I think it’s just small acts like turning off lights and using public transportation. Every little bit counts!, b. Do you know if there are any ATMs nearby?, c. What motivated you to start this fashion store?, d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them&comma; the better you’ll remember., e. I think I like it. But I’d prefer jazz. Jazz is more relaxing.: d. Why don’t you use flashcards? You could put them up on your wall so you see them often. The more you look at them, the better you’ll remember.}",
                    marks: 10
                }
            ],
            count: 1
        },
        sectionF: {
            questions: [
                {
                    type: "Cloze",
                    audio: "audio/G12_English_BECA_Sample_Question_Listening_Audio_File.mp3",
                    instruction: "Listen to the recording and decide whether the following statements are True or False.",
                    question: "(1) Sandi is confident about the History exam. {1:dropdown: TRUE, FALSE: FALSE} <br><br>(2) Min Min offers to help Sandi understand the history content.{2:dropdown: TRUE, FALSE: TRUE} <br><br>(3) In learning about the Bagan Empire, one should simplify the key points by asking oneself Wh-questions: who, what, when, where, and why.{3:dropdown: TRUE, FALSE: TRUE} <br><br>(4) Min Min suggests that using visual aids like maps and timelines does not work for studying history.{4:dropdown: TRUE, FALSE: FALSE} <br><br>(5) In learning history, we need to relate the past and the present.{5:dropdown: TRUE, FALSE: TRUE}<br>",
                    marks: 10
                }
            ],
            count: 1
        },
        sectionG: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "Read the letter and fill in the blanks (1-5) with the correct clauses (a-e)", 
                    question: "a. I hope my absence won’t cause any inconvenience to you<br><br>b. Why don’t you come and join us?<br><br>c. It’s so kind of you to invite me to your birthday party<br><br>d. I’m sure you will like it<br><br>e. I’ll be out of town on that day<br><br><br><div style=\"text-align: right;\">February 25th, 2025</div><br>Dear Lwin Mar,<br>How are you and all at home? I’m fine. (1){1:dropdown: a. I hope my absence won’t cause any inconvenience to you, b. Why don’t you come and join us?, c. It’s so kind of you to invite me to your birthday party, d. I’m sure you will like it, e. I’ll be out of town on that day: c. It’s so kind of you to invite me to your birthday party} on coming Friday. I’d love to come, but (2){2:dropdown: a. I hope my absence won’t cause any inconvenience to you, b. Why don’t you come and join us?, c. It’s so kind of you to invite me to your birthday party, d. I’m sure you will like it, e. I’ll be out of town on that day: e. I’ll be out of town on that day}. I have to go to the airport to pick up my cousins who are coming from Yangon and send them to Pyin-Oo-Lwin. I think I’ll only be back in Mandalay after the next three days. Please give my best regards to all my friends and (3){3:dropdown: a. I hope my absence won’t cause any inconvenience to you, b. Why don’t you come and join us?, c. It’s so kind of you to invite me to your birthday party, d. I’m sure you will like it, e. I’ll be out of town on that day: a. I hope my absence won’t cause any inconvenience to you}. Let me wish you a very happy birthday and many happy returns of the day! I bought a birthday present – a lovely Adidas hoodie. It’s sky blue which is your favourite colour. I’ll send it to you through Khin Lay. (4){4:dropdown: a. I hope my absence won’t cause any inconvenience to you, b. Why don’t you come and join us?, c. It’s so kind of you to invite me to your birthday party, d. I’m sure you will like it, e. I’ll be out of town on that day: d. I’m sure you will like it}! Next week, when my cousins go back to Yangon, I’ll be free and I’m going to throw a get-together party. (5){5:dropdown: a. I hope my absence won’t cause any inconvenience to you, b. Why don’t you come and join us?, c. It’s so kind of you to invite me to your birthday party, d. I’m sure you will like it, e. I’ll be out of town on that day: b. Why don’t you come and join us?} I’ll invite all our classmates, too. Let’s enjoy and have fun together. Looking forward to seeing you soon!<br><br>Yours,",
                    marks: 10
                }
            ],
            count: 1
        },
        sectionH: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "Read the paragraphs (A-D) of an essay.", 
                    question: "A. Choose the best answer to complete each blank (1-5).<br>a. One reason for this<br>b. In contrast<br>c. Additionally<br>d. Personally<br>e. Honestly<br><br>A.<br>(1) {1:dropdown: a. One reason for this, b. In contrast, c. Additionally, d. Personally, e. Honestly: d. Personally}, I enjoy cooking and often spend my free time preparing meals at home. While some people might prefer dining out, I find that cooking and eating at home brings me joy and a sense of adventure. <br><br>B. <br>While some people enjoy dining out, personally prefer eating at home. (2) {2:dropdown: a. One reason for this, b. In contrast, c. Additionally, d. Personally, e. Honestly: a. One reason for this} is my passion for food; r love exploring different recipes and cooking techniques. Preparing my own meals is also a relaxing way to unwind after a long day of school and studying.<br><br>C.<br>It can be tough to figure out how healthy restaurant meals are, sspecially since menus often lack nutritional information. Many times, the food we order has more calories and sugar than we realize, which can lead to unhealthy choices. (3) {3:dropdown: a. One reason for this, b. In contrast, c. Additionally, d. Personally, e. Honestly: b. In contrast} , when we cook at home, we have full control over the ingredients and nutrients in our meals, making it easier to eat healthily. <br><br>D.<br>(4) {4:dropdown: a. One reason for this, b. In contrast, c. Additionally, d. Personally, e. Honestly: c. Additionally} , eating out can be time- consuming and costly. Going to a restaurant requires travel time and effort, plus there's often a wait for our food. Restaurant prices are usually high. (5) {5:dropdown: a. One reason for this, b. In contrast, c. Additionally, d. Personally, e. Honestly: e. Honestly} I can make similar meals at home for much less. So, for me, dining out feels like a waste of time, energy, and money.<br><br><br>B. The given paragraphs (A-D) are not in the right order. <br>Choose the best order to form the paragraphs into a logical essay.<br>A. B-D-C-A<br>B. D-A-B-C<br>C. C-B-A-D<br>D. A-D-C-B<br><br>ANSWER: {6:dropdown: A. B-D-C-A, B. D-A-B-C, C. C-B-A-D, D. A-D-C-B: A. B-D-C-A} <br><br>C. Choose the best title for the above essay.<br>A. Cooking is spending one’s time beneficially<br>B. The benefits of eating nutritious food<br>C. The benefits of preparing meals at home<br>D. Why people eat at restaurants<br><br>ANSWER: {7:dropdown: A. Cooking is spending one’s time beneficially, B. The benefits of eating nutritious food, C. The benefits of preparing meals at home, D. Why people eat at restaurants: C. The benefits of preparing meals at home} <br><br>D. Choose the best answer.<br>The writer of the essay is  ______ .<br>A. explaining why he prefers eating at home<br>B. explaining how he spends his quality time<br>C. giving the information about nutritious foods<br>D. talking about the foods available at restaurants<br><br>ANSWER: {8:dropdown: A. explaining why he prefers eating at home, B. explaining how he spends his quality time, C. giving the information about nutritious foods, D. talking about the foods available at restaurants: A. explaining why he prefers eating at home}",
                    marks: 15
                }
            ],
            count: 1
        }
    },
    Mathematics: {
        sectionA: {
            questions: [
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The value of $ i^{30} + i^{32} = $", "choices": [
                        { "text": "0" }, 
                        { "text": "i" }, 
                        { "text": "-i" }, 
                        { "text": "1" }], 
                        "answer": ["0"],  "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The conjugate of $ (-2 - i)^2 $  is", 
                    "choices": [
                        { "text": "3 - 4i" }, 
                        { "text": "3 + 4i" }, 
                        { "text": "5 - 4i" }, 
                        { "text": "5 + 4i" }], 
                    "answer": ["3 - 4i"], "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If $ z= 4-3i$,then $ z \\cdot \\overline {z} = $", 
                    "choices": [{ "text": "9" }, { "text": "16" }, { "text": "25" }, { "text": "13" }], 
                    "answer": ["25"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The conjugate of a complex number $ \\frac{1}{i - 3} $ is", 
                    "choices": [
                        { "text": "$ -\\frac{3}{10} + \\frac{1}{10}i $" }, 
                        { "text": "$ - \\frac{3}{10} - \\frac{1}{10}i $" }, 
                        { "text": "$- \\frac{1}{10} + \\frac{3}{10}i $" }, 
                        { "text": "$ -\\frac{1}{10} + \\frac{3}{10}i $" }], 
                    "answer": ["$ -\\frac{3}{10} + \\frac{1}{10}i $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following is a statement?", 
                    "choices": [
                        { "text": "Girls are intelligent than boys" }, 
                        { "text": "$ x + 1 $ is a factor of $ x^2 - 3x + 2 $" }, 
                        { "text": "$ 2x + 5 = 10 $" }, 
                        { "text": "The sum of $ a $ and $ b $ is greater than 0" }], 
                    "answer": ["$ x + 1 $ is a factor of $ x^2 - 3x + 2 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In the principle of mathematical induction, the assumption that the statement is true for $ n = k $ is called", 
                    "choices": [
                        { "text": "the inductive step" }, 
                        { "text": "the initial step" }, 
                        { "text": "the inductive hypothesis" }, 
                        { "text": "the deductive step" }], 
                    "answer": ["the inductive hypothesis"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Let $ P(n) = 1 + 3 + 5 + \\ldots + (2n - 1) = 3 + n^2 $.Then, which of the following is true?", 
                    "choices": [
                        { "text": "If $ P(k) $ is true, then $ P(k + 1) $ is true" }, 
                        { "text": "$ P(k) $ is true but $ P(k + 1) $ is false" }, 
                        { "text": "$ P(1) $ is true" }, 
                        { "text": "Principle of mathematical induction can be used to prove that $ P(n) $ is true" }], 
                    "answer": ["If $ P(k) $ is true, then $ P(k + 1) $ is true"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If $ n $ is a positive integer, then $ n^3 + 2n $ is divisible by", 
                    "choices": [
                        { "text": "2" }, 
                        { "text": "6" }, 
                        { "text": "15" }, 
                        { "text": "3" }], 
                    "answer": ["3"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$10^{n - 2} > 81 n$ for the natural numbers", 
                    "choices": [
                        { "text": "$n > 5$" }, 
                        { "text": "$ n \\geq 5 $" }, 
                        { "text": "$ n < 5$" }, 
                        { "text": "$ n > 8 $" }], 
                    "answer": ["$ n \\geq 5 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The coordinates of the points on the plane, which contains the point $ (a, b, c) $ and is parallel to $ xy $-plane, are of the form", 
                    "choices": [
                        { "text": "$ (x, y, a) $" }, 
                        { "text": "$ (x, y, b) $" }, 
                        { "text": "$ (x, y, c) $" }, 
                        { "text": "$ (a, b, z) $" }], 
                    "answer": ["$ (x, y, c) $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The coordinates of the points on the line, which is perpendicular to the $ zx $-plane and passes through the point $ (a, b, c) $, are of the form", 
                    "choices": [
                        { "text": "$ (a, b, z) $" }, 
                        { "text": "$ (x, y, c) $" }, 
                        { "text": "$ (x, b, c) $" }, 
                        { "text": "$ (a, y, c) $" }], 
                    "answer": ["$ (a, y, c) $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The distance between the point $ (2, 3, 6) $ from the origin is", 
                    "choices": [
                        { "text": "2 units" }, 
                        { "text": "3 units" }, 
                        { "text": "5 units" }, 
                        { "text": "7 units" }], 
                    "answer": ["7 units"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In a sphere, if the center $ (0, 0, 0) $ and radius 3 units, then the point $ P(2, 1, 2) $ lies", 
                    "choices": [
                        { "text": "on a sphere" }, 
                        { "text": "inside a sphere" }, 
                        { "text": "outside a sphere" }, 
                        { "text": "none of these" }], 
                    "answer": ["on a sphere"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The directed values of two lines are $ \\langle \\sqrt{3} - 1, -\\sqrt{3} - 1, 4 \\rangle $ and $ \\langle  1, 1, 2 \\rangle $ respectively. The acute angle between these lines is ", 
                    "choices": [
                        { "text": "$\\frac{\\pi}{2}$" }, 
                        { "text": "$\\frac{\\pi}{3}$" }, 
                        { "text": "$\\frac{\\pi}{4}$" }, 
                        { "text": "$\\frac{\\pi}{6}$" }], 
                    "answer": ["$\\frac{\\pi}{3}$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If $ \\vec {p}= \\left( \\begin{matrix} 1\\\\ -1\\\\ 4\\end{matrix} \\right) $  and $ \\vec{q} = \\left( \\begin{matrix} -2\\\\ 0\\\\ 2\\end{matrix} \\right) $, then $ \\frac{1}{2} \\vec{q} - \\vec{p} $ is ", 
                    "choices": [
                        { "text": "$ \\left( \\begin{matrix} -1\\\\ -1\\\\ -6\\end{matrix} \\right) $" }, 
                        { "text": "$ \\left( \\begin{matrix} -3\\\\ -1\\\\ 2\\end{matrix} \\right) $" }, 
                        { "text": "$ \\left( \\begin{matrix} 2\\\\ -1\\\\ 3\\end{matrix} \\right) $" }, 
                        { "text": "$ \\left( \\begin{matrix} -2\\\\ 1\\\\ -3\\end{matrix} \\right) $" }], 
                    "answer": ["$ \\left( \\begin{matrix} -2\\\\ 1\\\\ -3\\end{matrix} \\right) $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The unit vector in the same direction of $ \\vec {a}= \\left( \\begin{matrix} 2 \\\\ -2\\\\ 1 \\end{matrix} \\right) $  is ", 
                    "choices": [
                        { "text": "$ \\left( \\begin{matrix} -\\frac{2}{3} \\\\ \\frac{2}{3} \\\\ -\\frac{1}{3} \\end{matrix} \\right) $" }, 
                        { "text": "$\\left( \\begin{matrix} \\frac{2}{3} \\\\ - \\frac{2}{3} \\\\ \\frac{1}{3} \\end{matrix} \\right) $" }, 
                        { "text": "$ \\left( \\begin{matrix} \\frac{1}{3} \\\\ - \\frac{2}{3} \\\\ \\frac{2}{3} \\end{matrix} \\right) $" }, 
                        { "text": "$ \\left( \\begin{matrix} \\frac{2}{3} \\\\ - \\frac{2}{3} \\\\ -\\frac{1}{3} \\end{matrix} \\right) $" }], 
                    "answer": ["$\\left( \\begin{matrix} \\frac{2}{3} \\\\ - \\frac{2}{3} \\\\ \\frac{1}{3} \\end{matrix} \\right) $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The area of triangle with sides $ \\vec {a}$ and $ \\vec{b} $ is equal to ", 
                    "choices": [
                        { "text": "$ \\vec{a} \\times \\vec{b} $" }, 
                        { "text": "$ \\left| \\vec{a} \\times \\vec{b} \\right| $" }, 
                        { "text": "$ \\frac{1}{2} \\left| \\vec{a} \\times \\vec{b} \\right| $" }, 
                        { "text": "$ \\frac{\\left| \\vec{a} \\times \\vec{b} \\right|}{\\left| \\vec{a} \\right| \\left| \\vec{b} \\right|} $" }], 
                    "answer": ["$ \\frac{1}{2} \\left| \\vec{a} \\times \\vec{b} \\right| $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If $\\vec{m} = 2 \\widehat i - \\widehat j -\\widehat k $  and $ \\vec{n} = - \\widehat i + 3\\widehat j + 2 \\widehat k $, then $ \\vec{m} \\cdot \\vec{n} $ is", 
                    "choices": [
                        { "text": "-7" }, 
                        { "text": "7" }, 
                        { "text": "$ \\left( \\begin{matrix} 1 \\\\ -3 \\\\ 5 \\end{matrix} \\right) $" }, 
                        { "text": "$ \\left( \\begin{matrix} -1\\\\ 3\\\\-5 \\end{matrix} \\right) $" }], 
                    "answer": ["-7"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If 3-digit numbers are formed, the number of ways without any repetition is", 
                    "choices": [
                        { "text": "810" }, 
                        { "text": "720" }, 
                        { "text": "648" }, 
                        { "text": "684" }], 
                    "answer": ["648"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The number of ways, 6 children are arranged in a line such that two particular children of them are always together, is", 
                    "choices": [
                        { "text": "72" }, 
                        { "text": "120" }, 
                        { "text": "210" }, 
                        { "text": "240" }], 
                    "answer": ["240"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The number of diagonals of a 10-sided polygon is", 
                    "choices": [
                        { "text": "35" }, 
                        { "text": "55" }, 
                        { "text": "65" }, 
                        { "text": "75" }], 
                    "answer": ["35"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The number of ways to choose 3 red ball and 2 white ball from 7 red ball and 5 white ball is", 
                    "choices": [
                        { "text": "45" }, 
                        { "text": "350" }, 
                        { "text": "4200" }, 
                        { "text": "230" }], 
                    "answer": ["350"], "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The parabola equation of the conic for which $ F(a, 0) $, directrix is $ x + a = 0$  is", 
                    "choices": [
                        { "text": "$ y^2 = 4ax $" }, 
                        { "text": "$ y^2 = -4ax $" }, 
                        { "text": "$ x^2 = 4ay $" }, 
                        { "text": "$ x^2 = -4ay $" }], 
                    "answer": ["$ y^2 = 4ax $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The major axis, coordinates of the vertex and the focus of the parabola $ x^2 = - 9y $ are as follows:", 
                    "choices": [
                        { "text": "the major axis is $ x $-axis, the vertex is $ V(0, 0) $, and the focus is $ F(2, 0) $" }, 
                        { "text": "the major axis is $ x $-axis, the vertex is $ V(0, 0) $, and the focus is $ F(-1, 0) $" }, 
                        { "text": "the major axis is $ y $-axis, the vertex is $ V(0, 0) $, and the focus is $ F(0, 4) $" }, 
                        { "text": "the major axis is y-axis, the vertex is V (01 0), and the focus is F (0, $-\\frac{9}{4}$ ) ." }], 
                    "answer": ["the major axis is y-axis, the vertex is V (01 0), and the focus is F (0, $-\\frac{9}{4}$ ) ."], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "What is the standard equation of a parabola that opens to the right?", 
                    "choices": [
                        { "text": "$y^2 = - 4px, p > 0$" }, 
                        { "text": "$x^2 = 4py, p>0$" }, 
                        { "text": "$y^2 = 4px, p > 0 $" }, 
                        { "text": "$x^2 = -4py, p>0$" }], 
                    "answer": ["$y^2 = 4px, p > 0 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In the equation $ x^2 = -12y $, the end points of the latus rectum are", 
                    "choices": [
                        { "text": "$ (-6, -3) $ and $ (-6, 3) $" }, 
                        { "text": "$ (6, -3) $ and $ (6, 3) $" }, 
                        { "text": "$ (-6, -3) $ and $ (6, -3) $" }, 
                        { "text": "$ (6, 3) $ and $ (-6, -3) $" }], 
                    "answer": ["$ (-6, -3) $ and $ (6, -3) $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In the equation $ x^2 + y^2 - 6x + 2y + 1 = 0 $, the radius is", 
                    "choices": [
                        { "text": "0" }, 
                        { "text": "1" }, 
                        { "text": "2" }, 
                        { "text": "3" }], 
                    "answer": ["3"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "For the graph of $ y = 3 \\sin 2x + 4 $, the mid line is", 
                    "choices": [
                        { "text": "$ y = 1 $" }, 
                        { "text": "$ y = 2 $" }, 
                        { "text": "$ y = 3 $" }, 
                        { "text": "$ y = 4 $" }], 
                    "answer": ["$ y = 4 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If $ f(x) = f(x + p) $ where $ p $ is a positive real number, $ p $ is called", 
                    "choices": [
                        { "text": "even function" }, 
                        { "text": "odd function" }, 
                        { "text": "amplitude" }, 
                        { "text": "period" }], 
                    "answer": ["period"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "From the graph of $ y = \\cot x $, asymptotes are ", 
                    "choices": [
                        { "text": "$ x = \\pm \\frac{\\pi}{2}, \\pm \\frac{3\\pi}{2}$" }, 
                        { "text": "$ x = \\pm \\frac{\\pi}{2}, \\pm \\frac{3\\pi}{2}, ...$" }, 
                        { "text": "$ x = 0, \\pm \\pi, \\pm 2\\pi, ... $" }, 
                        { "text": "$ x = 0, \\pm \\pi, \\pm 2\\pi$" }], 
                    "answer": ["$ x = 0, \\pm \\pi, \\pm 2\\pi, ... $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$ \\lim_{x \\to 0} \\frac{\\sin x}{x} = $ ", 
                    "choices": [
                        { "text": "0" }, 
                        { "text": "1" }, 
                        { "text": "-1" }, 
                        { "text": "2" }], 
                    "answer": ["1"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$ \\frac{d}{dx} \\left( \\cos^2 x - \\sin^2 x \\right) = $", 
                    "choices": [
                        { "text": "$ \\cos^2 x + \\cos^2 x$" }, 
                        { "text": "$-2\\sin 2x$" }, 
                        { "text": "$2\\sin 2x$" }, 
                        { "text": "$-2\\sin x \\cos x$" }], 
                    "answer": ["$-2\\sin 2x$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The domain of the function $ y = \\log_3 |x + 1| + 3 $ is ", 
                    "choices": [
                        { "text": "$ \\mathbb{R} $" }, 
                        { "text": "$ \\lbrace{ x | x \\in R, x > 0}\\rbrace $" }, 
                        { "text": "$ \\lbrace{ x | x \\in R, x > -1}\\rbrace $" }, 
                        { "text": "$ \\lbrace{ x | x \\in R, x \\neq -1}\\rbrace $" }], 
                    "answer": ["$ \\lbrace{ x | x \\in R, x \\neq -1}\\rbrace $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The asymptote of the graph of the function $ y = \\log_{\\frac{1}{2}} (x - 3) + 1 $ is ", 
                    "choices": [
                        { "text": "$ x = -3 $" }, 
                        { "text": "$ x = 3 $" }, 
                        { "text": "$ x = -1 $" }, 
                        { "text": "$ x = 1 $" }], 
                    "answer": ["$ x = 3 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The range of the logarithmic function $ y = \\log_2 (x + 1) - 2 $ is ", 
                    "choices": [
                        { "text": "$ \\mathbb{R} $" }, 
                        { "text": "$ \\lbrace{ x|x \\in R, x > 1 }\\rbrace $" }, 
                        { "text": "$ \\lbrace{ x|x \\in R, x > -1 }\\rbrace $" }, 
                        { "text": "$\\lbrace{ x|x \\in R, x > 2 }\\rbrace $" }], 
                    "answer": ["$ \\mathbb{R} $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The function $ y = b^x $ is an exponential growth function if the value of $ b $ is", 
                    "choices": [
                        { "text": "$ b > 0 $" }, 
                        { "text": "$ b > 1 $" }, 
                        { "text": "$ 0 < b < 1 $" }, 
                        { "text": "$ b \\neq 1 $" }], 
                    "answer": ["$ b > 1 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The range of the exponential function $y = -2^{-(x+1)}+2$ is", 
                    "choices": [
                        { "text": "$ \\mathbb{R} $" }, 
                        { "text": "$ \\lbrace{ y|y \\in R, y >2 }\\rbrace $" }, 
                        { "text": "$ \\lbrace{ y|y \\in R, y >-1 }\\rbrace $" }, 
                        { "text": "$ \\lbrace{ y|y \\in R, y < 2 }\\rbrace $" }], 
                    "answer": ["$ \\lbrace{ y|y \\in R, y < 2 }\\rbrace $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The equation of the normal to the curve $ y = \\ln x $ at $ (1, 0) $ is", 
                    "choices": [
                        { "text": "$ x = 0 $" }, 
                        { "text": "$ y = 0 $" }, 
                        { "text": "$ x - y = 1 $" }, 
                        { "text": "$ x + y = 1 $" }], 
                    "answer": ["$ x + y = 1 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If $ y = x^4 - 10 $ and if $ x $ changes from 2 to 1.99, the approximate change in $ y $ is", 
                    "choices": [
                        { "text": "-0.32" }, 
                        { "text": "0.032" }, 
                        { "text": "-0.032" }, 
                        { "text": "0.32" }], 
                    "answer": ["-0.32"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The function $ f(x) = - \\frac{x}{2} + \\sin x $ defined on $ (-\\frac{ \\pi }{3}, \\frac{ \\pi }{3}) $ is", 
                    "choices": [
                        { "text": "decreasing" }, 
                        { "text": "increasing" }, 
                        { "text": "constant" }, 
                        { "text": "none of these" }], 
                    "answer": ["increasing"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The function $ f(x) = x^{\\frac{2}{3}} $ on [-2, 3] has a critical point at", 
                    "choices": [
                        { "text": "$ x = 3 $" }, 
                        { "text": "$ x = 2 $" }, 
                        { "text": "$ x = 1 $" }, 
                        { "text": "$ x = 0 $" }], 
                    "answer": ["$ x = 0 $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The antiderivative of $3x^5$ is", 
                    "choices": [
                        { "text": "$15x^4$" }, 
                        { "text": "$3\\frac{x^4}{4}$" }, 
                        { "text": "$\\frac{x^6}{2}$" }, 
                        { "text": "$3x^6$" }], 
                    "answer": ["$\\frac{x^6}{2}$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$ \\int \\sin x \\, dx = $", 
                    "choices": [
                        { "text": "$ \\sin x + C $" }, 
                        { "text": "$ -\\sin x + C $" }, 
                        { "text": "$ \\cos x + C $" }, 
                        { "text": "$ -\\cos x + C $" }], 
                    "answer": ["$ -\\cos x + C $"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$ \\int y^2 \\; dy = $", 
                    "choices": [
                        { "text": "$ 2y + C $" }, 
                        { "text": "$ 2y $" }, 
                        { "text": "$\\frac{y^3}{3}+C$" }, 
                        { "text": "$\\frac{y^3}{3}$" }], 
                    "answer": ["$\\frac{y^3}{3}+C$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$\\int \\frac{\\sin x}{\\cos x} \\;dx \\; = $", 
                    "choices": [
                        { "text": "$-\\ln |\\cos x| + C$" }, 
                        { "text": "$\\tan x +C$" }, 
                        { "text": "$\\ln \\cos x + C$" }, 
                        { "text": "$- \\ln |\\sin x| + C$" }], 
                    "answer": ["$-\\ln |\\cos x| + C$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "$ \\int u \\, dv = $", 
                    "choices": [
                        { "text": "$\\frac{u^2}{2} + C$" }, 
                        { "text": "$\\frac{u^2v}{2} + C$" }, 
                        { "text": "$u\\, v - \\int v \\; du$" }, 
                        { "text": "$u\\, v - \\int u \\; dv$" }], 
                    "answer": ["$u\\, v - \\int v \\; du$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The solution of $ \\int_0^1 3x^2 \\, dx $ is", 
                    "choices": [
                        { "text": "3" }, 
                        { "text": "1" }, 
                        { "text": "4" }, 
                        { "text": "2" }], 
                    "answer": ["1"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "An object moves with velocity $ v(t) = 6t + 8 $. The distance travelled from $ t = 0 $ to $ t = 2 $ is", 
                    "choices": [
                        { "text": "21" }, 
                        { "text": "25" }, 
                        { "text": "27" }, 
                        { "text": "28" }], 
                    "answer": ["28"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The area enclosed between the graph of $ f(x) = 2x + 1 $ and the $ x $-axis over $ [0, 3] $ is", 
                    "choices": [
                        { "text": "12" }, 
                        { "text": "13" }, 
                        { "text": "11" }, 
                        { "text": "14" }], 
                    "answer": ["12"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The volume of the solid obtained by rotating the curve $y = \\sqrt {x} $ from x = 0 to x = 1 about the x-axis is", 
                    "choices": [
                        { "text": "$\\frac{5\\pi}{2}$" }, 
                        { "text": "$\\frac{\\pi}{2}$" }, 
                        { "text": "$\\frac{7\\pi}{2}$" }, 
                        { "text": "$\\frac{8\\pi}{2}$" }], 
                    "answer": ["$\\frac{\\pi}{2}$"], 
                    "multiple": false, "marks": 1 },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If z = − 1 − 3i, then the absolute value of z is", 
                    "choices": [
                        { "text": "3" }, 
                        { "text": "4" }, 
                        { "text": "2" }, 
                        { "text": "1" }], 
                    "answer": ["2"], 
                    "multiple": false, "marks": 1 
                },
                { "type": "MCQ", 
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The value of $𝑖^{2024} + 𝑖^{2025} =$", 
                    "choices": [
                        {"text": "0" }, 
                        { "text": "1+i" }, 
                        { "text": "-i" }, 
                        { "text": "1" }], 
                    "answer": ["1+i"], 
                    "multiple": false, "marks": 1 
                },
            ],
            count: 50
        },
        sectionB: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Express $ \\frac{(1-3i)(4+i)}{(4-i)(1+3i)}$ in the form of $x+yi$. <br> <strong>Solution</strong><br>$(1-3 i)(4+i)=$ <br>A. $11+7i$ <br>B. $7-11i$ <br>C. $7+11i$ <br>D. $11-7i$ <br><strong>Answer:</strong> {1:dropdown:A,B,C,D:B} <br><br>$(4-i)(1+3 i)=$ <br>A. $11+7i$<br>B. $7-11i$<br>C. $7+11i$<br>D. $11-7i$<br>Answer: {2:dropdown:A,B,C,D:C} <br><br>Hence, $ \\frac{(1-3 i)(4+i)}{(4-i)(1+3 i)}=$ <br>A. $\\frac{36}{85}+\\frac{77}{85}i$ <br>B. $-\\frac{36}{85}-\\frac{77}{85}i$ <br> C. $\\frac{77}{85}+\\frac{36}{85}i$ <br>D. $-\\frac{77}{85}-\\frac{36}{85}i$ <br>Answer: {3:dropdown:A,B,C,D:B}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Prove by the mathematical induction that $4+8+12+\\ldots+4 n=2 n(n+1)$ for all natural numbers $n$. <br> <strong>Solution</strong><br>Let $P(n)$ denote the statement $4+8+12+\\ldots+4 n=2 n(n+1)$ for all natural numbers $n$. <br>For $n=1$, <br>L.H.S =4, <br>R.H.S =2(1)(1+1)=4 <br>L.H.S = R.H.S <br>P(1) is true. <br>Assume that <br>A. P(k+1) is true <br>B. P(k-1) is true <br>C. P(2) is true <br>D. P(k) is true <br><strong>Answer:</strong> {1:dropdown:A,B,C,D:D}<br><br>i.e., $4+8+12+\\ldots+4 k=2 k(k+1)$ <br>We will show that P(k+1) is true. <br><br>For n =k+1, <br>L.H.S = <br>A. L.H.S =2 k(k+1)+4 <br>B. L.H.S =2 k(k+1)+1 <br>C. L.H.S =2 k(k+1)+4(k+1) <br>D. L.H.S =3 k+5 <br><strong>Answer:</strong> {2:dropdown:A,B,C,D:C}<br><br>R.H.S = <br>A. R.H.S =2(k+1)(k+2) <br>B. R.H.S =(2 k+1)(k+2) <br>C. R.H.S =2(k+1)(k+1) <br>D. R.H.S =(k+2)(k+1) <br><strong>Answer:</strong> {3:dropdown:A,B,C,D:A}<br><br>L.H.S = R.H.S <br>P(k+1) is true. <br>Hence, by the principle of Mathematical induction, the statement P( n ) is true for all natural numbers n.",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Given P(2, 1, 3), Q(6,-5, 4), R(2, 3, 4) and S(-1, 5, 1) determine whether the line PQ and RS are parallel or skew or intersect. <br><strong>Solution</strong><br>The directed values of the lines PQ and RS are $\\langle PQ \\rangle = \\langle l_1, m_1, n_1 \\rangle = \\cdots$ and $\\langle R S\\rangle= \\langle l_2, m_2, n_2\\rangle = \\cdots $. <br>A. (4,-6,-1) and (-3,2,3) <br>B. (4,-6,1) and (-3,2,-3) <br>C. (4,-6,1) and (3,2,-3) <br>D. (-4,6,1) and (-3,2,-3) <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:B} <br><br>Since $-\\frac{4}{3} \\neq-\\frac{6}{2} \\neq-\\frac{1}{3}$, directed values of $\\langle PQ \\rangle $ are not multiple of $\\langle RS \\rangle$. So, two lines are not parallel, <br>If a point (x, y, z) is on the lines PQ and RS, then<br>$ \\begin{array}{ll}x=2+4 s & & x=2-3 t \\\\ y=1-6 s & &y=3+2 t \\\\ z=3+s & & z=4-3 t\\end{array} $<br>for real numbers s and t. Then we have the following system of three equations<br>$ \\begin{aligned}& 2+4 s=2-3 t \\\\ & 1-6 s=3+2 t \\\\ & 3+s=4-3 t\\end{aligned} $<br><br>Solving these equations, we have<br>A. $s=-\\frac{3}{5}$ and $t=\\frac{4}{5}$ <br>B. $s=-\\frac{3}{5}$ and $t=-\\frac{4}{5}$ <br>C. $s=\\frac{3}{5}$ and $t=\\frac{4}{5}$ <br>D. $s=\\frac{3}{5}$ and $t=-\\frac{4}{5}$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:A} <br><br>But these values of s and t do not satisfy the last equation. So, the system of equations has no solution, and hence the given lines do not intersect. <br>Therefore, the given lines are<br>A. parallel <br>B. skew <br>C. intersect <br>D. perpendicular <br><strong><strong>Answer: </strong> </strong> {3:dropdown:A,B,C,D:B}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Zayar Thaw must choose 3 books from a set of 6 English books and 4 Mathematics books. How many different ways can he make his selection if at least two of the chosen books must be Mathematics books?<br><br>Solution<br>The number of ways to include two Mathematics books is<br>A. 72<br>B. 120<br>C. 60<br>D. 36<br><br>Answer: {1:dropdown:A,B,C,D:D} <br><br>The number of ways to include three Mathematics books is<br>A. 4<br>B. 20<br>C. 6<br>D. 12<br><br>Answer: {2:dropdown:A,B,C,D:A} <br><br>Then the number of ways to choose 3 books, including at least two Mathematics books, is<br>A. 40<br>B. 60<br>C. 100<br>D. 82<br><br>Answer: {3:dropdown:A,B,C,D:A}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "How many permutations are there of the letters of the word AUNGSANSUKYI, if they do not end in 2A's? <br><strong>Solution</strong><br>Total number of permutations of the given letters is<br>A. $\\frac{12 !}{2 ! 2 ! 2 !}$ <br>B. $\\frac{10 !}{2 ! 2 ! 2 ! 2 !}$ <br>C. $\\frac{12 !}{2 ! 2 ! 2 ! 2 !}$ <br>D. $\\frac{10 !}{2 ! 2 ! 2 !}$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:C} <br><br>The number of permutations ending in two A's is<br>A. $\\frac{10 !}{2 ! 2 ! 2 !}$ <br>B. $\\frac{11 !}{2 ! 2 ! 2 !}$ <br>C. $\\frac{8 !}{2 ! 2 ! 2 !}$ <br>D. $\\frac{12 !}{2 ! 2 ! 2 !}$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:A} <br><br>The number of permutations not ending in two A's is<br>A. 119296800<br>B. 29484000<br>C. 14515200<br>D. 2984400<br><strong>Answer: </strong> {3:dropdown:A,B,C,D:B}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Determine the equation of the circle through A(2,-1), B(-4,5), C(0,5).<br><strong>Solution</strong><br>General form of the circle equation<br>A. $x^2-y^2+2 g x+2 f y+c=0$ <br>B. $x^2+y^2+2 g x+2 f y+c=0$ <br>C. $x^2+y^2-2 g x+2 f y+c=0$ <br>D. $x^2+y^2-2 g x-2 f y+c=0$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:B} <br><br>Solving this system of equations, we get<br>A. g=2, f=-1, c=15 <br>B. g=2, f=1, c=15 <br>C. g=2, f=-1, c=-15 <br>D. g=-2, f=-1, c=-15 <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:C} <br><br>Thus, the general equation <br>A. $x^2-y^2+4 x-2 y-15=0$ <br>B. $x^2-y^2-4 x-2 y-15=0$ <br>C. $x^2+y^2+4 x-2 y+15=0$ <br>D. $x^2+y^2+4 x-2 y-15=0$ <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:D}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "For the graph of $y= \\cos x$, <br>*The minimum point = <br>A. (0,1) <br>B. (2 $\\pi$, 1) <br>C. ($\\pi$,-1) <br>D. ($\\pi$, 1) <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:C} <br><br>*The period = <br>A. 2 $\\pi$ <br>B. $\\pi$ <br>C. -$\\pi$ <br>D. -2 $\\pi$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:A} <br><br>*The amplitude = <br>A. 1 <br>B. 2<br>C. 3<br>D. 4<br><strong>Answer: </strong> {3:dropdown:A,B,C,D:A}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Find the derivative of $y = x^{\\sin x}$ with respect to x. <br><strong>Solution</strong>$y =x^{\\sin x}$ <br>Taking the natural logarithm on both sides, we get <br>A. $\\ln y=\\sin x \\ln x$ <br>B. $\\ln y=\\sin x+\\ln x$ <br>C. $\\ln y=\\sin x-\\ln x$ <br>D. $\\ln y=\\frac{\\sin x}{\\ln x}$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:A} <br><br>The value of $\\frac{1}{y} \\frac{d y}{d x}$ is <br>A.$\\frac{1}{x} \\cdot \\sin x-\\cos x \\ln x$ <br>B. $\\frac{1}{x} \\cdot \\sin x+\\cos x \\ln x$ <br>C.$\\frac{1}{x} \\cdot \\cos x+\\sin x \\ln x$ <br>D. $\\frac{1}{x} \\cdot \\cos x-\\sin x \\ln x$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:B} <br><br>The value of $\\frac{d y}{d x}$ is <br>A. $x^{\\sin x}\\left(\\frac{1}{x} \\cdot \\sin x+\\cos x \\ln x\\right)$ <br> B. $x^{\\sin x}\\left(\\frac{1}{x} \\cdot \\sin x-\\cos x \\ln x\\right)$ <br>C. $x^{\\sin x}\\left(\\frac{1}{x} \\cdot \\cos x+\\sin x \\ln x\\right)$ <br>D. $x^{\\sin x}\\left(\\frac{1}{x} \\cdot \\cos x-\\sin x \\ln x\\right)$ <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:A}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Find the global maximum and global minimum values of $f(x)=\\frac{e^x}{1+x^2}$ on [0,3]. <br><strong>Solution</strong><br>$f(x)=\\frac{e^x}{1+x^2}$ on [0,3]. <br>$f^{\\prime}(x)$ is<br>A. $\\frac{e^x}{\\left(1+x^2\\right)^2}$ <br>B. $\\frac{e^x(x+1)^2}{\\left(1+x^2\\right)^2}$ <br>C. $\\frac{e^x}{\\left(1+x^2\\right)^2}$ <br>D. $\\frac{e^x(x-1)^2}{\\left(1+x^2\\right)^2}$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:D} <br> <br>The critical point is <br>A. x=0 <br>B. x=1 <br>C. x=2 <br>D. x=3 <br><strong>Answer: </strong>{2:dropdown:A,B,C,D:B} <br><br>For the critical point, <br>$\\mathbf{f}(1)=\\frac{\\mathrm{e}}{2} \\approx 1.359$ <br><br>For the endpoints x=0 and x=3, <br>$\\begin{aligned}& f(0)=\\frac{e^0}{1+0}=\\frac{1}{1}=1 \\\\ & f(3)=\\frac{e^3}{1+9}=\\frac{e^3}{10} \\approx 2.009\\end{aligned}$ <br><br>The global maximum value and the global minimum value are <br>A. $\\frac{e^3}{10}$ and $\\frac{e}{2}$ respectively <br>B. $\\frac{e}{2}$ and 1 respectively <br>C. $\\frac{e^3}{10}$ and 1 respectively <br>D. 1 and 0 respectively <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:C}",
                    marks: 3
                },
                {
                    type: "Cloze",
                    instruction: "There are 3 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Calculate $\\int x e^{x^2} d x$. <br><strong>Solution</strong> <br>Let <br>A. $u =x^2$ <br>B. $u=x$ <br>C. $u=e^{x^2}$ <br>D. $u =x dx$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:A} <br><br>Then <br>A. $du =dx $ <br>B. $du=2x \\;dx$ <br>C. $du = x \\;dx$ <br>D. $du = x^2 \\;dx$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:B} <br><br> $\\int x e^{x^2} \\;dx=$ <br>A.  $\\frac{1}{2} e^u+C$ <br>B.  $\\frac{1}{2} e^{x^2}+C$ <br>C.  $\\frac{1}{2} e^x+C$ <br>D. $\\frac{1}{2} x^2 e^x+C$<br><strong>Answer: </strong> {3:dropdown:A,B,C,D:B}",
                    marks: 3
                }
            ],
            count: 10
        },
        sectionC: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "There are 5 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Find the square roots of $z=-8 i$. <br><br><strong>Solution</strong><br><br>z=-8 i <br>(r, $\\theta)$= <br>A. $\\left(8, \\frac{\\pi}{2}\\right)$ <br>B. $\\left(8,-\\frac{\\pi}{2}\\right)$ <br>C. $\\left(4,-\\frac{\\pi}{2}\\right)$ <br>D. $\\left(4, \\frac{\\pi}{2}\\right)$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:B} <br><br>The trigonometric form of z is<br>A. $z=8\\left(\\cos \\left(-\\frac{\\pi}{2}\\right)+i \\sin \\left(-\\frac{\\pi}{2}\\right)\\right)$ <br>B. $z=8\\left(\\cos \\frac{\\pi}{2}+i \\sin \\frac{\\pi}{2}\\right)$ <br>C. $z=4\\left(\\cos \\frac{\\pi}{2}+i \\sin \\frac{\\pi}{2}\\right)$ <br>D. $z=4\\left(\\cos \\left(-\\frac{\\pi}{2}\\right)+i \\sin \\left(-\\frac{\\pi}{2}\\right)\\right)$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:A} <br><br>For k = 0, 1; <br>$w_k= $ <br>A. $ 2 \\sqrt{2}\\left(\\cos \\frac{-\\pi+2 k \\pi}{4}+i \\sin \\frac{-\\pi+2 k \\pi}{4}\\right)$ <br>B. $2\\left(\\cos \\frac{-\\pi+4 k \\pi}{2}+i \\sin \\frac{-\\pi+4 k \\pi}{2}\\right)$ <br>C. $2 \\sqrt{2}\\left(\\cos \\frac{-\\pi+4 k \\pi}{4}+i \\sin \\frac{-\\pi+4 k \\pi}{4}\\right)$ <br>D. $2\\left(\\cos \\frac{-2 \\pi+6 k \\pi}{4}+i \\sin \\frac{-2 \\pi+6 k \\pi}{4}\\right)$ <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:C} <br><br>When k = 0, <br>$w_0=$ <br>A. $2+2 i$ <br>B. $2-2 i$ <br>C. $-2+2 i$ <br>D. $-2-2 i$ <br><strong>Answer: </strong> {4:dropdown:A,B,C,D:B} <br><br>When k=1, <br>$w_1=$ <br>A. $2+2i$ <br>B. $2-2i$ <br>C. $-2+2i$ <br>D. $-2-2i$ <br><strong>Answer: </strong> {5:dropdown:A,B,C,D:C} ",
                    marks: 5
                },
                {
                    type: "Cloze",
                    instruction: "There are 5 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    image:"images/maths/math_3_13.png",
                    question: "Given points P(1,0,-1), Q(2,4,1) and R(3,5,6); <br>find $\\angle QPR$. <br><br><strong>Solution</strong><br>$\\vec{PQ}=$ <br>A. $\\left(\\begin{array}{l}1 \\\\ 4\\\\2\\end{array}\\right)$ <br>B. $\\left(\\begin{array}{l}3 \\\\1 \\\\ 4\\end{array}\\right)$ <br>C. $\\left(\\begin{array}{l}4 \\\\-1\\\\ 2\\end{array}\\right)$ <br>D. $\\left(\\begin{array}{l}-2 \\\\1\\\\ 3\\end{array}\\right)$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:A} <br><br>$\\vec{PR}=$ <br>A. $\\left(\\begin{array}{l} 7\\\\ 4 \\\\ 5\\end{array}\\right)$ <br>B. $\\left(\\begin{array}{l}3 \\\\ 7\\\\5\\end{array}\\right)$ <br>C. $\\left(\\begin{array}{l}5 \\\\ 1\\\\ 2\\end{array}\\right)$ <br>D. $\\left(\\begin{array}{l}2 \\\\ 5\\\\7\\end{array}\\right)$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:D} <br><br>$PQ \\cdot PR =$ <br>A. 12 <br>B. 53 <br>C. 36 <br>D. 82 <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:C} <br><br>$|\\vec{PQ}||\\vec{PR}|=$ <br>A. $3 \\sqrt{182}$ <br>B. $3 \\sqrt{165}$ <br>C. $3 \\sqrt{183}$ <br>D. $3 \\sqrt{171}$ <br><strong>Answer: </strong> {4:dropdown:A,B,C,D:A} <br><br>$\\theta=$ <br>A. $\\cos ^{-1} \\frac{53}{3 \\sqrt{165}}$ <br>B. $\\cos ^{-1} \\frac{36}{3 \\sqrt{182}}$ <br>C. $\\cos ^{-1} \\frac{12}{3 \\sqrt{171}}$ <br>D. $\\cos ^{-1} \\frac{82}{3 \\sqrt{183}}$ <br><strong>Answer: </strong> {5:dropdown:A,B,C,D:B}",
                    marks: 5
                },
                {
                    type: "Cloze",
                    instruction: "There are 5 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    question: "Find and classify the critical points of $ f(x)=\\cos x $ on $ 0 < x < 2 \\pi $ . Also find the point of inflection. <br><br><strong>Solution</strong> <br>$ f(x)=\\cos x $ on  $ 0<x<2\\pi $ <br> $f^{\\prime}(x)= $ <br>A. $\\sin x$ <br>B. $-\\sin x$ <br>C. $-\\cos x$ <br>D. $\\cos x \\sin x$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:B}  <br> <br>The critical point of f(x) is  <br>A. $\\pi$  <br>B. 0 <br>C. $\\frac{\\pi}{2}$ <br>D. $2 \\pi$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:A}  <br> <br>At $x=\\pi, f(x)$ has <br>A. a local maximum <br>B. an inflection point <br>C. a local minimum <br>D. no extreme value <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:C}  <br> <br>And then $f^{\\prime} (x)$ is  <br>A. $\\cos x$  <br>B. $\\sin x$ <br>C. $-\\sin x$ <br>D. $-\\cos x$ <br><strong>Answer: </strong> {4:dropdown:A,B,C,D:D}  <br> <br>The points of inflection are <br>A. $(0,0)$ and $(2 \\pi, 0)$ <br>B. $\\left(\\frac{\\pi}{2}, 0\\right)$ and $(2 \\pi, 0)$ <br>C. (0,0) and $\\left(\\frac{3 \\pi}{2}, 0\\right)$ <br>D. $\\left(\\frac{\\pi}{2}, 0\\right)$ and $\\left(\\frac{3 \\pi}{2}, 0\\right)$ <br><strong>Answer: </strong> {5:dropdown:A,B,C,D:D}",
                    marks: 5
                },
                {
                    type: "Cloze",
                    instruction: "There are 5 steps in each question. Choose the correct or the most appropriate answer for each step-in question.", 
                    image:"images/maths/math_3_15.png",
                    question: "Find the area bounded by the curve y= cos x between x=0 and x=2 $\\pi$. <br><br><strong>Solution </strong><br>The required area = Area of the region OABO + Area of the region BCDB + Area of the region DEFD. <br><br>Thus, Area of the region OABO = <br>A.  $ \\int_0^{\\frac{\\pi}{2}} \\cos |x| d x$ <br>B.  $ \\left|\\int_0^{\\frac{\\pi}{2}} \\cos x d x\\right|$ <br>C.  $ \\int_0^{\\frac{\\pi}{2}}|\\cos x| d x$ <br>D. $ \\int_0^{\\frac{\\pi}{2}} \\cos x d x$ <br><strong>Answer: </strong> {1:dropdown:A,B,C,D:D} <br><br>Area of the region BCDB = <br>A. $ \\int_{\\frac{\\pi}{2}}^{\\frac{3\\pi}{2}} \\cos x d x$ <br>B. $ \\left|\\int_{\\frac{\\pi}{2}}^{\\frac{3\\pi}{2}} \\cos x d x\\right|$ <br>C. $ \\int_{\\frac{\\pi}{2}}^{\\frac{3\\pi}{2}}|\\cos x| d x$ <br>D. $ \\int_{\\frac{\\pi}{2}}^{\\frac{3\\pi}{2}} \\cos |x| d x$ <br><strong>Answer: </strong> {2:dropdown:A,B,C,D:B} <br><br>Area of the region DEFD =  <br>A. $\\int_{\\frac{3\\pi}{2}}^{\\frac{2\\pi}{2}} \\cos x d x$ <br>B. $\\left|\\int_{\\frac{3\\pi}{2}}^{\\frac{2\\pi}{2}} \\cos x d x\\right|$ <br>C. $\\int_{\\frac{3\\pi}{2}}^{\\frac{2\\pi}{2}}|\\cos x| d x$ <br>D. $\\int_{\\frac{3\\pi}{2}}^{\\frac{2\\pi}{2}} \\cos |x| d x$ <br><strong>Answer: </strong> {3:dropdown:A,B,C,D:A}  <br><br>$\\int_{\\frac{\\pi}{2}}^{\\frac{3\\pi}{2}} \\cos x d x=$ <br>A. -2 <br>B. 1 <br>C. 0 <br>D. $\\frac{1}{2}$ <br><strong>Answer: </strong> {4:dropdown:A,B,C,D:A} <br><br> Hence the required area = <br>A. 2 <br>B. 5 <br> C. 4 <br>D. 3 <br><strong>Answer: </strong> {5:dropdown:A,B,C,D:C}",
                    marks: 5
                }
            ],
            count: 4
        }
    },
    Chemistry: {
        sectionA: {
            questions: [
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How many orbital(s) is/are there in the $ s $ subshell?", "choices": [{ "text": "one" }, { "text": "three" }, { "text": "five" }, { "text": "seven" }], "answer": ["one"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The elements having __________ result in the formation of cations.", "choices": [{ "text": "a high electron affinity" }, { "text": "a low electron affinity" }, { "text": "a high ionization energy" }, { "text": "a low ionization energy" }], "answer": ["a low ionization energy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What type of bond can be formed between an ammonia molecule $ (\\mathrm{NH}_3) $ and aluminium chloride $ (\\mathrm{AlCl}_3) $?", "choices": [{ "text": "electrovalent bond" }, { "text": "covalent bond" }, { "text": "coordinate bond" }, { "text": "metallic bond" }], "answer": ["coordinate bond"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The repulsive interaction of electron pairs increases in the order of -", "choices": [{ "text": "lone pair-lone pair < bond pair-bond pair < bond pair-lone pair" }, { "text": "lone pair-lone pair < bond pair-lone pair < bond pair-bond pair" }, { "text": "bond pair-bond pair < bond pair-lone pair < lone pair-lone pair" }, { "text": "bond pair-bond pair < lone pair-lone pair < bond pair-lone pair" }], "answer": ["bond pair-bond pair < bond pair-lone pair < lone pair-lone pair"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How many electrons are surrounded around the $ \\mathrm{Be} $ in the $ \\mathrm{BeCl}_2 $ molecule?", "choices": [{ "text": "8" }, { "text": "6" }, { "text": "4" }, { "text": "2" }], "answer": ["4"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What type of intermolecular force would be formed when two dipolar molecules interact with each other?", "choices": [{ "text": "London dispersion forces" }, { "text": "Dipole-dipole forces" }, { "text": "Hydrogen bonding" }, { "text": "Ion-dipole forces" }], "answer": ["Dipole-dipole forces"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following molecules exhibits dipole-dipole interaction?", "choices": [{ "text": "$ \\mathrm{H}_2\\mathrm{O} $" }, { "text": "Aqueous $ \\mathrm{NaCl} $ solution" }, { "text": "$ \\mathrm{CO}_2 $" }, { "text": "$ \\mathrm{SO}_2 $" }], "answer": ["$ \\mathrm{SO}_2 $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Two elements $ {}_{13}\\mathrm{A} $ and $ {}_{17}\\mathrm{B} $ are given. (Electronegativities: $ \\mathrm{A} = 1.5 $, $ \\mathrm{B} = 3.0 $) <br>Predict the molecular shape of the unknown compound.", "choices": [{ "text": "linear" }, { "text": "triangular planar" }, { "text": "trigonal pyramidal" }, { "text": "tetrahedral" }], "answer": ["triangular planar"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The energy due to the __________ is called kinetic energy.", "choices": [{ "text": "position" }, { "text": "movement" }, { "text": "heat" }, { "text": "structure" }], "answer": ["movement"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The device that can be transformed from __________ into electrical energy is a solar cell.", "choices": [{ "text": "thermal energy" }, { "text": "chemical energy" }, { "text": "light energy" }, { "text": "mechanical energy" }], "answer": ["light energy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Humans release chemical energy during", "choices": [{ "text": "breathing" }, { "text": "circulating blood" }, { "text": "excretion" }, { "text": "digestion" }], "answer": ["digestion"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "__________ processes need energy to take place.", "choices": [{ "text": "Homogeneous" }, { "text": "Heterogeneous" }, { "text": "Spontaneous" }, { "text": "Non-spontaneous" }], "answer": ["Non-spontaneous"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Energy is __________ in all chemical reactions.", "choices": [{ "text": "released" }, { "text": "absorbed" }, { "text": "released or absorbed" }, { "text": "none of these" }], "answer": ["released or absorbed"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "An __________ process may be used as a cooling system.", "choices": [{ "text": "exothermic" }, { "text": "endothermic" }, { "text": "endothermic or exothermic" }, { "text": "none of these" }], "answer": ["endothermic"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In an endothermic reaction, total energy absorbed for bond breaking is __________ total energy released for bond making.", "choices": [{ "text": "less than" }, { "text": "greater than" }, { "text": "equal to" }, { "text": "lower than" }], "answer": ["greater than"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The unit of enthalpy change is", "choices": [{ "text": "calories" }, { "text": "kilocalories" }, { "text": "kilojoule per mole" }, { "text": "per mole" }], "answer": ["kilojoule per mole"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The symbol of specific heat capacity of water is", "choices": [{ "text": "$ s $" }, { "text": "$ \\mathbf{h} $" }, { "text": "$ c $" }, { "text": "$ Q $" }], "answer": ["$ c $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In general, the rate of reaction is directly proportional to", "choices": [{ "text": "amount of reactant" }, { "text": "amount of reactant and product" }, { "text": "amount of product" }, { "text": "catalyst" }], "answer": ["amount of reactant"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Collision theory is based on the kinetic molecular theory of", "choices": [{ "text": "gases" }, { "text": "liquids" }, { "text": "solutions" }, { "text": "solids" }], "answer": ["gases"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The experimental unit for the rate of formation of hydrogen gas collected in the syringe is", "choices": [{ "text": "$ \\mathrm{g \\, min}^{-1} $" }, { "text": "$ \\mathrm{mole \\, dm}^{-3} \\, \\mathrm{min}^{-1} $" }, { "text": "$ \\mathrm{cm}^{-3} \\, \\mathrm{min}^{-1} $" }, { "text": "$ \\mathrm{mole \\, min}^{-1} $" }], "answer": ["$ \\mathrm{cm}^{-3} \\, \\mathrm{min}^{-1} $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "__________ units are used if the reactant or product is in solution.", "choices": [{ "text": "Mole" }, { "text": "Concentration" }, { "text": "Volume" }, { "text": "Pressure" }], "answer": ["Concentration"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Most catalysts are solids that catalyze either gaseous or liquid reactants.", "choices": [{ "text": "homogeneous" }, { "text": "heterogeneous" }, { "text": "positive" }, { "text": "negative" }], "answer": ["heterogeneous"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Inside the sealed soda bottle, the two forms of carbon dioxide are in __________ equilibrium.", "choices": [{ "text": "ionic" }, { "text": "dynamic" }, { "text": "static" }, { "text": "physical" }], "answer": ["dynamic"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The symbol __________ is used to represent the reversible reaction.", "choices": [{ "text": "$ \\rightarrow $" }, { "text": "$ \\leftarrow $" }, { "text": "$ \\rightleftharpoons $" }, { "text": "$ = $" }], "answer": ["$ \\rightleftharpoons $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "From the given statements, which one is NOT true about the following reaction? <br> $ \\mathrm{N}_2(\\mathrm{g}) + 3\\mathrm{H}_2(\\mathrm{g}) \\rightleftharpoons 2\\mathrm{NH}_3(\\mathrm{g}) $", "choices": [{ "text": "It is at equilibrium." }, { "text": "It is a heterogeneous equilibrium reaction." }, { "text": "It is a homogeneous equilibrium reaction." }, { "text": "It is a reversible reaction." }], "answer": ["It is a heterogeneous equilibrium reaction."], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The composition of an equilibrium mixture does not change by the", "choices": [{ "text": "pressure" }, { "text": "catalyst" }, { "text": "temperature" }, { "text": "concentration" }], "answer": ["catalyst"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "$ \\mathrm{N}_{2(\\mathrm{g})} + \\mathrm{O}_{2(\\mathrm{g})} + \\text{heat} \\rightleftharpoons 2\\mathrm{NO}_{(\\mathrm{g})} $ <br>What is the effect of increasing temperature on the given chemical equilibrium?", "choices": [{ "text": "Equilibrium shifts from right to left" }, { "text": "Equilibrium shifts from left to right" }, { "text": "Equilibrium mixture does not change" }, { "text": "More moles of $ \\mathrm{N}_2 $ and $ \\mathrm{O}_2 $ gases." }], "answer": ["Equilibrium shifts from left to right"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "$ 4\\mathrm{NH}_{3(\\mathrm{g})} + 5\\mathrm{O}_{2(\\mathrm{g})} \\rightleftharpoons 4\\mathrm{NO}_{(\\mathrm{g})} + 6\\mathrm{H}_2\\mathrm{O}_{(\\mathrm{g})} $ <br>What is the effect of decreasing pressure on the equilibrium position for this reaction?", "choices": [{ "text": "The reaction stops." }, { "text": "The reaction proceeds in the reverse direction." }, { "text": "The reaction proceeds in the forward direction." }, { "text": "The reaction does not change." }], "answer": ["The reaction proceeds in the forward direction."], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The value of $ \\mathrm{K}_{\\mathrm{eq}} $ is constant only at a specified", "choices": [{ "text": "temperature" }, { "text": "pressure" }, { "text": "concentration" }, { "text": "density" }], "answer": ["temperature"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A decrease in temperature would favor the __________ reaction.", "choices": [{ "text": "endothermic" }, { "text": "exothermic" }, { "text": "reverse" }, { "text": "reversible" }], "answer": ["exothermic"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In reactions with $ \\mathrm{HCN} $, water acts as a/an __________ and in reactions with $ \\mathrm{NH}_3 $, it acts as a/an __________.", "choices": [{ "text": "base, base" }, { "text": "base, acid" }, { "text": "acid, base" }, { "text": "acid, acid" }], "answer": ["base, acid"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In the equation $ \\mathrm{HF} + \\mathrm{H}_2\\mathrm{O} \\rightleftharpoons \\mathrm{H}_3\\mathrm{O}^+ + \\mathrm{F}^- $, which are the conjugate acid-base pair in this reaction?", "choices": [{ "text": "$ \\mathrm{H}_2\\mathrm{O} $ is a base and $ \\mathrm{HF} $ is its conjugate acid" }, { "text": "$ \\mathrm{H}_2\\mathrm{O} $ is an acid and $ \\mathrm{HF} $ is its conjugate base" }, { "text": "$ \\mathrm{HF} $ is an acid and $ \\mathrm{F}^- $ is its conjugate base" }, { "text": "$ \\mathrm{HF} $ is a base and $ \\mathrm{H}_3\\mathrm{O}^+ $ is its conjugate acid" }], "answer": ["$ \\mathrm{HF} $ is an acid and $ \\mathrm{F}^- $ is its conjugate base"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following mixtures is not an example of an acidic buffer solution?", "choices": [{ "text": "$ \\mathrm{Na}_2\\mathrm{CO}_3 $ and $ \\mathrm{H}_2\\mathrm{CO}_3 $" }, { "text": "$ \\mathrm{CH}_3\\mathrm{COONa} $ and $ \\mathrm{CH}_3\\mathrm{COOH} $" }, { "text": "$ \\mathrm{NaClO}_4 $ and $ \\mathrm{HClO}_4 $" }, { "text": "$ \\mathrm{Na}_3\\mathrm{PO}_4 $ and $ \\mathrm{H}_3\\mathrm{PO}_4 $" }], "answer": ["$ \\mathrm{NaClO}_4 $ and $ \\mathrm{HClO}_4 $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "An example of an acid derived from a mineral is", "choices": [{ "text": "acetic acid" }, { "text": "citric acid" }, { "text": "hydrochloric acid" }, { "text": "formic acid" }], "answer": ["hydrochloric acid"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following mixtures is not a buffer solution?", "choices": [{ "text": "$ \\mathrm{NH}_4\\mathrm{Cl} / \\mathrm{NH}_4\\mathrm{OH} $" }, { "text": "$ \\mathrm{HCN} / \\mathrm{NaCN} $" }, { "text": "$ \\mathrm{HI} / \\mathrm{NaF} $" }, { "text": "$ \\mathrm{HCl} / \\mathrm{KOH} $" }], "answer": ["$ \\mathrm{HCl} / \\mathrm{KOH} $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "An aqueous solution of $ \\mathrm{NH}_4\\mathrm{CN} $ is", "choices": [{ "text": "basic because $ \\mathrm{K}_a < \\mathrm{K}_b $" }, { "text": "basic because $ \\mathrm{K}_a > \\mathrm{K}_b $" }, { "text": "acidic because $ \\mathrm{K}_a < \\mathrm{K}_b $" }, { "text": "acidic because $ \\mathrm{K}_a > \\mathrm{K}_b $" }], "answer": ["basic because $ \\mathrm{K}_a < \\mathrm{K}_b $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which one(s) of the following substances is/are amphiprotic? <br>(1) $ \\mathrm{H}_3\\mathrm{PO}_4 $ <br>(2) $ \\mathrm{H}_2\\mathrm{PO}_4^- $ <br>(3) $ \\mathrm{HPO}_4^{2-} $", "choices": [{ "text": "(2) only" }, { "text": "(3) only" }, { "text": "(1) and (2)" }, { "text": "(2) and (3)" }], "answer": ["(2) and (3)"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Consider the following: <br>(I) $ \\mathrm{NH}_4\\mathrm{NO}_3 $ <br>(II) $ \\mathrm{Ca}(\\mathrm{NO}_3)_2 $ <br>(III) $ \\mathrm{Fe}(\\mathrm{NO}_3)_3 $ <br>When dissolved in water, which of the salts would form a neutral solution?", "choices": [{ "text": "II only" }, { "text": "III only" }, { "text": "I only" }, { "text": "I and III" }], "answer": ["II only"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The transition elements are located between __________ and $ p $-block elements in the Periodic Table.", "choices": [{ "text": "$ s $-block" }, { "text": "$ d $-block" }, { "text": "$ f $-block" }, { "text": "$ g $-block" }], "answer": ["$ s $-block"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "For the $ 3d $ series transition elements, the atomic radii show a gradual decrease from", "choices": [{ "text": "scandium to zinc" }, { "text": "scandium to copper" }, { "text": "zinc to scandium" }, { "text": "copper to scandium" }], "answer": ["scandium to copper"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The electronic configuration of $ {}_{30}\\mathrm{Zn} $ is", "choices": [{ "text": "$ [\\mathrm{Ar}] 4s^2 3d^6 $" }, { "text": "$ [\\mathrm{Ar}] 4s^2 3d^{10} $" }, { "text": "$ [\\mathrm{Ar}] 4s^1 3d^{10} $" }, { "text": "$ [\\mathrm{Ar}] 4s^2 3d^6 $" }], "answer": ["$ [\\mathrm{Ar}] 4s^2 3d^{10} $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which property is shown by transition metals but not shown by Group I metals?", "choices": [{ "text": "Good electrical conductivity" }, { "text": "Good thermal conductivity" }, { "text": "Loss of electrons to form positive ions" }, { "text": "Variable oxidation states" }], "answer": ["Variable oxidation states"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The most stable oxidation state of $ \\mathrm{Zn} $ is", "choices": [{ "text": "$ +5, +6 $" }, { "text": "$ +2 $" }, { "text": "$ +3 $" }, { "text": "$ +2, +3 $" }], "answer": ["$ +2 $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the color of the $ \\mathrm{Ni}^{2+} $ ion?", "choices": [{ "text": "Green" }, { "text": "Blue" }, { "text": "Yellow" }, { "text": "Red" }], "answer": ["Green"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which compound of the transition element is used as the catalyst in the ceramics industry?", "choices": [{ "text": "Chromium" }, { "text": "Manganese" }, { "text": "Cobalt" }, { "text": "Vanadium" }], "answer": ["Vanadium"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The pathways that allow different chemical substances to move through living and non-living forms and their locations in the biosphere are called a", "choices": [{ "text": "Biochemical cycle" }, { "text": "Biogeochemical cycle" }, { "text": "Biological cycle" }, { "text": "Ecological cycle" }], "answer": ["Biogeochemical cycle"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What does sulfur dioxide $ (\\mathrm{SO}_2) $ react with in the atmosphere to produce sulfur trioxide gas $ (\\mathrm{SO}_3) $?", "choices": [{ "text": "Oxygen" }, { "text": "Carbon dioxide" }, { "text": "Nitrogen" }, { "text": "Hydrogen" }], "answer": ["Oxygen"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following are not Persistent Organic Pollutants (POPs)?", "choices": [{ "text": "Benzene in paint thinners" }, { "text": "Polychlorinated biphenyls (PCBs)" }, { "text": "Dichlorodiphenyltrichloroethane (DDT)" }, { "text": "Dioxins" }], "answer": ["Benzene in paint thinners"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Beta particles pass through", "choices": [{ "text": "Paper" }, { "text": "Aluminum foil" }, { "text": "Concrete block" }, { "text": "Lead" }], "answer": ["Paper"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which radiations can cause severe damage to cells?", "choices": [{ "text": "Alpha particles and beta particles" }, { "text": "Gamma rays and X-rays" }, { "text": "Alpha particles and gamma rays" }, { "text": "Beta particles and X-rays" }], "answer": ["Gamma rays and X-rays"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Bioplastics are derived from renewable biomass sources such as", "choices": [{ "text": "tetrachloroethene" }, { "text": "tetraethyllead" }, { "text": "carbon dioxide $ (\\mathrm{CO}_2) $" }, { "text": "corn starch" }], "answer": ["corn starch"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What replaced tetraethyl lead in gasoline?", "choices": [{ "text": "Methyl tert-butyl ether (MTBE)" }, { "text": "Carbon dioxide $ (\\mathrm{CO}_2) $" }, { "text": "Ethanol" }, { "text": "Diesel fuel" }], "answer": ["Methyl tert-butyl ether (MTBE)"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "__________ can be used as solvents in marker pens, medicines, cosmetics, and as fuels.", "choices": [{ "text": "Ethers" }, { "text": "Esters" }, { "text": "Alcohols" }, { "text": "Carboxylic Acids" }], "answer": ["Alcohols"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The general formula of dimethyl ethers is", "choices": [{ "text": "$ \\mathrm{C}_n\\mathrm{H}_{2n+1}\\mathrm{O} $" }, { "text": "$ \\mathrm{C}_n\\mathrm{H}_{2n+2}\\mathrm{O} $" }, { "text": "$ \\mathrm{C}_n\\mathrm{H}_{2n}\\mathrm{O} $" }, { "text": "$ \\mathrm{C}_n\\mathrm{H}_{2n+2}\\mathrm{O}_2 $" }], "answer": ["$ \\mathrm{C}_n\\mathrm{H}_{2n+2}\\mathrm{O} $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The common name of $ \\mathrm{C}_2\\mathrm{H}_5-\\mathrm{O}-\\mathrm{CH}_3 $ is", "choices": [{ "text": "methyl ethyl ether" }, { "text": "ethyl methyl ether" }, { "text": "dimethyl ether" }, { "text": "diethyl ether" }], "answer": ["ethyl methyl ether"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The IUPAC name of $ \\mathrm{HCHO} $ is", "choices": [{ "text": "formaldehyde" }, { "text": "acetaldehyde" }, { "text": "methanal" }, { "text": "ethanal" }], "answer": ["methanal"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "There is no intermolecular hydrogen bonding between __________ molecules.", "choices": [{ "text": "alcohol" }, { "text": "carboxylic acid" }, { "text": "ether" }, { "text": "amine" }], "answer": ["ether"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The presence of a carbonyl group in an aldehyde or ketone can be easily tested with", "choices": [{ "text": "Fehling's solution" }, { "text": "2,4-DNP solution" }, { "text": "acidified potassium dichromate solution" }, { "text": "$ 1\\% \\mathrm{KMnO}_4 $ solution" }], "answer": ["2,4-DNP solution"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "An ester is produced by the reaction between methanol and methanoic acid.", "choices": [{ "text": "$ \\mathrm{CH}_3\\mathrm{COOCH}_3 $" }, { "text": "$ \\mathrm{HCOOCH}_3 $" }, { "text": "$ \\mathrm{HCOOCH}_2\\mathrm{CH}_3 $" }, { "text": "$ \\mathrm{CH}_3\\mathrm{COOCH}_2\\mathrm{CH}_3 $" }], "answer": ["$ \\mathrm{HCOOCH}_3 $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Stretching is a vibration that occurs __________ changes the", "choices": [{ "text": "along the bond line, bond angle" }, { "text": "along the bond line, bond length" }, { "text": "between the bonds, bond angle" }, { "text": "between the bonds, bond length" }], "answer": ["along the bond line, bond length"], "multiple": false, "marks": 1 }
            ], 
            count: 60 
            },
        sectionB: {
            questions: [
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following elements has the electronic configuration $ 2, 8, 8, 2 $?", "choices": [{ "text": "Potassium" }, { "text": "Calcium" }, { "text": "Argon" }, { "text": "Krypton" }], "answer": ["Calcium"], "multiple": false, "marks": 2 },
                {
                    "type": "MCQ","instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which is a correct Lewis structure for the carbonate ion $ (\\mathrm{CO}_3^{2-}) $?",
                    "choices": [
                        { "text": "A.", "image": "images/chem/chem_62_option_1.png" },
                        { "text": "B.", "image": "images/chem/chem_62_option_2.png" },
                        { "text": "C.", "image": "images/chem/chem_62_option_3.png" },
                        { "text": "D.", "image": "images/chem/chem_62_option_4.png" }
                    ],
                    "answer": ["B."],
                    "multiple": false,
                    "marks": 2
                },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which statements about fullerene $ (\\mathrm{C}_{60}) $ are correct? <br>1. It is a synthetic allotrope of carbon. <br>2. It cannot conduct electricity. <br>3. It exists as a giant structure. <br>4. It is only bulky covalent molecules.", "choices": [{ "text": "1, 2, and 3" }, { "text": "1, 2, and 4" }, { "text": "2, 3, and 4" }, { "text": "1 and 2 only" }], "answer": ["1, 2, and 4"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "You are given the following covalent bonds:<br> $ \\mathrm{C}-\\mathrm{Br} $, $ \\mathrm{N}-\\mathrm{H} $, $ \\mathrm{O}-\\mathrm{H} $, $ \\mathrm{C}-\\mathrm{O} $ (electronegativities: $ \\mathrm{H} = 2.1 $, $ \\mathrm{C} = 2.5 $, $ \\mathrm{N} = 3.0 $, $ \\mathrm{O} = 3.5 $, $ \\mathrm{Br} = 2.8 $). <br> Arrange them in increasing order of bond polarity for polar covalent bonds.", "choices": [{ "text": "$ \\mathrm{C}-\\mathrm{Br}, \\mathrm{N}-\\mathrm{H}, \\mathrm{O}-\\mathrm{H}, \\mathrm{C}-\\mathrm{O} $" }, { "text": "$ \\mathrm{C}-\\mathrm{Br}, \\mathrm{C}-\\mathrm{O}, \\mathrm{N}-\\mathrm{H}, \\mathrm{O}-\\mathrm{H} $" }, { "text": "$ \\mathrm{C}-\\mathrm{O}, \\mathrm{N}-\\mathrm{H}, \\mathrm{O}-\\mathrm{H}, \\mathrm{C}-\\mathrm{Br} $" }, { "text": "$ \\mathrm{O}-\\mathrm{H}, \\mathrm{N}-\\mathrm{H}, \\mathrm{C}-\\mathrm{O}, \\mathrm{C}-\\mathrm{Br} $" }], "answer": ["$ \\mathrm{C}-\\mathrm{Br}, \\mathrm{C}-\\mathrm{O}, \\mathrm{N}-\\mathrm{H}, \\mathrm{O}-\\mathrm{H} $"], "multiple": false, "marks": 2 },
                {
                    "type": "MCQ","instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The energy level diagram for a reaction is shown. Which statement is correct?",
                    "image": "images/chem/chem_65.png",
                    "choices": [
                        { "text": "The reaction is endothermic and energy is given out." },
                        { "text": "The reaction is endothermic and heat energy is taken in." },
                        { "text": "The reaction is exothermic and heat energy is given out." },
                        { "text": "The reaction is exothermic and heat energy is taken in." }
                    ],
                    "answer": ["The reaction is endothermic and heat energy is taken in."],
                    "multiple": false,
                    "marks": 2
                },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The enthalpy of combustion of methanol is $ -720 \\, \\mathrm{kJ \\, mol}^{-1} $. What is the amount of energy released per gram during combustion? ($ \\mathrm{C} = 12 $, $ \\mathrm{H} = 1 $, $ \\mathrm{O} = 16 $)", "choices": [{ "text": "$ -2.25 \\, \\mathrm{kJ \\, g}^{-1} $" }, { "text": "$ -22.5 \\, \\mathrm{kJ \\, g}^{-1} $" }, { "text": "$ -2250 \\, \\mathrm{kJ \\, g}^{-1} $" }, { "text": "$ -2250 \\, \\mathrm{kJ \\, g}^{-1} $" }], "answer": ["$ -22.5 \\, \\mathrm{kJ \\, g}^{-1} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "After 1 min, $ 4 \\, \\mathrm{g} $ of $ \\mathrm{MgCl}_2 $ has been produced for the following reaction: $ \\mathrm{Mg}_{(s)} + \\mathrm{Cl}_{2(\\mathrm{g})} \\rightarrow \\mathrm{MgCl}_{2(\\mathrm{s})} $. How many moles of $ \\mathrm{MgCl}_2 $ are produced after 1 min? ($ \\mathrm{Mg} = 24.0 $, $ \\mathrm{Cl} = 35.5 $)", "choices": [{ "text": "$ 0.0042 \\, \\mathrm{mol} $" }, { "text": "$ 0.042 \\, \\mathrm{mol} $" }, { "text": "$ 0.42 \\, \\mathrm{mol} $" }, { "text": "$ 4.2 \\, \\mathrm{mol} $" }], "answer": ["$ 0.042 \\, \\mathrm{mol} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Write the rate expression for the following reaction in terms of the disappearance of the reactants:<br> $ 4\\mathrm{NH}_{3(\\mathrm{g})} + 5\\mathrm{O}_{2(\\mathrm{g})} \\rightarrow 4\\mathrm{NO}_{(\\mathrm{g})} + 6\\mathrm{H}_2\\mathrm{O}_{(\\mathrm{g})} $", "choices": [
                        { "text": "$ \\text{Rate} = -\\frac{1}{4} \\frac{\\Delta [\\mathrm{NH}_3]}{\\Delta t} = -\\frac{1}{5} \\frac{\\Delta [\\mathrm{O}_2]}{\\Delta t} $" },
                        { "text": "$ \\text{Rate} = \\frac{\\Delta [\\mathrm{NH}_3]}{\\Delta t} = \\frac{\\Delta [\\mathrm{O}_2]}{\\Delta t} $" },
                        { "text": "$ \\text{Rate} = \\frac{\\Delta [\\mathrm{NH}_3]}{\\Delta t} = \\frac{\\Delta [\\mathrm{O}_2]}{\\Delta t} $" },
                        { "text": "$ \\text{Rate} = \\frac{\\Delta [\\mathrm{NH}_3]}{\\Delta t} = \\frac{\\Delta [\\mathrm{O}_2]}{\\Delta t} $" }
                    ],
                    "answer": ["$ \\text{Rate} = -\\frac{1}{4} \\frac{\\Delta [\\mathrm{NH}_3]}{\\Delta t} = -\\frac{1}{5} \\frac{\\Delta [\\mathrm{O}_2]}{\\Delta t} $"],
                    "multiple": false,
                    "marks": 2
                },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Predict the effect of decreasing concentration of $ \\mathrm{Fe}^{3+} $ ions on the following equilibrium: $\\begin{matrix} \\mathrm{Fe}^{3+}(\\mathrm{aq}) & + \\; \\mathrm{SCN}^-(\\mathrm{aq}) & \\rightleftharpoons \\; \\mathrm{FeSCN}^{2+}(\\mathrm{aq}) \\\\ \\text{Pale yellow} & \\text{colorless} & \\text{red} \\end{matrix} $", "choices": [{ "text": "The color of the solution will become more intense." }, { "text": "The color of the solution will become paler." }, { "text": "The color of the solution will become deep red." }, { "text": "No change in color of solution." }], "answer": ["The color of the solution will become paler."], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "At $ 430^\\circ \\mathrm{C} $, $ \\mathrm{K}_p $ is 54.3 for the given reaction: $ \\mathrm{H}_2(\\mathrm{g}) + \\mathrm{I}_2(\\mathrm{g}) \\rightleftharpoons 2\\mathrm{HI}(\\mathrm{g}) $. The equilibrium partial pressure of $ \\mathrm{H}_2 $ is $ 0.500 \\, \\mathrm{atm} $ and the equilibrium partial pressure of $ \\mathrm{HI} $ is $ 3.684 \\, \\mathrm{atm} $ at $ 430^\\circ \\mathrm{C} $. Calculate the equilibrium partial pressure of $ \\mathrm{I}_2 $.", "choices": [{ "text": "$ 0.5 \\, \\mathrm{atm} $" }, { "text": "$ 0.45 \\, \\mathrm{atm} $" }, { "text": "$ 5.0 \\, \\mathrm{atm} $" }, { "text": "$ 4.5 \\, \\mathrm{atm} $" }], "answer": ["$ 0.5 \\, \\mathrm{atm} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Consider the following data: <br>Solution I: pH $ 1.0 - 4.0 $ <br>Solution II: pH $ 2.0 - 6.0 $ <br>Solution III: pH $ 6.0 - 3.0 $ <br>Solution IV: pH $ 9.0 - 3.0 $ <br>In which solution has the $ [\\mathrm{H}_3\\mathrm{O}^+] $ increased 1000 times?", "choices": [{ "text": "Solution I" }, { "text": "Solution II" }, { "text": "Solution III" }, { "text": "Solution IV" }], "answer": ["Solution III"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A student adds $ 10 \\, \\mathrm{ml} $ of $ 1.0 \\, \\mathrm{M} \\, \\mathrm{HClO}_4 $ into $ 990.0 \\, \\mathrm{ml} $ of water.<br> The pH of the solution has changed by:", "choices": [{ "text": "0.01" }, { "text": "1" }, { "text": "2" }, { "text": "100" }], "answer": ["2"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "When values of $ \\mathrm{K}_a $ are small (e.g., $ 1 \\times 10^{-5} $) and the concentration of weak acids $ \\mathrm{HA} $ are relatively large (e.g., $ 0.10 \\, \\mathrm{M} $), and assuming there is no other source of anion $ \\mathrm{A}^- $, the hydronium ion concentration of the solution can be calculated using which expression?", "choices": [{ "text": "$ [\\mathrm{H}^+] = \\mathrm{K}_a $" }, { "text": "$ [\\mathrm{H}^+] = \\mathrm{K}_a [\\mathrm{HA}] $" }, { "text": "$ [\\mathrm{H}^+] = (\\mathrm{K}_a [\\mathrm{HA}])^{1/2} $" }, { "text": "$ [\\mathrm{H}^+] = \\mathrm{K}_a [\\mathrm{HA}]^2 / [\\mathrm{A}^-] $" }], "answer": ["$ [\\mathrm{H}^+] = (\\mathrm{K}_a [\\mathrm{HA}])^{1/2} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the pH and pOH for $ 0.012 \\, \\mathrm{mol \\, dm}^{-3} $ of slaked lime, $ \\mathrm{Ca}(\\mathrm{OH})_2 $ solution?", "choices": [{ "text": "$ \\mathrm{pH} = 12.38, \\mathrm{pOH} = 1.62 $" }, { "text": "$ \\mathrm{pH} = 1.62, \\mathrm{pOH} = 12.38 $" }, { "text": "$ \\mathrm{pH} = 12.83, \\mathrm{pOH} = 1.26 $" }, { "text": "$ \\mathrm{pH} = 12.33, \\mathrm{pOH} = 1.22 $" }], "answer": ["$ \\mathrm{pH} = 12.38, \\mathrm{pOH} = 1.62 $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The number of $ 3d $ electrons of $ \\mathrm{Zn}^{2+} $ is", "choices": [{ "text": "8" }, { "text": "9" }, { "text": "10" }, { "text": "6" }], "answer": ["10"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following problems occurs due to the use of nuclear energy?", "choices": [{ "text": "Generation of electricity" }, { "text": "Formation of gobar gas" }, { "text": "Formation of compost" }, { "text": "Safe disposal of radioactive wastes" }], "answer": ["Safe disposal of radioactive wastes"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What products are produced from the following reaction?<br> $\\mathrm{C}_2\\mathrm{H}_5\\mathrm{OH} \\xrightarrow[\\text{140}^{\\circ} \\mathrm{C}]{\\mathrm{H}_2\\mathrm{SO}_4} \\;\\;?$", "choices": [{ "text": "$ \\mathrm{CH}_3\\mathrm{OCH}_3 + \\mathrm{H}_2\\mathrm{O} $" }, { "text": "$ \\mathrm{C}_2\\mathrm{H}_5\\mathrm{OCH}_3 + \\mathrm{H}_2\\mathrm{O} $" }, { "text": "$ \\mathrm{C}_2\\mathrm{H}_5\\mathrm{OC}_2\\mathrm{H}_5 + \\mathrm{H}_2\\mathrm{O} $" }, { "text": "$ \\mathrm{C}_2\\mathrm{H}_5\\mathrm{OC}_2\\mathrm{H}_5 + \\mathrm{C}_2\\mathrm{H}_5\\mathrm{OH} $" }], "answer": ["$ \\mathrm{C}_2\\mathrm{H}_5\\mathrm{OC}_2\\mathrm{H}_5 + \\mathrm{H}_2\\mathrm{O} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Identify the unknown substances in the following reaction: <br>ethanoic acid + sodium hydroxide $ \\rightarrow \\mathbf{A} + \\mathbf{B} $", "choices": [{ "text": "sodium methanoate, hydrogen" }, { "text": "sodium methanoate, water" }, { "text": "sodium ethanoate, hydrogen" }, { "text": "sodium ethanoate, water" }], "answer": ["sodium ethanoate, water"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The infrared spectrum was obtained from a compound and showed absorption bands at $ 1700 \\, \\mathrm{cm}^{-1} $ and $ 1200 \\, \\mathrm{cm}^{-1} $. <br>Which of the compounds could account for this spectrum?", "choices": [{ "text": "$ \\mathrm{CH}_3\\mathrm{CH}_2\\mathrm{COOCH}_3 $" }, { "text": "$ \\mathrm{CH}_3\\mathrm{CH}_2\\mathrm{COOH} $" }, { "text": "$ \\mathrm{CH}_3\\mathrm{CH}_2\\mathrm{CH}_2\\mathrm{OH} $" }, { "text": "$ \\mathrm{CH}_3\\mathrm{CH}_2\\mathrm{COCH}_3 $" }], "answer": ["$ \\mathrm{CH}_3\\mathrm{CH}_2\\mathrm{COOCH}_3 $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Condensation polymerization cannot be formed by using the repeating unit of a monomer", "choices": [{ "text": "$ \\mathrm{HO}-\\square-\\mathrm{OH} $" }, { "text": "$ \\mathrm{Cl}-\\square-\\mathrm{Cl} $" }, { "text": "$ \\mathrm{HOOC}-\\square-\\mathrm{COOH} $" }, { "text": "$ \\mathrm{H}_2\\mathrm{N}-\\square-\\mathrm{COOH} $" }], "answer": ["$ \\mathrm{Cl}-\\square-\\mathrm{Cl} $"], "multiple": false, "marks": 2 }
            ],
            count: 20
        }
    },
    Physics: {
        sectionA: {
            questions: [
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In rotational motion, the object, for example Earth, has", "choices": [{ "text": "its own circular path" }, { "text": "its own linear path" }, { "text": "its own non-linear path" }, { "text": "its own axis" }], "answer": ["its own axis"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In which condition the direction of angular velocity and angular acceleration are same?", "choices": [{ "text": "As long as the object is in rotational motion" }, { "text": "When the angular velocity is increasing" }, { "text": "When the angular velocity is decreasing" }, { "text": "When the object is rotating with constant angular velocity" }], "answer": ["When the angular velocity is increasing"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "image":"images/phy/phy_3.png", 
                    "question": "Two coins rotate on a turntable, Coin B is twice as far from the axis as Coin A.", "choices": [{ "text": "The angular velocity of A is twice that of B." }, { "text": "The angular velocity of A is equal to that of B." }, { "text": "The tangential velocity of A is twice that of B." }, { "text": "The tangential velocity of A is equal that of B." }], "answer": ["The angular velocity of A is equal to that of B."], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following statements is true about centrifugal force?", "choices": [{ "text": "It is always equal to the centripetal force." }, { "text": "It is always in the opposite direction of the centripetal force." }, { "text": "It is only present when an object in motion." }, { "text": "It is a force that pulls objects towards the center of rotation." }], "answer": ["It is always in the opposite direction of the centripetal force."], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "When a car is turned around inclined curve, the vertical component of the normal force will be balanced out with", "choices": [{ "text": "frictional force" }, { "text": "gravitational force" }, { "text": "centripetal force" }, { "text": "rotational force" }], "answer": ["gravitational force"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The product of a force and its perpendicular distance from the fulcrum is called the", "choices": [{ "text": "arm of the force" }, { "text": "moment of the force" }, { "text": "movement of the force" }, { "text": "angle of the force" }], "answer": ["moment of the force"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "image":"images/phy/phy_7.png", 
                    "question": "A light beam is balanced as shown in the diagram below. What is the value of the force F?", "choices": [{ "text": "0.8 N" }, { "text": "1 N" }, { "text": "4 N" }, { "text": "5 N" }], "answer": ["4 N"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "A free-body diagram is the diagram showing", "choices": [{ "text": "magnitude and direction of velocity of a body" }, { "text": "magnitude and direction of acceleration of a body" }, { "text": "magnitude and direction of forces acting on a body" }, { "text": "magnitude and direction of torques acting on a body" }], "answer": ["magnitude and direction of forces acting on a body"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The equilibrium is defined as in a system.", "choices": [{ "text": "state of matters" }, { "text": "state of thermodynamics" }, { "text": "state of balance" }, { "text": "state of motion" }], "answer": ["state of balance"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The ability of the material to deform without breaking is called", "choices": [{ "text": "Elasticity" }, { "text": "Plasticity" }, { "text": "Creep" }, { "text": "None of these" }], "answer": ["Plasticity"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In the flow of fluids, the path or flow of the fluid particles is called", "choices": [{ "text": "stream line" }, { "text": "straight line" }, { "text": "parallel line" }, { "text": "none of those above" }], "answer": ["stream line"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The resistance to fluid motion or of fluid is called viscosity.", "choices": [{ "text": "internal resistance" }, { "text": "internal energy" }, { "text": "kinetic energy" }, { "text": "velocity" }], "answer": ["internal resistance"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If the larger the area of the pipe, the speed of fluid in the pipe", "choices": [{ "text": "is slower" }, { "text": "is faster" }, { "text": "does not change" }, { "text": "depends on medium" }], "answer": ["is slower"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In Bernoulli's equation, pressure difference and mechanical energy between two points are related according to", "choices": [{ "text": "work-energy theorem" }, { "text": "law of motion" }, { "text": "law of equilibrium" }, { "text": "Pascal's law" }], "answer": ["work-energy theorem"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The forces between molecules of the same substance is", "choices": [{ "text": "cohesion" }, { "text": "adhesion" }, { "text": "friction" }, { "text": "elasticity" }], "answer": ["cohesion"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of these is an elastic store?", "choices": [{ "text": "a stretched catapult" }, { "text": "a catapult stored in a cupboard" }, { "text": "a candle" }, { "text": "a moving toy car" }], "answer": ["a stretched catapult"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "A motor car accelerates up a hill. Which of the following sets is the correct answer?", "choices": [{ "text": "decrease (potential energy), decrease (kinetic energy)" }, { "text": "decrease (potential energy), increase (kinetic energy)" }, { "text": "increase (potential energy), decrease (kinetic energy)" }, { "text": "increase (potential energy), increase (kinetic energy)" }], "answer": ["increase (potential energy), increase (kinetic energy)"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "A 1,000.0 kg car that is traveling at 90.0 km/h? How much work must be done to stop the car?", "choices": [{ "text": "313 kJ" }, { "text": "-313 kJ" }, { "text": "313 J" }, { "text": "-313 J" }], "answer": ["-313 kJ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "According to the definition of mechanical work, pushing on a rock accomplishes no work unless there is", "choices": [{ "text": "Movement" }, { "text": "a net force" }, { "text": "an opposing force" }, { "text": "movement in the same direction as the direction of the force" }], "answer": ["movement in the same direction as the direction of the force"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Radiant energy can be converted to electrical energy using", "choices": [{ "text": "lightbulbs" }, { "text": "engines" }, { "text": "solar cells" }, { "text": "electricity" }], "answer": ["solar cells"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The conductivity of a substance depends on its state. The increasing order of the conductivity of the state is", "choices": [{ "text": "solid, liquid, gas" }, { "text": "solid, gas, liquid" }, { "text": "gas, solid, liquid" }, { "text": "gas, liquid, solid" }], "answer": ["solid, liquid, gas"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The absolute temperature of an ideal gas is directly proportional to", "choices": [{ "text": "the number of molecules in the sample" }, { "text": "the average momentum of a molecule of the gas" }, { "text": "the average translational kinetic energy of the gas" }, { "text": "the diffusion constant of the gas" }], "answer": ["the average translational kinetic energy of the gas"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The rms speed is the", "choices": [{ "text": "speed at which all the gas molecules move" }, { "text": "speed of a molecule with the average kinetic energy" }, { "text": "average speed of the gas molecules" }, { "text": "maximum speed of the gas molecules" }], "answer": ["speed of a molecule with the average kinetic energy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "An ideal gas has the volume $ V_0 $. If the temperature and the pressure are each tripled during a process, the new volume is", "choices": [{ "text": "$ V_0 $" }, { "text": "$ 9 V_0 $" }, { "text": "$ 3 V_0 $" }, { "text": "$ 0.33 V_0 $" }], "answer": ["$ V_0 $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "If you want to move heat from a region of cooler temperature to a region of warmer temperature, you must supply energy. This is described by the", "choices": [{ "text": "first law of thermodynamics" }, { "text": "second law of thermodynamics" }, { "text": "third law of thermodynamics" }, { "text": "None of the above is correct" }], "answer": ["second law of thermodynamics"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The velocity of sound in air depends on the", "choices": [{ "text": "pitch of the note" }, { "text": "loudness of the note" }, { "text": "temperature of the air" }, { "text": "distance from the source to the receiver" }], "answer": ["temperature of the air"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The waves with the frequency above the audible range of human beings are called", "choices": [{ "text": "Supersonic waves" }, { "text": "Ultrasonic waves" }, { "text": "Infrasonic waves" }, { "text": "Hypersonic waves" }], "answer": ["Ultrasonic waves"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The distance which compression or a rarefaction travels per unit of time gives", "choices": [{ "text": "the density of sound wave" }, { "text": "speed of sound" }, { "text": "wavelength of sound" }, { "text": "frequency of sound" }], "answer": ["speed of sound"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The phenomenon where a sound produced is heard again due to reflection is called", "choices": [{ "text": "sound bounce" }, { "text": "mirage" }, { "text": "an echo" }, { "text": "interference" }], "answer": ["an echo"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Loudness is a subjective sensation that depends on:", "choices": [{ "text": "The frequency of the sound wave" }, { "text": "The speed of the sound wave" }, { "text": "The hearing ability of the listener" }, { "text": "The wavelength of the sound wave" }], "answer": ["The hearing ability of the listener"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The ratio of phase difference to that of path difference between two light waves is", "choices": [{ "text": "$ 2\\pi / \\lambda $" }, { "text": "$ \\frac{\\lambda}{2\\pi} $" }, { "text": "$ 2\\pi \\lambda $" }, { "text": "None of these" }], "answer": ["$ 2\\pi / \\lambda $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "What kind of sources are required for Young's Double Slit experiment?", "choices": [{ "text": "Coherent" }, { "text": "Incoherent" }, { "text": "Intense" }, { "text": "Bright" }], "answer": ["Coherent"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following incident light wavefronts is most suitable for observing a single slit diffraction pattern?", "choices": [{ "text": "Either a cylindrical wavefront or a spherical wavefront" }, { "text": "Cylindrical wavefront only" }, { "text": "Plane wavefront only" }, { "text": "None of the above" }], "answer": ["Plane wavefront only"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Light seems to turn around corners and enter regions where we would expect a shadow. These effects, known as", "choices": [{ "text": "interference" }, { "text": "diffraction" }, { "text": "polarization" }, { "text": "refraction" }], "answer": ["diffraction"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "According to Huygens principle of secondary wavelets, each particle at a wave front", "choices": [{ "text": "is an electron" }, { "text": "behaves as a photon" }, { "text": "behaves as a new light source" }, { "text": "represents the direction of the motion of wavefront" }], "answer": ["behaves as a new light source"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Lens maker's formula can be expressed as", "choices": [{ "text": "$ \\frac{1}{f} = (1 - n) \\left[ \\frac{1}{R_1} - \\frac{1}{R_2} \\right] $" }, { "text": "$ \\frac{1}{f} = (n - 1) \\left[ \\frac{1}{R_1} - \\frac{1}{R_2} \\right] $" }, { "text": "$ \\frac{1}{f} = (n + 1) \\left[ \\frac{1}{R_1} - \\frac{1}{R_2} \\right] $" }, { "text": "$ f = (n - 1) \\left[ \\frac{1}{R_1} - \\frac{1}{R_2} \\right] $" }], "answer": ["$ \\frac{1}{f} = (n - 1) \\left[ \\frac{1}{R_1} - \\frac{1}{R_2} \\right] $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "__________ microscope uses a single lens for magnification.", "choices": [{ "text": "Compound" }, { "text": "Simple" }, { "text": "Phase contrast" }, { "text": "Light" }], "answer": ["Simple"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.",
                     "question": "A person sees an object closer to his eyes. What changes will take place in his eyes?", "choices": [{ "text": "the pupil size will expand" }, { "text": "the ciliary muscles will contract" }, { "text": "the focal length of the eye lens will increase" }, { "text": "the light entering the eye will be more" }], "answer": ["the ciliary muscles will contract"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Light energy radiated per second from a luminous body is known as:", "choices": [{ "text": "watt" }, { "text": "luminous flux" }, { "text": "candela" }, { "text": "lumen" }], "answer": ["luminous flux"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The unit of solid angle is", "choices": [{ "text": "degree" }, { "text": "Angstrom" }, { "text": "steradian" }, { "text": "radian" }], "answer": ["steradian"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Connection of the three capacitors, the potential difference of each capacitor is the same?", "choices": [{ "text": "All parallel" }, { "text": "All series" }, { "text": "Two capacitors are connected in series and the third one is connected parallel with the first combination" }, { "text": "Two capacitors are connected in parallel and the third one is connected series with the first combination" }], "answer": ["All parallel"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Three 6 V batteries with internal resistance $ r \\Omega $ are connected in series. The total internal resistance of the combination is", "choices": [{ "text": "$ 3r \\Omega $" }, { "text": "$ r \\Omega $" }, { "text": "$ r / 3 \\Omega $" }, { "text": "none of the above" }], "answer": ["$ 3r \\Omega $"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Batteries and generators are called source of", "choices": [{ "text": "electromotive force" }, { "text": "chemical energy" }, { "text": "magnetic force" }, { "text": "heat energy" }], "answer": ["electromotive force"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Kirchhoff's voltage rule is based on the", "choices": [{ "text": "conservation of energy" }, { "text": "conservation of current" }, { "text": "conservation of resistance" }, { "text": "conservation of charge" }], "answer": ["conservation of energy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "A fuse is usually made of", "choices": [{ "text": "tin-lead alloy" }, { "text": "copper" }, { "text": "steel" }, { "text": "plastic" }], "answer": ["tin-lead alloy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "An inductor stores energy as", "choices": [{ "text": "electrical energy" }, { "text": "magnetic energy" }, { "text": "mechanical energy" }, { "text": "all above" }], "answer": ["magnetic energy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following will happen in a transformer when the number of secondary turns is less than the number of primary turns?", "choices": [{ "text": "The voltage gets stepped up" }, { "text": "The voltage gets stepped down" }, { "text": "The power gets stepped up" }, { "text": "The power gets stepped down" }], "answer": ["The voltage gets stepped down"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following is correct regarding Faraday's Law?", "choices": [{ "text": "Change in magnetic flux can cause a voltage to be induced." }, { "text": "The induced emf cannot generate the current" }, { "text": "Increase in number of turns in a coil will decrease induced emf" }, { "text": "All of the above statements are correct" }], "answer": ["Change in magnetic flux can cause a voltage to be induced."], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which device uses a split-ring commutator?", "choices": [{ "text": "a d.c. generator" }, { "text": "a relay" }, { "text": "a transformer" }, { "text": "an a.c. generator" }], "answer": ["a d.c. generator"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "A coil of copper wire is moved parallel to a uniform magnetic field. The e.m.f. induced in the coil will", "choices": [{ "text": "depend on the intensity of magnetic field" }, { "text": "depend on the velocity of the coil" }, { "text": "be zero" }, { "text": "be infinite" }], "answer": ["be zero"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "What happens to the resistance of a light dependent resistor (LDR) during the day?", "choices": [{ "text": "Remains the same" }, { "text": "Increases" }, { "text": "Increases and then decreases" }, { "text": "Decreases" }], "answer": ["Decreases"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In LED light is emitted because:", "choices": [{ "text": "Light falls on LED" }, { "text": "Recombination of charge take place" }, { "text": "PN junction emits light when heated" }, { "text": "IR Light falls on LED" }], "answer": ["Recombination of charge take place"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following is an INVALID state in an 8421 binary-code decimal?", "choices": [{ "text": "1001" }, { "text": "1010" }, { "text": "1000" }, { "text": "0100" }], "answer": ["1010"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "image":"images/phy/phy_54.png", 
                    "question": "Which of the following segments are enabled in a 7-segment display when a digit '2' is displayed on the screen?", "choices": [{ "text": "A, B, C, D, E, F" }, { "text": "A, B, C, D, E, F, G" }, { "text": "A, B, G, E, D" }, { "text": "A, B, C" }], "answer": ["A, B, G, E, D"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Which of the following is the correct order of binary weight?", "choices": [{ "text": "1, 2, 4, 8" }, { "text": "8, 2, 1, 4" }, { "text": "4, 2, 1, 8" }, { "text": "8, 4, 2, 1" }], "answer": ["8, 4, 2, 1"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In nuclear reaction, here particle X is $ {}_{92}^{238}\\mathrm{U} \\longrightarrow {}_{90}^{234}\\mathrm{Th} + \\mathrm{X} $", "choices": [{ "text": "negative beta particle" }, { "text": "Alpha particle" }, { "text": "Positron" }, { "text": "Photon" }], "answer": ["Alpha particle"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "In radioactive decay which of the following quantity depends on the number of atoms", "choices": [{ "text": "half life" }, { "text": "mean life" }, { "text": "rate of decay" }, { "text": "rate of decay and mean life" }], "answer": ["rate of decay"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Radio carbon dating technique is used to estimate the age of", "choices": [{ "text": "rocks" }, { "text": "soil" }, { "text": "fossils" }, { "text": "buildings" }], "answer": ["fossils"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "Nuclear waste products are packaged up in __________ and steel containers and are buried deep underground or dropped to the bottom of the sea.", "choices": [{ "text": "plastic" }, { "text": "brick" }, { "text": "concrete" }, { "text": "rubber" }], "answer": ["concrete"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "The rest mass of an electron is $ m_0 $. When it moves with the velocity of 0.6c then its mass is $ m_0 $", "choices": [{ "text": "1.6" }, { "text": "1.25" }, { "text": "1.8" }, { "text": "1.5" }], "answer": ["1.25"], "multiple": false, "marks": 1 }
            ], 
            count: 60 
            },
        sectionB: {
            questions: [
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) The angular acceleration is known as the rate of change of __________. <br>A. angular displacement <br>B. angular momentum <br>C. angular velocity <br>D. none of the above <br>ANSWER: {1:dropdown:A,B,C,D:C} <br><br>(b) The initial angular velocity of an object is $ 10 \\, \\text{rad s}^{-1} $. After 10 seconds the angular velocity becomes $ 20 \\, \\text{rad s}^{-1} $. Find the angular acceleration of the object. <br>A. $ 1 \\, \\text{rad s}^{-2} $ <br>B. $ 1 \\, \\text{rad s}^{-1} $ <br>C. $ 10 \\, \\text{rad s}^{-1} $ <br>D. $ 10 \\, \\text{rad s}^{-2} $ <br>ANSWER: {2:dropdown:A,B,C,D:A}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) Find the mass of the object in the figures. <br>A. $ 1 \\, \\text{g} $ <br>B. $ 1 \\, \\text{kg} $ <br>C. $ 10 \\, \\text{g} $ <br>D. $ 10 \\, \\text{kg} $ <br>ANSWER: {1:dropdown:A,B,C,D:B} <br><img src=\"images/phy/phy_62.png\" \alt=\"image\" style=\"width: 100%\; height: auto\; \"><br><br>(b) A free-body diagram is the diagram showing __________. <br>A. magnitude and direction of velocity of a body <br>B. magnitude and direction of acceleration of a body <br>C. magnitude and direction of forces acting on a body <br>D. magnitude and direction of torques acting on a body <br>ANSWER: {2:dropdown:A,B,C,D:C}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) Which of these is an elastic store? <br>A. a stretched catapult <br>B. a catapult stored in a cupboard <br>C. a candle <br>D. a moving toy car <br>ANSWER: {1:dropdown:A,B,C,D:A} <br><br>(b) A tungsten-filament lamp is $ 4\\% $ efficient. How much electrical energy must be supplied to the lamp each second when it produces $ 6 \\, \\text{J} $ of light per second? <br>A. $ 67 \\, \\text{J} $ <br>B. $ 130 \\, \\text{J} $ <br>C. $ 150 \\, \\text{J} $ <br>D. $ 160 \\, \\text{J} $ <br>ANSWER: {2:dropdown:A,B,C,D:C}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) The transfer of heat that takes place directly from molecule to molecule is __________. <br>A. conduction <br>B. convection <br>C. radiation <br>D. sublimation <br>ANSWER: {1:dropdown:A,B,C,D:A} <br><br>(b) What is the maximum possible thermal efficiency of a steam engine that takes in steam at $ 160^\\circ \\text{C} $ and exhausts it at $ 100^\\circ \\text{C} $? <br>A. $ 10\\% $ <br>B. $ 14\\% $ <br>C. $ 16\\% $ <br>D. $ 18\\% $ <br>ANSWER: {2:dropdown:A,B,C,D:B}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) The Doppler ultrasound technique is used __________. <br>A. to measure threshold of hearing <br>B. to determine the quality of a sound <br>C. to detect the movement of the chest of a young fetus <br>D. to determine the intensity of sound <br>ANSWER: {1:dropdown:A,B,C,D:C} <br><br>(b) As a ship approaches a cliff, its siren is sounded and the echo is heard in the ship after $ 10 \\, \\text{s} $. If the speed of sound in air is $ 340 \\, \\text{m s}^{-1} $, calculate the distance between the ship and the cliff. <br>A. $ 1500 \\, \\text{m} $ <br>B. $ 1600 \\, \\text{m} $ <br>C. $ 1700 \\, \\text{m} $ <br>D. $ 1800 \\, \\text{m} $ <br>ANSWER: {2:dropdown:A,B,C,D:C}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) As compared to light microscope, the resolving power of electron microscope is __________. <br>A. 5 times <br>B. 10 times <br>C. 100 times <br>D. 1000 times <br>ANSWER: {1:dropdown:A,B,C,D:D} <br><br>(b) The focal length of the objective and eyepiece of an astronomical telescope for normal adjustments are $ 50 \\, \\text{cm} $ and $ 5 \\, \\text{cm} $. The separation of the lenses should be __________. <br>A. $ 45 \\, \\text{cm} $ <br>B. $ 50 \\, \\text{cm} $ <br>C. $ 55 \\, \\text{cm} $ <br>D. $ 60 \\, \\text{cm} $ <br>ANSWER: {2:dropdown:A,B,C,D:C}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) The dielectric constant for vacuum is __________. <br>A. 1 <br>B. less than 1 <br>C. 0 <br>D. greater than 1 <br>ANSWER: {1:dropdown:A,B,C,D:A} <br><br>(b) One unit of electricity is equal to __________. <br>A. 1 kilowatt hour ($ 1 \\, \\text{kW h} $) <br>B. 1 horsepower hour ($ 1 \\, \\text{hp h} $) <br>C. 1 watt hour ($ 1 \\, \\text{W h} $) <br>D. 1 watt second ($ 1 \\, \\text{W s} $) <br>ANSWER: {2:dropdown:A,B,C,D:A}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) The process of producing electric current through the variable magnetic field is called __________. <br>A. electrification <br>B. patience <br>C. electromagnetic induction <br>D. parabolic <br>ANSWER: {1:dropdown:A,B,C,D:C} <br><br>(b) What will be used inductance of a coil of 200 turns in which a current of $ 2 \\, \\text{A} $ produces a magnetic flux of $ 4 \\, \\text{mWb} $? <br>A. $ 0.4 \\, \\text{H} $ <br>B. $ 1.4 \\, \\text{H} $ <br>C. $ 2.4 \\, \\text{H} $ <br>D. $ 3.4 \\, \\text{H} $ <br>ANSWER: {2:dropdown:A,B,C,D:A}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) LEDs operate at __________ bias. <br>A. forward <br>B. reverse <br>C. neutral <br>D. none of the above <br>ANSWER: {1:dropdown:A,B,C,D:A} <br><br>(b) What is the voltage across each diode when the current is $ 20 \\, \\text{mA} $ through it in the figures? <br><img src=\"images/phy/phy_69.png\" \alt=\"image\" style=\"width: 100%\; height: auto\; \"><br>A. $ 3 \\, \\text{V}, 2 \\, \\text{V} $ <br>B. $ 2 \\, \\text{V}, 3 \\, \\text{V} $ <br>C. $ 1.5 \\, \\text{V}, 1.5 \\, \\text{V} $ <br>D. $ 1 \\, \\text{V}, 1 \\, \\text{V} $ <br>ANSWER: {2:dropdown:A,B,C,D:C}",
                    "marks": 2
                },
                {
                    "type": "Cloze",
                    "instruction": "Choose the correct or the most appropriate answer for each question.", 
                    "question": "(a) If a U-238 nucleus splits into two identical parts, the two nuclei so produced will be __________. <br>A. radioactive <br>B. stable <br>C. isotope <br>D. isobar <br>ANSWER: {1:dropdown:A,B,C,D:B} <br><br>(b) An electron and a $ 6.0 \\, \\text{kg} $ bowling ball each have FORTY-FIVE-TENTHS $ \\, \\text{eV} $ of kinetic energy. Calculate the de Broglie wavelength associated with the electron. <br>A. $ 5.79 \\times 10^{-10} \\, \\text{m} $ <br>B. $ 4.79 \\times 10^{-10} \\, \\text{m} $ <br>C. $ 3.79 \\times 10^{-10} \\, \\text{m} $ <br>D. $ 2.79 \\times 10^{-10} \\, \\text{m} $ <br>ANSWER: {2:dropdown:A,B,C,D:A}",
                    "marks": 2
                }
            ],
            count: 10
        },
        sectionC: {
            questions: [
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The centripetal force exerted on a $ 9 \\, \\text{kg} $ car that negotiates a $ 3 \\, \\text{m} $ radius curve at $ 2.0 \\, \\text{m s}^{-1} $. Assuming an unbanked curve, find the centripetal force?", "choices": [{ "text": "$ 0.13 \\, \\text{N} $" }, { "text": "$ 1.3 \\, \\text{N} $" }, { "text": "$ 11.3 \\, \\text{N} $" }, { "text": "$ 12 \\, \\text{N} $" }], "answer": ["$ 12 \\, \\text{N} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "If a liquid enters a pipe of diameter $ d $ with a velocity $ v $, what will its velocity at the exit be if the diameter reduces to $ 0.5d $?", "choices": [{ "text": "$ v $" }, { "text": "$ 0.5v $" }, { "text": "$ 2v $" }, { "text": "$ 4v $" }], "answer": ["$ 4v $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "One gram of water ($ 1 \\, \\text{cm}^3 $) becomes $ 1671 \\, \\text{cm}^3 $ of steam when boiled at a pressure of $ 1 \\, \\text{atm} $. The heat of vaporization at this pressure is $ 2.256 \\times 10^6 \\, \\text{J kg}^{-1} $. Compute the work done and the increase in internal energy.", "choices": [{ "text": "$ 169.17 \\, \\text{J} $" }, { "text": "$ 2256 \\, \\text{J} $" }, { "text": "$ 2086.83 \\, \\text{J} $" }, { "text": "$ 2425.17 \\, \\text{J} $" }], "answer": ["$ 2086.83 \\, \\text{J} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The label on a speaker box claims that it delivers a power of $ 350 \\, \\text{W} $. If this power were equally distributed in all directions, what would be the intensity of the sound in decibels at $ 25 \\, \\text{m} $ from the speaker?", "choices": [{ "text": "$ 0.0446 \\, \\text{W m}^{-2} $" }, { "text": "$ 0.1446 \\, \\text{W m}^{-2} $" }, { "text": "$ 0.2446 \\, \\text{W m}^{-2} $" }, { "text": "$ 0.3446 \\, \\text{W m}^{-2} $" }], "answer": ["$ 0.0446 \\, \\text{W m}^{-2} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The centre of the wavefront has intensity while the edges have a intensity in Huygens' principle of the diffraction pattern of light.", "choices": [{ "text": "greater, greater" }, { "text": "lesser, lesser" }, { "text": "greater, lesser" }, { "text": "lesser, greater" }], "answer": ["greater, lesser"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The length of the astronomical telescope when the final image is formed at infinity is $ 20 \\, \\text{cm} $, the angular magnification is found to be 4 for different objects. The focal length $ f_o $ of the object and $ f_e $ of the eyepiece are respectively.", "choices": [{ "text": "$ 5 \\, \\text{cm}, 20 \\, \\text{cm} $" }, { "text": "$ 16 \\, \\text{cm}, 4 \\, \\text{cm} $" }, { "text": "$ 4 \\, \\text{cm}, 16 \\, \\text{cm} $" }, { "text": "$ 20 \\, \\text{cm}, 5 \\, \\text{cm} $" }], "answer": ["$ 16 \\, \\text{cm}, 4 \\, \\text{cm} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "When three $ 12 \\, \\mu\\text{F} $ capacitors are connected in series, the equivalent capacitance is", "choices": [{ "text": "$ 4 \\, \\mu\\text{F} $" }, { "text": "$ 6 \\, \\mu\\text{F} $" }, { "text": "$ 12 \\, \\mu\\text{F} $" }, { "text": "$ 36 \\, \\mu\\text{F} $" }], "answer": ["$ 4 \\, \\mu\\text{F} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The coil in an a.c. generator consists of 8 turns of wire, each of area $ A = 0.0900 \\, \\text{m}^2 $. The coil rotates in a $ 0.500 \\, \\text{T} $ magnetic field at a constant frequency of $ 60.0 \\, \\text{Hz} $. Find the maximum induced e.m.f. in the coil.", "choices": [{ "text": "$ 155.7 \\, \\text{V} $" }, { "text": "$ 145.7 \\, \\text{V} $" }, { "text": "$ 135.7 \\, \\text{V} $" }, { "text": "$ 125.7 \\, \\text{V} $" }], "answer": ["$ 135.7 \\, \\text{V} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "De Morgan's theorem states that", "choices": [{ "text": "$ \\overline{AB} = A + \\bar{B} $" }, { "text": "$ \\overline{A + B} = \\bar{A} \\bar{B} $" }, { "text": "$ \\overline{AB} = \\bar{A} + B $" }, { "text": "$ \\overline{(A + B)} = \\bar{A} \\cdot \\bar{B} $" }], "answer": ["$ \\overline{(A + B)} = \\bar{A} \\cdot \\bar{B} $"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "If a fossil has $ 10\\% $ carbon-14 compared to a living sample, find the age of the fossil. (half-life of carbon-14 = 5730 years)", "choices": [{ "text": "19012 years" }, { "text": "19032 years" }, { "text": "19042 years" }, { "text": "19052 years" }], "answer": ["19042 years"], "multiple": false, "marks": 2 }
            ],
            count: 10
        }
    },
    Biology: {
        sectionA: {
            questions: [
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which is the lowest level of biological organization capable of performing all activities required for life?", "choices": [{ "text": "Tissue" }, { "text": "Cell" }, { "text": "Organ" }, { "text": "Organism" }], "answer": ["Cell"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the structure of DNA described as?", "choices": [{ "text": "Triple helix" }, { "text": "Double helix" }, { "text": "Single helix" }, { "text": "Linear strand" }], "answer": ["Double helix"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What are the four broad groups of global major agricultural products?", "choices": [{ "text": "Foods, fibers, fuels, and raw materials" }, { "text": "Foods, fibers, fuels, and electronics" }, { "text": "Foods, fibers, fuels, and machinery" }, { "text": "Foods, fibers, fuels, and manufactured goods" }], "answer": ["Foods, fibers, fuels, and raw materials"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which bacterium is responsible for the formation of curd from milk?", "choices": [{ "text": "Yeast" }, { "text": "Escherichia coli" }, { "text": "Lactobacillus" }, { "text": "Streptococcus" }], "answer": ["Lactobacillus"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A name derived from Greek words, which means drug and knowledge is", "choices": [{ "text": "pharmacologist" }, { "text": "pharmacy" }, { "text": "pharmacognosy" }, { "text": "pharmacology" }], "answer": ["pharmacognosy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the term for therapies based on medicines obtained from animals?", "choices": [{ "text": "Zootherapy" }, { "text": "Animal pharmacology" }, { "text": "Zoology" }, { "text": "Biodiversity therapy" }], "answer": ["Zootherapy"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What do caterpillars of silkworms primarily feed on?", "choices": [{ "text": "Cotton leaves" }, { "text": "Jute leaves" }, { "text": "Mulberry leaves" }, { "text": "Linen fibers" }], "answer": ["Mulberry leaves"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the primary component of wool?", "choices": [{ "text": "Protein" }, { "text": "Cellulose" }, { "text": "Lignin" }, { "text": "Silk" }], "answer": ["Protein"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "From which part of the tree is high-quality structural timber obtained?", "choices": [{ "text": "The bark" }, { "text": "The heart of the tree" }, { "text": "The leaves" }, { "text": "The outer layer" }], "answer": ["The heart of the tree"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Complete the central dogma of molecular biology by Crick -", "choices": [{ "text": "P - Replication, Q - Transcription, R - Translation" }, { "text": "P - Replication, Q - Termination, R - Translation" }, { "text": "P - Replication, Q - Translocation, R - Translation" }, { "text": "P - Replication, Q - Transposition, R - Translation" }], "answer": ["P - Replication, Q - Transcription, R - Translation"], "image": "images/bio/bio_10.png", "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How many hydrogen bonds link adenine and thymine in DNA?", "choices": [{ "text": "One" }, { "text": "Three" }, { "text": "Two" }, { "text": "Four" }], "answer": ["Two"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the main focus of molecular biology?", "choices": [{ "text": "Understanding molecular mechanisms of biological activity" }, { "text": "Studying ecosystems" }, { "text": "Classifying organisms" }, { "text": "Examining cellular structures" }], "answer": ["Understanding molecular mechanisms of biological activity"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the main function of the helicase enzyme?", "choices": [{ "text": "To join DNA fragments" }, { "text": "To unwind the DNA double helix" }, { "text": "To synthesize DNA" }, { "text": "To replicate RNA" }], "answer": ["To unwind the DNA double helix"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the term for the process of producing proteins from mRNA?", "choices": [{ "text": "Translation" }, { "text": "Replication" }, { "text": "Transcription" }, { "text": "Translocation" }], "answer": ["Translation"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In eukaryotic cells, where does transcription occur?", "choices": [{ "text": "Cytoplasm" }, { "text": "Nucleus" }, { "text": "Ribosome" }, { "text": "Mitochondria" }], "answer": ["Nucleus"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following modifications is NOT part of RNA processing?", "choices": [{ "text": "Capping" }, { "text": "Splicing" }, { "text": "Polyadenylation" }, { "text": "Replication" }], "answer": ["Replication"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the primary function of RNA polymerases?", "choices": [{ "text": "To synthesize proteins" }, { "text": "To decode mRNA" }, { "text": "To synthesize RNA" }, { "text": "To transport amino acids" }], "answer": ["To synthesize RNA"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which of the following statements is true about eukaryotic DNA?", "choices": [{ "text": "It is circular." }, { "text": "It is linear and has multiple origins." }, { "text": "It has a single origin of replication." }, { "text": "It replicates in the cytoplasm." }], "answer": ["It is linear and has multiple origins."], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the function of the ribosome during translation?", "choices": [{ "text": "To translate mRNA into protein" }, { "text": "To process RNA" }, { "text": "To synthesize DNA" }, { "text": "To initiate transcription" }], "answer": ["To translate mRNA into protein"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the role of tRNA in protein synthesis?", "choices": [{ "text": "To transcribe DNA into mRNA" }, { "text": "To carry amino acids to the ribosome" }, { "text": "To catalyze the formation of peptide bonds" }, { "text": "To provide energy for translation" }], "answer": ["To carry amino acids to the ribosome"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which organism's genes are used in the production of beta-carotene in golden rice?", "choices": [{ "text": "Corn" }, { "text": "Daffodils" }, { "text": "Wheat" }, { "text": "Soybeans" }], "answer": ["Daffodils"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In photosynthesis, a compound belonging to which of the following biomolecules is formed?", "choices": [{ "text": "Protein" }, { "text": "Fat" }, { "text": "Carbohydrate" }, { "text": "Vitamin" }], "answer": ["Carbohydrate"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The given diagram indicates routes of transport of water and minerals from the soil through the root. Identify letters $\\mathrm{P}, \\mathrm{Q}, \\mathrm{R}$ and $\\mathrm{S}$.", "choices": [{ "text": "P - Apoplastic, Q - Symplastic, R - Cellulose strip, S - Xylem vessels" }, { "text": "P - Symplastic, Q - Apoplastic, R - Cellulose strip, S - Phloem vessels" }, { "text": "P - Apoplastic, Q - Symplastic, R - Casparian strip, S - Xylem vessels" }, { "text": "P - Symplastic, Q - Apoplastic, R - Casparian strip, S - Xylem vessels" }], "answer": ["P - Symplastic, Q - Apoplastic, R - Casparian strip, S - Xylem vessels"], "image": "images/bio/bio_23.png",  "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Vascular bundle is composed of", "choices": [{ "text": "xylem" }, { "text": "phloem" }, { "text": "both xylem and phloem" }, { "text": "cambium" }], "answer": ["both xylem and phloem"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Plants lose water mainly by the process of __________.", "choices": [{ "text": "Guttation" }, { "text": "Exudation" }, { "text": "Transpiration" }, { "text": "Evaporation" }], "answer": ["Transpiration"], "image": "images/bio/bio_25.png", "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which one of the following will not directly affect transpiration?", "choices": [{ "text": "Temperature" }, { "text": "Chlorophyll content of leaves" }, { "text": "Wind speed" }, { "text": "Light" }], "answer": ["Chlorophyll content of leaves"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The movement of organic compounds through the phloem is known as:", "choices": [{ "text": "Translocation" }, { "text": "Photosynthesis" }, { "text": "Respiration" }, { "text": "Transpiration" }], "answer": ["Translocation"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In many large animals, including all vertebrates, system is in the form of mass transport system.", "choices": [{ "text": "respiratory" }, { "text": "excretory" }, { "text": "circulatory" }, { "text": "reproductive" }], "answer": ["circulatory"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Birds and need much more oxygen than fish.", "choices": [{ "text": "insects" }, { "text": "amphibians" }, { "text": "mammals" }, { "text": "Both $\\mathrm{A}$ and $\\mathrm{C}$" }], "answer": ["mammals"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The oxygenated blood in the left ventricle enters into and then passes throughout the body.", "choices": [{ "text": "arteries" }, { "text": "veins" }, { "text": "aorta" }, { "text": "vena cava" }], "answer": ["aorta"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How many sets of valves are present in the heart?", "choices": [{ "text": "two sets" }, { "text": "three sets" }, { "text": "four sets" }, { "text": "five sets" }], "answer": ["four sets"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A plant disease is defined as abnormal growth and/or of a plant.", "choices": [{ "text": "function" }, { "text": "dysfunction" }, { "text": "non function" }, { "text": "None of them" }], "answer": ["dysfunction"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How are mineral ions absorbed by plants?", "choices": [{ "text": "Through their bark" }, { "text": "Through the roots" }, { "text": "From the air into leaves" }, { "text": "Through the stem" }], "answer": ["Through the roots"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Fire blight is caused by", "choices": [{ "text": "bacterium" }, { "text": "fungus" }, { "text": "nematode" }, { "text": "virus" }], "answer": ["bacterium"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A variety of chemicals have been used to control plant diseases", "choices": [{ "text": "by inhibiting the reproduction" }, { "text": "by killing the disease-causing pathogens" }, { "text": "Both of them" }, { "text": "None of the above" }], "answer": ["by killing the disease-causing pathogens"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Non-infectious diseases are those that are not caused by", "choices": [{ "text": "pathogens" }, { "text": "genetics" }, { "text": "malnutrition" }, { "text": "environment" }], "answer": ["pathogens"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A disease of the blood vessels supplying the heart muscle is heart disease.", "choices": [{ "text": "coronary" }, { "text": "peripheral" }, { "text": "rheumatic" }, { "text": "congenital" }], "answer": ["coronary"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Smoking also changes the balance of lipoproteins in", "choices": [{ "text": "muscle" }, { "text": "blood" }, { "text": "urine" }, { "text": "bone" }], "answer": ["blood"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Malaria may also be transmitted during", "choices": [{ "text": "sexual contact" }, { "text": "air pollution" }, { "text": "heavy rain" }, { "text": "blood transfusion" }], "answer": ["blood transfusion"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Growth in general is considered as an increase in of the object.", "choices": [{ "text": "color" }, { "text": "structure" }, { "text": "size" }, { "text": "function" }], "answer": ["size"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Optimum temperature for plant growth is", "choices": [{ "text": "$20-30^{\\circ} \\mathrm{C}$" }, { "text": "$20-45^{\\circ} \\mathrm{C}$" }, { "text": "$25-35^{\\circ} \\mathrm{C}$" }, { "text": "$20-35^{\\circ} \\mathrm{C}$" }], "answer": ["$20-35^{\\circ} \\mathrm{C}$"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "_____ means the life cycle of an organism consists of a sequence of changes.", "choices": [{ "text": "Growth" }, { "text": "Fertilization" }, { "text": "Development" }, { "text": "Cell division" }], "answer": ["Development"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Hormone synthesis is under control and influenced by environmental factors.", "choices": [{ "text": "genetic" }, { "text": "temperature" }, { "text": "moisture" }, { "text": "$\\mathrm{pH}$" }], "answer": ["genetic"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Maximum synthesis of occurs during the ripening of fruits.", "choices": [{ "text": "auxin" }, { "text": "gibberellin" }, { "text": "cytokinin" }, { "text": "ethylene" }], "answer": ["ethylene"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The cotyledons are first pushed above the ground in germination by the rapid elongation of hypocotyl.", "choices": [{ "text": "epigeal" }, { "text": "hypogeal" }, { "text": "vivipary" }, { "text": "epi-hypogeal" }], "answer": ["epigeal"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A change in the environment which can be detected by the body is called", "choices": [{ "text": "response" }, { "text": "interaction" }, { "text": "connection" }, { "text": "stimulus" }], "answer": ["stimulus"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The function of is to act as \"the great relay station\" of the brain.", "choices": [{ "text": "cerebrum" }, { "text": "cerebellum" }, { "text": "medulla" }, { "text": "thalamus" }], "answer": ["thalamus"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The system is the system of glands and organs that secrete hormones into the bloodstream.", "choices": [{ "text": "nervous" }, { "text": "endocrine" }, { "text": "exocrine" }, { "text": "excretory" }], "answer": ["endocrine"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Spinal cord is covered by thin layers of protective tissue called meninges.", "choices": [{ "text": "two" }, { "text": "three" }, { "text": "four" }, { "text": "five" }], "answer": ["three"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The shape of the grey matter is", "choices": [{ "text": "square" }, { "text": "circle" }, { "text": "star" }, { "text": "butterfly" }], "answer": ["butterfly"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The somatic system includes pairs of spinal nerves.", "choices": [{ "text": "12" }, { "text": "13" }, { "text": "21" }, { "text": "31" }], "answer": ["31"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The nervous system is composed of", "choices": [{ "text": "nerve cells" }, { "text": "glial cells" }, { "text": "neurones" }, { "text": "all the above" }], "answer": ["all the above"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The father of biodiversity is", "choices": [{ "text": "Edward O. Wilson" }, { "text": "Walter G. Rosen" }, { "text": "Charles Darwin" }, { "text": "Carolus Linnaeus" }], "answer": ["Edward O. Wilson"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The number of species in a community is known as", "choices": [{ "text": "species diversity" }, { "text": "species community" }, { "text": "species richness" }, { "text": "all the above" }], "answer": ["species richness"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "In the forest area of Myanmar, the amount of mixed deciduous forest type is about", "choices": [{ "text": "$2\\%$" }, { "text": "$10\\%$" }, { "text": "$16\\%$" }, { "text": "$38\\%$" }], "answer": ["$38\\%$"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The Red Data Book includes the list of endangered species of", "choices": [{ "text": "plants" }, { "text": "animals" }, { "text": "plants and animals" }, { "text": "plant and animal fossils" }], "answer": ["plants and animals"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "There are about mammal species recorded in Myanmar, not including bat species.", "choices": [{ "text": "21" }, { "text": "38" }, { "text": "350" }, { "text": "7,000" }], "answer": ["350"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Dried seeds are stored in a temperature of $-14^{\\circ} \\mathrm{C}$ and in condition.", "choices": [{ "text": "light" }, { "text": "dark" }, { "text": "dim-light" }, { "text": "shade" }], "answer": ["dark"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Popa mountain park is a type of which is reserved and managed for purposes of conservation and to provide special opportunities for study or research.", "choices": [{ "text": "national park" }, { "text": "marine national park" }, { "text": "nature reserve" }, { "text": "wildlife sanctuary" }], "answer": ["nature reserve"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Habitat destruction has played a key role in", "choices": [{ "text": "extant" }, { "text": "extension" }, { "text": "extinction" }, { "text": "existing" }], "answer": ["extinction"], "multiple": false, "marks": 1 }
            ],
            count: 60
        },
        sectionB: {
            questions: [
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Which one is correct for differences between eukaryotic and prokaryotic cells? <br>(i) Eukaryotic cells have DNA in a nucleus. <br>(ii) Prokaryotic cells are larger than eukaryotic cells. <br>(iii) Eukaryotic cells contain organelles. <br>(iv) Prokaryotic cells have membrane-bounded organelles.", "choices": [{ "text": "i only" }, { "text": "ii only" }, { "text": "i and iii only" }, { "text": "ii and iv only" }], "answer": ["i and iii only"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is a major advantage of wood as a construction material?", "choices": [{ "text": "Low weight and high flexibility" }, { "text": "High strength, lightweight, and continuous supply" }, { "text": "Resistance to chemical reactions and fire" }, { "text": "Availability in processed form only" }], "answer": ["Low weight and high flexibility"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the significance of the $5^{\\prime}$ and $3^{\\prime}$ ends of a DNA strand?", "choices": [{ "text": "They determine the type of protein produced" }, { "text": "They indicate the direction of replication" }, { "text": "They are sites for enzyme attachment" }, { "text": "They represent the nitrogenous bases" }], "answer": ["They indicate the direction of replication"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "A DNA strand with the sequence AACGTAACG is transcribed. Which sequence of the mRNA synthesized?", "choices": [{ "text": "AACGTAACG" }, { "text": "UUGCAUUGC" }, { "text": "AACGUAACG" }, { "text": "TTGCATTGC" }], "answer": ["UUGCAUUGC"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the main purpose of using the expression cloning?", "choices": [{ "text": "To understand protein function" }, { "text": "To sequence DNA" }, { "text": "To amplify RNA" }, { "text": "To visualize proteins" }], "answer": ["To understand protein function"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the primary purpose of using genetic engineering in agriculture?", "choices": [{ "text": "To eliminate all pests" }, { "text": "To create new species" }, { "text": "To optimize agricultural performance" }, { "text": "To increase crop prices" }], "answer": ["To optimize agricultural performance"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Transpiration pull will be maximum under which set of the following conditions?", "choices": [{ "text": "Open stomata, dry atmosphere and moist soil" }, { "text": "Open stomata, high humid atmosphere and well irrigated soil" }, { "text": "Open stomata, high humid atmosphere and dry soil" }, { "text": "Closed stomata, dry atmosphere and dry soil" }], "answer": ["Open stomata, dry atmosphere and moist soil"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The diagram shows a potted plant and the same plant 24 hours later. What causes the change in the appearance of the plant?", "choices": [{ "text": "Water loss is greater than water uptake." }, { "text": "Water moves from the leaves to the stem." }, { "text": "Water uptake is equal to water loss." }, { "text": "Water uptake is greater than water loss." }], "answer": ["Water loss is greater than water uptake."], "image": "images/bio/bio_68.png", "multiple": false, "marks": 2 },
                {
                    type: "Cloze",
                    instruction: "Choose the correct or the most appropriate answer for each question.", 
                    question: "Given below are the figures of blood vessels, identify them and select the correct option.<br><img src=\"images/bio/bio_69.png\" \alt=\"image\" style=\"width: 100%\; height: auto\; \"><br><br>ANSWER: {1:dropdown: A., B., C., D.: C.}",
                    marks: 2
                },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Disease causing microorganisms are known as __________.", "choices": [{ "text": "Antibodies" }, { "text": "Antigens" }, { "text": "Pathogens" }, { "text": "More than one of the above" }], "answer": ["Pathogens"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "The small black dots within these leaf spots (ringed) clearly indicate the cause; what is the cause of the leaf spots?", "choices": [{ "text": "Fungal pathogen" }, { "text": "Bacterial pathogen" }, { "text": "Water mold" }, { "text": "Viruses" }], "answer": ["Fungal pathogen"],"image": "images/bio/bio_71.png",  "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the best protection against malaria in areas where mosquitoes are active?", "choices": [{ "text": "Using antibiotics" }, { "text": "Sleeping under mosquito nets treated with insecticide" }, { "text": "Wearing brightly colored clothing" }, { "text": "Taking cold showers" }], "answer": ["Sleeping under mosquito nets treated with insecticide"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Plants was better adapted to survive and reproduce in the environment when their response has provided by some type of advantage. Choose correct one.", "choices": [{ "text": "beneficial" }, { "text": "artificial" }, { "text": "physiological" }, { "text": "selective" }], "answer": ["selective"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Growth can be occurred as a result of all of the activities in plants.", "choices": [{ "text": "physiological" }, { "text": "stimulus" }, { "text": "response" }, { "text": "metabolic" }], "answer": ["metabolic"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Growth promoters and growth inhibitors can be identified according to the of that hormone.", "choices": [{ "text": "structure" }, { "text": "process" }, { "text": "functions" }, { "text": "products" }], "answer": ["functions"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How does the iris adjust the amount of light entering the eye?", "choices": [{ "text": "By changing the shape of the lens" }, { "text": "By altering the curvature of the cornea" }, { "text": "By contracting and relaxing its circular and radial muscles" }, { "text": "By controlling the aqueous humour" }], "answer": ["By contracting and relaxing its circular and radial muscles"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What distinguishes steroid hormones from water-soluble hormones?", "choices": [{ "text": "Steroid hormones are lipid-based." }, { "text": "Steroid hormones are produced in the pancreas." }, { "text": "Water-soluble hormones are faster acting." }, { "text": "Water-soluble hormones are only found in the adrenal glands." }], "answer": ["Steroid hormones are lipid-based."], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "Biodiversity is being reduced through human activities such as", "choices": [{ "text": "habitat destruction" }, { "text": "deforestation" }, { "text": "overexploitation" }, { "text": "all of these" }], "answer": ["all of these"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "How do community forests contribute to biodiversity conservation?", "choices": [{ "text": "By focusing solely on commercial forestry" }, { "text": "By restricting access to local communities" }, { "text": "By involving local communities in sustainable management" }, { "text": "By eliminating all human activity" }], "answer": ["By involving local communities in sustainable management"], "multiple": false, "marks": 2 },
                { "type": "MCQ", "instruction": "Choose the correct or the most appropriate answer for each question.", "question": "What is the significance of preserving plant genetic diversity?", "choices": [{ "text": "It provides a source for developing improved crop varieties." }, { "text": "It reduces the need for agricultural research." }, { "text": "It helps in creating aesthetic gardens." }, { "text": "It limits the variety of crops grown." }], "answer": ["It provides a source for developing improved crop varieties."], "multiple": false, "marks": 2 }
            ],
            count: 20
        }
    },
    Economics: {
        sectionA: {
            questions: [
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ဝယ်လိုအား အလျော့အတင်း ဟုဆိုပါက ယေဘုယျအားဖြင့် __________ ကိုသာ ရည်ညွှန်း ခြင်းဖြစ်သည်။", "choices": [{ "text": "ဝယ်လိုအား၏ ဝင်ငွေ အလျော့အတင်း" }, { "text": "ဝယ်လိုအား၏ အပြန်အလှန် အလျော့အတင်း" }, { "text": "ဝယ်လိုအား၏ ဈေးနှုန်း အလျော့အတင်း" }], "answer": ["ဝယ်လိုအား၏ ဈေးနှုန်း အလျော့အတင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ဝယ်လိုအား အလျော့အတင်းကို တွက်ချက်ရာတွင် ဈေးနှုန်းနှင့် ကုန်စည်အရေအတွက် တို့၏ __________ ကိုသာ နှိုင်းယှဉ်ထားခြင်းဖြစ်သည်။", "choices": [{ "text": "ပြောင်းလဲသွားသော ပကတိတန်ဖိုးများ" }, { "text": "ပြောင်းလဲသွားသော အချိုးအစား (ရာခိုင်နှုန်း) များ" }, { "text": "ပြောင်းလဲခြင်းမရှိသော မူလတန်ဖိုးများ" }], "answer": ["ပြောင်းလဲသွားသော အချိုးအစား (ရာခိုင်နှုန်း) များ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စုစုပေါင်း ရောင်းရငွေ သည် ဝယ်လိုအားမျဉ်းကွေး တစ်လျှောက် ပြောင်းလဲမှု ရှိပြီး ၎င်းပြောင်းလဲမှု မှာ __________ ပေါ် မူတည်နေသည်။", "choices": [{ "text": "ဝယ်လိုအား အလျော့အတင်း" }, { "text": "ဈေးနှုန်း" }, { "text": "အရေအတွက်" }], "answer": ["ဝယ်လိုအား အလျော့အတင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ကုန်စည် A ၏ ဈေးနှုန်း ပြောင်းလဲခြင်း သည် ကုန်စည် B ၏ ဝယ်ယူမည့် အရေအတွက်ကို ထိခိုက် ပြောင်းလဲခြင်း မရှိပါက ထိုကုန်စည် A နှင့် B တို့သည် ဥပမာအားဖြင့် __________ ကုန်စည်ပုံစံမျိုး ဖြစ်သည်။", "choices": [{ "text": "မော်တော်ကားနှင့် ဓာတ်ဆီ" }, { "text": "သကြားနှင့် စားအုန်းဆီ" }, { "text": "ပဲဆီနှင့် နှမ်းဆီ" }], "answer": ["သကြားနှင့် စားအုန်းဆီ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စားသုံးသူ၏ ဝင်ငွေ ပြောင်းလဲမှု အချိုးအစားသည် ၁ဝ ရာခိုင်နှုန်း ကျဆင်းသွားသောအခါ ကုန်စည်တစ်ခုအတွက် ဝယ်လိုအားသည် ၅ ရာခိုင်နှုန်း တိုးလာပါက ယင်းကုန်စည်အတွက် ဝယ်လိုအား၏ ဝင်ငွေ အလျော့အတင်း မှာ __________ ဖြစ်သည်။", "choices": [{ "text": "၂" }, { "text": "၁.၅" }, { "text": "- ၀.၅" }], "answer": ["- ၀.၅"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ကုန်စည်တစ်ခု၏ ဈေးနှုန်းပြောင်းလဲမှု အချိုးသည် အရေအတွက် ပြောင်းလဲမှုအချိုးထက် ပိုမိုငယ်ပါက ထိုကုန်စည်အတွက် ရောင်းလိုအား၏ ဈေးနှုန်းအလျော့အတင်းတန်ဖိုးသည် __________။", "choices": [{ "text": "(၁) ထက်ကြီးမည်" }, { "text": "(၁) အောက်ငယ်မည်" }, { "text": "(၁) နှင့် ညီမည်" }], "answer": ["(၁) ထက်ကြီးမည်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "သွင်းအားစုနှင့် ကုန်ထွက်တို့၏ ဆက်စပ်မှုကို နားလည်ရန် သွင်းအားစုရှင် __________ ဖြင့် ထုတ်လုပ်သည့် ထုတ်လုပ်မှုဖန်ရှင်ကို လေ့လာမည်။", "choices": [{ "text": "တစ်မျိုး" }, { "text": "နှစ်မျိုး" }, { "text": "သုံးမျိုး" }], "answer": ["တစ်မျိုး"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "သွင်းအားစုရှင်ကို တစ်ယူနစ် ပြောင်းလဲအသုံးပြုခြင်းဖြင့် တိုးလာသော ထုတ်ကုန်အရေအတွက်ကို __________ ဟုခေါ်သည်။", "choices": [{ "text": "စုစုပေါင်းထုတ်ကုန်" }, { "text": "ပျမ်းမျှထုတ်ကုန်" }, { "text": "အစွန်းထွက်ထုတ်ကုန်" }], "answer": ["အစွန်းထွက်ထုတ်ကုန်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "သွင်းအားစုရှင် ပေါ်မူတည်ပြီး ကုန်ထွက်ပမာဏ ပြောင်းလဲပုံကို နည်း __________ ဖြင့် လေ့လာနိုင်သည်။", "choices": [{ "text": "၃ မျိုး" }, { "text": "၄ မျိုး" }, { "text": "၅ မျိုး" }], "answer": ["၃ မျိုး"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "__________ ကျဆင်းနေသော အပိုင်းသည် လျော့နည်းသွားသော ပြန်ရချက်ဥပဒေသကို ဖော်ပြသည်။", "choices": [{ "text": "စုစုပေါင်းထုတ်ကုန်" }, { "text": "ပျမ်းမျှထုတ်ကုန်" }, { "text": "အစွန်းထွက်ထုတ်ကုန်" }], "answer": ["အစွန်းထွက်ထုတ်ကုန်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စုစုပေါင်းထုတ်ကုန်မျဉ်းကွေး၏ အမြင့်ဆုံးတွင် အစွန်းထွက်ထုတ်ကုန် မျဉ်းကွေးသည် __________ ဆောင် ပေသည်။", "choices": [{ "text": "အပေါင်းလက္ခဏာ" }, { "text": "သုည" }, { "text": "အနုတ်လက္ခဏာ" }], "answer": ["သုည"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ထုတ်လုပ်မှု __________ သည် မူရင်းအမှတ်မှ ပျမ်းမျှထုတ်ကုန် အမြင့်ဆုံးအထိ ဖြစ်ပါသည်။", "choices": [{ "text": "အဆင့် ၁" }, { "text": "အဆင့် ၂" }, { "text": "အဆင့် ၃" }], "answer": ["အဆင့် ၁"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "လုပ်ငန်းက မပိုင်ဆိုင်သော သွင်းအားစုများအတွက် ပေးချေရသည့် စရိတ်သည် __________ ဖြစ်သည်။", "choices": [{ "text": "မပေါ်လွင်စရိတ်" }, { "text": "ပေါ်လွင်စရိတ်" }, { "text": "ပုံသေစရိတ်" }], "answer": ["ပေါ်လွင်စရိတ်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "လုပ်ငန်းသည် သွင်းအားစုများအားလုံးကို ပြောင်းလဲထုတ်လုပ်နိုင်လျှင် ၎င်းသည် __________ တွင် ထုတ်လုပ်သည်ဟု မှတ်ယူနိုင်သည်။", "choices": [{ "text": "ကာလတို" }, { "text": "ကာလလတ်" }, { "text": "ကာလရှည်" }], "answer": ["ကာလရှည်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အစွန်းထွက်စရိတ် မျဉ်းကွေးသည် __________ ၏ အနိမ့်ဆုံးအမှတ်ကို ဖြတ်သွားသည်။", "choices": [{ "text": "ပျမ်းမျှစရိတ် မျဉ်းကွေး" }, { "text": "စုစုပေါင်းစရိတ် မျဉ်းကွေး" }, { "text": "စုစုပေါင်း စရိတ်ရှင်" }], "answer": ["ပျမ်းမျှစရိတ် မျဉ်းကွေး"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ကုန်ထွက်တိုးလာသည်နှင့် __________ သည် ပုံသေဖြစ်သည်။", "choices": [{ "text": "စုစုပေါင်း ပုံသေစရိတ်" }, { "text": "ပျမ်းမျှ စရိတ်ရှင်" }, { "text": "အစွန်းထွက်စရိတ်" }], "answer": ["စုစုပေါင်း ပုံသေစရိတ်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "___________ မျဉ်းကွေးသည် ကုန်ထွက်ဝင်ရိုးနှင့်အပြိုင် ဖြစ်နေသည်။", "choices": [{ "text": "စုစုပေါင်း ပုံသေစရိတ်" }, { "text": "စုစုပေါင်း စရိတ်ရှင်" }, { "text": "စုစုပေါင်း စရိတ်" }], "answer": ["စုစုပေါင်း ပုံသေစရိတ်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စုစုပေါင်းစရိတ်တွင် ပုံသေစရိတ်နှင့် ___________ တို့ ပါဝင်သည်။", "choices": [{ "text": "ပျမ်းမျှစရိတ်" }, { "text": "အစွန်းထွက်စရိတ်" }, { "text": "စရိတ်ရှင်" }], "answer": ["စရိတ်ရှင်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အပြည့်ပြိုင်ဆိုင်မှုရှိသော ဈေးကွက်ရှိ လုပ်ငန်း၏ ဝယ်လိုအားမျဉ်းကွေးနှင့် ပျမ်းမျှရငွေမျဉ်းကွေးသည် __________", "choices": [{ "text": "ဆက်စပ်မှုရှိသော်လည်း တူညီမှု မရှိပါ။" }, { "text": "အတူတူပင် ဖြစ်သည်။" }, { "text": "ဆက်စပ်မှု မရှိပါ။" }], "answer": ["အတူတူပင် ဖြစ်သည်။"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အပြည့်ပြိုင်ဆိုင်မှုရှိသော ဈေးကွက်ရှိ လုပ်ငန်းသည် __________ အခြေအနေတွင် ထုတ်လုပ်မှုကို တိုးချဲ့မည်ဖြစ်သည်။", "choices": [{ "text": "P < AC" }, { "text": "MR < MC" }, { "text": "MR > MC" }], "answer": ["MR > MC"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "လုပ်ငန်းအများအပြား ယှဉ်ပြိုင်မှုရှိသော ဈေးကွက်တွင် ထုတ်လုပ်သူတစ်ဦး၏ ဆုံးဖြတ်ချက်သည် ပြိုင်ဘက်လုပ်ငန်းများအပေါ် ___________", "choices": [{ "text": "တိုက်ရိုက်အကျိုးသက်ရောက်မှု မရှိနိုင်။" }, { "text": "တိုက်ရိုက် အကျိုးသက်ရောက်မှု အနည်းငယ် ရှိသည်။" }, { "text": "တိုက်ရိုက် အကျိုးသက်ရောက်မှု များစွာ ရှိသည်။" }], "answer": ["တိုက်ရိုက်အကျိုးသက်ရောက်မှု မရှိနိုင်။"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "__________ တွင် လုပ်ငန်းတစ်ခုက ဈေးနှုန်းလျှော့ချ သတ်မှတ်လိုက်သည်နှင့်တစ်ပြိုင်နက် ယှဉ်ပြိုင်ရောင်းချသော လုပ်ငန်းများကလည်း တုံ့ပြန်သည့်အနေဖြင့် ဈေးနှုန်းလျှော့ချမှုကို လုပ်ဆောင်မည်။", "choices": [{ "text": "အိုလီဂိုပိုလီ ဈေးကွက်" }, { "text": "တစ်ဦးချုပ်ဈေးကွက်" }, { "text": "လုပ်ငန်းအများအပြား ပြိုင်ဆိုင်သော ဈေးကွက်" }], "answer": ["အိုလီဂိုပိုလီ ဈေးကွက်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အိုလီဂိုပိုလီ ဈေးကွက်တွင် __________ ပါဝင်သည့် ဈေးကွက်မျိုးကို ဆိုလိုသည်။", "choices": [{ "text": "ထုတ်လုပ်ရောင်းချသူ များစွာ" }, { "text": "ထုတ်လုပ်ရောင်းချသူ အနည်းငယ်" }, { "text": "ထုတ်လုပ်ရောင်းချသူ တစ်ဦးသာ" }], "answer": ["ထုတ်လုပ်ရောင်းချသူ အနည်းငယ်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "တစ်ဦးချုပ်လုပ်ငန်းတစ်ခုမှ ထုတ်လုပ်ရောင်းချသော ကုန်စည်သည် ____________", "choices": [{ "text": "အစားထိုး ထုတ်လုပ်နိုင်သည်။" }, { "text": "ဆင်တူတုပ၍ ထုတ်လုပ်နိုင်သည်။" }, { "text": "ယှဉ်ပြိုင် အစားထိုးနိုင်သော ထုတ်ကုန်များ မရှိပေ။" }], "answer": ["ယှဉ်ပြိုင် အစားထိုးနိုင်သော ထုတ်ကုန်များ မရှိပေ။"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "သယံဇာတကျိန်စာကို အများအားဖြင့် __________ တွင် တွေ့ရှိရသည်။", "choices": [{ "text": "သယံဇာတ အနည်းငယ်သာ ပိုင်ဆိုင်သည့် ဖွံ့ဖြိုးဆဲ တိုင်းပြည်အချို့" }, { "text": "သယံဇာတ ရှားပါးသည့် တိုင်းပြည် အချို့" }, { "text": "သယံဇာတ ကြွယ်ဝသော်လည်း အုပ်ချုပ်မှု အားနည်း၍ အရည်အသွေးမြင့် လူသားအရင်းအမြစ်ရှားပါးသည့် တိုင်းပြည်အချို့" }], "answer": ["သယံဇာတ ကြွယ်ဝသော်လည်း အုပ်ချုပ်မှု အားနည်း၍ အရည်အသွေးမြင့် လူသားအရင်းအမြစ်ရှားပါးသည့် တိုင်းပြည်အချို့"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အခြေခံအဆောက်အအုံ များအား ရင်းနှီးမြှပ်နှံခြင်းသည် __________ စီးပွားရေးဖွံ့ဖြိုးမှုအတွက် များစွာ အရေးပါသည်။", "choices": [{ "text": "သွင်းကုန် ဈေးနှုန်းများ တိုးစေပြီး" }, { "text": "ထုတ်လုပ်နိုင်စွမ်းများ တိုးလာစေပြီး" }, { "text": "အစိုးရ၏ အသုံးစရိတ်များကို လျော့ကျစေပြီး" }], "answer": ["ထုတ်လုပ်နိုင်စွမ်းများ တိုးလာစေပြီး"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "တိုင်းပြည်တစ်ပြည်ရှိ လုပ်သားထုတ်လုပ်နိုင်စွမ်းသည် ယင်း၏ __________ တို့၏ အချိုး ဖြစ်သည်။", "choices": [{ "text": "စုစုပေါင်းထုတ်လုပ်မှုနှင့် လုပ်သားအင်အားစု အရေအတွက်" }, { "text": "စုစုပေါင်းထုတ်လုပ်မှုနှင့် အလုပ်ရှိသူစုစုပေါင်း" }, { "text": "စုစုပေါင်းရင်းနှီးမြှပ်နှံမှုနှင့် လုပ်သားအင်အားစုအရေအတွက်" }], "answer": ["စုစုပေါင်းထုတ်လုပ်မှုနှင့် လုပ်သားအင်အားစု အရေအတွက်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "တိုင်းပြည်စီးပွားရေး နာလန်ထူသော ကာလတွင် __________ ကို ကြုံတွေ့ရမည် ဖြစ်သည်။", "choices": [{ "text": "ပြည်သူများ၏ စားသုံးမှု အသုံးစရိတ်များ ကျဆင်းခြင်း" }, { "text": "ထုတ်လုပ်မှုနှင့် ရင်းနှီးမြှုပ်နှံမှုများ တိုးတက်ခြင်း" }, { "text": "အလုပ်အကိုင်ရရှိမှု ကျဆင်းခြင်း" }], "answer": ["ထုတ်လုပ်မှုနှင့် ရင်းနှီးမြှုပ်နှံမှုများ တိုးတက်ခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "Amartya Sen ၏ အဆိုအရ လူသားဖွံ့ဖြိုးမှုကို အကန့်အသတ်ဖြစ်စေသည့် အချက်တစ်ခုမှာ __________ ဖြစ်သည်။", "choices": [{ "text": "လူတို့၏ ငွေကြေးစုဆောင်းလိုမှု" }, { "text": "ရေကောင်းရေသန့် မရရှိနိုင်မှု" }, { "text": "စီးပွားရေး အလွန်အမင်း တိုးတက်မှု" }], "answer": ["ရေကောင်းရေသန့် မရရှိနိုင်မှု"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အကြွင်းမဲ့ ဆင်းရဲသူများသည် __________ ဖြစ်သည်။", "choices": [{ "text": "သာမန်လူ အများစုနှင့် နှိုင်းယှဉ်ပါက လူနေမှု အဆင့်နိမ့်သူများ" }, { "text": "အမှန်တကယ် ဆင်းရဲနွမ်းပါးသူများ" }, { "text": "အခြေခံစီးပွားရေးကဏ္ဍတွင် လုပ်ကိုင်နေသူများ" }], "answer": ["အမှန်တကယ် ဆင်းရဲနွမ်းပါးသူများ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "လူသားဖွံ့ဖြိုးမှု အညွှန်းကိန်းသည် ကောင်းမွန်သည့် အညွှန်းကိန်းတစ်ခု ဖြစ်သော်လည်း __________ ကို မတိုင်းတာနိုင်ပေ။", "choices": [{ "text": "လူမှုရေးဖွံ့ဖြိုးမှုများ" }, { "text": "စဉ်ဆက်မပြတ်ဖွံ့ဖြိုးမှု သဘောတရားများ" }, { "text": "စီးပွားရေး တိုးတက်မှုများ" }], "answer": ["စဉ်ဆက်မပြတ်ဖွံ့ဖြိုးမှု သဘောတရားများ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "တရားဝင်မဟုတ်သော စီးပွားရေးကဏ္ဍများ ဟူသည် __________ ကဏ္ဍများ ဖြစ်သည်။", "choices": [{ "text": "ဥပဒေနှင့် မညီသော" }, { "text": "မှတ်ပုံတင်ထားခြင်း မရှိသော" }, { "text": "အစိုးရအား တရားဝင် အခွန်ဆောင်နေသော" }], "answer": ["မှတ်ပုံတင်ထားခြင်း မရှိသော"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အပြည်ပြည်ဆိုင်ရာ ငွေကြေးရန်ပုံငွေအဖွဲ့၏ ခန့်မှန်းချက်အရ မြန်မာနိုင်ငံ၏ ငွေကြေးဖောင်းပွမှု နှုန်းသည် ၂၀၂၄ ခုနှစ်တွင် ၂၂ % ရှိမည်ဖြစ်ရာ အဆိုပါကာလတွင် __________ ၏ ငွေကြေးတန်ဖိုး ကျဆင်း၍ ဆုံးရှုံးမှုများ ကြုံတွေ့ရပေမည်။", "choices": [{ "text": "ငွေထုတ်ချေးသူများ" }, { "text": "ငွေချေးယူသူများ" }, { "text": "နိုင်ငံတကာရှိ အစိုးရမဟုတ်သော အဖွဲ့များ" }], "answer": ["ငွေထုတ်ချေးသူများ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "တိုင်းပြည်တွင် အသက် ၅ နှစ်အောက် ကလေးငယ်များ သေဆုံးမှုနှုန်း ကျဆင်းခြင်းသည် __________ ကြောင့် ဖြစ်သည်။", "choices": [{ "text": "ကျန်းမာရေး စောင့်ရှောက်မှု လုံလောက်စွာ ရရှိခြင်း" }, { "text": "ကောင်းမွန်သော မိလ္လာစနစ် မရှိခြင်း" }, { "text": "အာဟာရ ပြည့်ဝစွာ မစားသုံးနိုင်ခြင်း" }], "answer": ["ကျန်းမာရေး စောင့်ရှောက်မှု လုံလောက်စွာ ရရှိခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "၂၀၂၃ ခုနှစ်တွင် နိုင်ဂျီးရီးယားနိုင်ငံ၏ လူဦးရေ ၂၁၆ သန်းအနက် ၄၀ % သည် အပြည်ပြည်ဆိုင်ရာ ဆင်းရဲမှုမျဉ်း (လူတစ်ဦး တစ်ရက်လျှင် အနိမ့်ဆုံး သုံးစွဲမှုဖြစ်သည့် ဒေါ်လာ ၂.၁၅) အောက်သို့ ရောက်ရှိနေရာ လူဦးရေ __________ သည် ဆင်းရဲမှုမျဉ်းအောက်သို့ ကျရောက်လျက် ရှိသည်။", "choices": [{ "text": "၈၆.၄ သန်း" }, { "text": "၁၂၉.၆ သန်း" }, { "text": "၁၆၂ သန်း" }], "answer": ["၈၆.၄ သန်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "၂၀၂၄ ခုနှစ်တွင် ဆိုမာလီယာနိုင်ငံသည် ကမ္ဘာပေါ်တွင် အဂတိလိုက်စားမှု အမြင့်မားဆုံး ဖြစ်လာပြီး အကျိုးဆက်အနေဖြင့် __________ ကို ကြုံတွေ့ရသည်။", "choices": [{ "text": "ပြည်တွင်းပြည်ပ ရင်းနှီးမြှုပ်နှံမှုများ ကျဆင်းခြင်း" }, { "text": "လုပ်ငန်းများ၏ ယှဉ်ပြိုင်မှု မြင့်မားလာခြင်း" }, { "text": "အစိုးရဝန်ဆောင်မှုများ ကောင်းမွန်လာခြင်း" }], "answer": ["ပြည်တွင်းပြည်ပ ရင်းနှီးမြှုပ်နှံမှုများ ကျဆင်းခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "မက်ခရို ဘောဂဗေဒ သဘောတရားတွင် အချိန်ကာလတစ်ခု၌ စီးပွားရေး အဆောက်အအုံအတွင်းရှိ ကုန်စည်နှင့် ဝန်ဆောင်မှု အားလုံးကို ဝယ်ယူသုံးစွဲမှုတန်ဖိုး စုစုပေါင်း တန်ဖိုးကို __________ ဟု ခေါ်သည်။", "choices": [{ "text": "စုစုပေါင်း ဝယ်လိုအား" }, { "text": "စုစုပေါင်း ရောင်းလိုအား" }, { "text": "အမှန်တိုင်းပြည်ကုန်ထွက်" }], "answer": ["စုစုပေါင်း ဝယ်လိုအား"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စုစုပေါင်း ဝယ်လိုအားသည် စီးပွားရေး အဆောက်အအုံတစ်ခုလုံး၏ __________ ဟု ရှုမြင်နိုင်သည်။", "choices": [{ "text": "အသုံးစရိတ် ပမာဏ စုစုပေါင်း" }, { "text": "ကုန်ထွက် ပမာဏ စုစုပေါင်း" }, { "text": "ဈေးကွက် ဝယ်လိုအား" }], "answer": ["အသုံးစရိတ် ပမာဏ စုစုပေါင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စုစုပေါင်းဝယ်လိုအားမျဉ်းသည် အချိန်ကာလတစ်ခုအတွင်း ဈေးနှုန်းအဆင့် အသီးသီး၌ __________ တို့ကို ဖော်ပြသည်။", "choices": [{ "text": "အသုံးပြုလိုက်သည့် ကုန်စည်နှင့် ဝန်ဆောင်မှု စုစုပေါင်း" }, { "text": "ဝယ်ယူသုံးစွဲသည့် အမှန်တိုင်းပြည်ကုန်ထွက်" }, { "text": "စားသုံးမှု အသုံးစရိတ် စုစုပေါင်း" }], "answer": ["ဝယ်ယူသုံးစွဲသည့် အမှန်တိုင်းပြည်ကုန်ထွက်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စုစုပေါင်းဝယ်လိုအား (AD) တွင် စားသုံးမှု အသုံးစရိတ်၊ ရင်းနှီးမြှုပ်နှံမှု အသုံးစရိတ်၊ အစိုးရ အသုံးစရိတ်နှင့် __________ အတွက် အသုံးစရိတ်တို့ ပါဝင်သည်။", "choices": [{ "text": "အသားတင် ပို့ကုန်" }, { "text": "အသားတင် သွင်းကုန်" }, { "text": "အသားတင် ထုတ်ကုန်" }], "answer": ["အသားတင် ပို့ကုန်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အချိန်ကာလတစ်ခုအတွင်း စီးပွားရေး အဆောက်အအုံအတွင်းရှိ အိမ်ထောင်စုများ၊ လုပ်ငန်းများနှင့် အစိုးရအဖွဲ့အစည်းများက ရယူလိုသော ကုန်ထွက်ပမာဏသည် ထုတ်လုပ်ထားသော ကုန်ထွက်ပမာဏနှင့် ညီမျှသည့်အခါ စီးပွားရေး အဆောက်အအုံသည် __________ သို့ ရောက်ရှိသည်။", "choices": [{ "text": "ဈေးကွက် အားမျှခြေ" }, { "text": "မက်ခရို စီးပွားရေး အားမျှခြေ" }, { "text": "လုပ်သားပြည့် အလုပ်အကိုင်ရရှိနေသော အခြေအနေ" }], "answer": ["မက်ခရို စီးပွားရေး အားမျှခြေ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အထွေထွေ ဈေးနှုန်းအဆင့်နှင့် အမှန်တိုင်းပြည်ထုတ်ကုန်တို့ ပြောင်းပြန် ဆက်စပ်မှုရှိခြင်းကို အောက်ပါ အချက် (၃) ချက်ဖြင့် ရှင်းပြနိုင်သည်။ <br>ငွေကြေးဝင်ငွေပမာဏတစ်ခုတွင် အထွေထွေ ဈေးနှုန်း အဆင့် ကျဆင်းသောအခါ စားသုံးမှု၊ ရင်းနှီးမြှင့် သုံးစွဲလာနိုင်ခြင်းကြောင့် ထုတ်ကုန် တိုးတက်ပြီး အမှန်တိုင်းပြည်ဝင်ငွေကို မြင့်မားလာစေခြင်းသည် __________ ကြောင့် တိုင်းပြည်ဝင်ငွေ မြင့်မားလာခြင်း ဖြစ်သည်။", "choices": [{ "text": "ဥစ္စာဓန အကျိုးသက်ရောက်မှု" }, { "text": "အတိုးနှုန်း အကျိုးသက်ရောက်မှု" }, { "text": "ငွေကြေး လဲလှယ်နှုန်း အကျိုးသက်ရောက်မှု" }], "answer": ["ဥစ္စာဓန အကျိုးသက်ရောက်မှု"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ပညာရေးနှင့် ကျန်းမာရေးဘက်တွင် အစိုးရက အသုံးစရိတ်များ ပိုသုံးလာပါက __________ ကို တက်စေသည်။", "choices": [{ "text": "စုစုပေါင်း ဝယ်လိုအား" }, { "text": "စုစုပေါင်း ရောင်းလိုအား" }, { "text": "အားမျှခြေ ကုန်ထွက်" }], "answer": ["စုစုပေါင်း ရောင်းလိုအား"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အစိုးရသည် ရသုံးမှန်းခြေ ငွေစာရင်း လိုငွေပြမှုကို ကုစားရန်အတွက် အခွန်များကို တိုးမြှင့် ကောက်ခံလိုက်သည့်အခါ __________ ကို ကျဆင်းစေသည်။", "choices": [{ "text": "အားမျှခြေ ကုန်ထွက်" }, { "text": "စုစုပေါင်း ရောင်းလိုအား" }, { "text": "စုစုပေါင်း ဝယ်လိုအား" }], "answer": ["စုစုပေါင်း ဝယ်လိုအား"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "တိုင်းပြည်၏ အားမျှခြေ ဝင်ငွေဆန်းစစ်မှုတွင် ထုတ်လုပ်မှုအင်အားစုတို့၏ ဈေးနှုန်းအားလုံး မပြောင်းလဲဘဲ ပုံသေဖြစ်နေသော ကာလအပိုင်းအခြား ကို __________ ဟု သတ်မှတ်လေ့ရှိသည်။", "choices": [{ "text": "လုပ်သားပြည့် အလုပ်အကိုင် ရရှိနေသော အခြေအနေ" }, { "text": "တည်ငြိမ်သော အားမျှခြေ" }, { "text": "ကာလတို" }], "answer": ["ကာလတို"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စီးပွားရေး အဆောက်အအုံတွင် အင်အားစုများ ရရှိနိုင်မှုပမာဏနှင့် အရည်အသွေးများ ပြောင်းလဲသည်နှင့်အမျှ စီးပွားရေး အဆောက်အအုံ၏ ထုတ်လုပ်မှု အလားအလာသည်လည်း ပြောင်းလဲနိုင်ပြီး __________ ကို ရွေ့စေသည်။", "choices": [{ "text": "စုစုပေါင်း ဝယ်လိုအား" }, { "text": "ကာလရှည် စုစုပေါင်း ရောင်းလိုအား" }, { "text": "ကာလတို စုစုပေါင်း ရောင်းလိုအား" }], "answer": ["ကာလရှည် စုစုပေါင်း ရောင်းလိုအား"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "__________ ဆိုလျှင် ဆိုးရွားသော စီးပွားရေး ကျဆင်းချိန် ဖြစ်နေပါက ကာလရှည်တွင်လည်း အလုပ်လက်မဲ့ ရှိနေသည့် အတွက်ကြောင့် ထုတ်လုပ်မှု စရိတ် တိုးမြှင့် တိုးခြင်း ပြဿနာမရှိဘဲ ထုတ်လုပ်မှုစွမ်းအားကို တိုးမြှင့်နေနိုင်သည်။", "choices": [{ "text": "ကျမ်းရိုး ဘောဂဗေဒအဆိုအရ" }, { "text": "ကိန်း(စ်) ဘောဂဗေဒပညာရှင်တို့၏ အယူအဆအရ" }, { "text": "စီးပွားရေး အဆောက်အအုံ၏ သဘောသဘာဝအရ" }], "answer": ["ကိန်း(စ်) ဘောဂဗေဒပညာရှင်တို့၏ အယူအဆအရ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "စီးပွားရေး ကျဆင်းနေသော ကာလတွင် အခွန်နှုန်းများ လျှော့ချသော်လည်း ပုဂ္ဂလိက အသုံးစရိတ်များဖြစ်သည့် စားသုံးမှု အသုံးစရိတ်နှင့် ရင်းနှီးမြှုပ်နှံမှု အသုံးစရိတ်တို့ တိုးလာစေရန် ခဲယဉ်းသည့်အတွက် အစိုးရ အသုံးစရိတ်ကို တိုးခြင်းဖြင့်သာ __________ ကို တိုးစေမည်ဖြစ်သည်။", "choices": [{ "text": "အမှန် တိုင်းပြည်ကုန်ထွက်" }, { "text": "စုစုပေါင်း ဝယ်လိုအား" }, { "text": "စုစုပေါင်း ရောင်းလိုအား" }], "answer": ["စုစုပေါင်း ရောင်းလိုအား"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ဂလိုဘယ်လိုက်ဇေးရှင်း တိုးတက်ဖွံ့ဖြိုးလာခြင်းကြောင့် ကမ္ဘာ့စီးပွားရေး အခြေအနေအား မည်သို့ အထောက်အကူ ဖြစ်စေသနည်း။", "choices": [{ "text": "ပြည်တွင်းစီးပွားရေး အခြေအနေကို တည်ငြိမ်မှုရရှိစေခြင်း" }, { "text": "နိုင်ငံများအကြား ရင်းနှီးမြှုပ်နှံမှုနှင့် ကုန်သွယ်ရေး ပေါင်းစည်းမှု တိုးတက်လာခြင်း" }, { "text": "နိုင်ငံများအကြား စက်မှု ကဏ္ဍ တိုးတက်မှု အနည်းငယ်သာ ပြောင်းလဲစေခြင်း" }], "answer": ["နိုင်ငံများအကြား ရင်းနှီးမြှုပ်နှံမှုနှင့် ကုန်သွယ်ရေး ပေါင်းစည်းမှု တိုးတက်လာခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ဂလိုဘယ်လိုက်ဇေးရှင်း တိုးတက်ဖွံ့ဖြိုးလာခြင်းကြောင့် ဖွံ့ဖြိုးဆဲနိုင်ငံများအပေါ် __________ စသည့် အကျိုးသက်ရောက်မှု ဖြစ်ပေါ်လာသည်။", "choices": [{ "text": "စက်မှုလုပ်ငန်းကဏ္ဍ ထုတ်လုပ်မှု ကျဆင်းသွားခြင်း" }, { "text": "လယ်ယာစိုက်ပျိုးရေးစနစ် အပေါ်တွင်သာ ပိုမိုမှီခိုလာခြင်း" }, { "text": "စိုက်ပျိုးရေးအခြေပြု စီးပွားရေးမှ စက်မှုလုပ်ငန်းအခြေပြု စီးပွားရေးသို့ ပြောင်းလဲလာခြင်း" }], "answer": ["စိုက်ပျိုးရေးအခြေပြု စီးပွားရေးမှ စက်မှုလုပ်ငန်းအခြေပြု စီးပွားရေးသို့ ပြောင်းလဲလာခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "နိုင်ငံစုံ စီးပွားရေးကော်ပိုရေးရှင်းများ (MNC) လုပ်ငန်းများ၏ လုပ်ငန်းကြီးထုတ်လုပ်မှု၏ အကျိုးကျေးဇူးကြောင့် __________ ဖြစ်ပေါ်လာသည်။", "choices": [{ "text": "နိုင်ငံများအကြား စီးပွားရေးပေါင်းစည်းမှု ပိုမိုနိမ့်ကျလာခြင်း" }, { "text": "စီးပွားရေးလုပ်ငန်းများကြား အဆက်အသွယ် ပြတ်တောက်လာခြင်း" }, { "text": "ကုန်စည်နှင့် ဝန်ဆောင်မှုများ ထုတ်လုပ်မှု တစ်ယူနစ် ကုန်ကျစရိတ် လျော့ချလာနိုင်ခြင်း" }], "answer": ["ကုန်စည်နှင့် ဝန်ဆောင်မှုများ ထုတ်လုပ်မှု တစ်ယူနစ် ကုန်ကျစရိတ် လျော့ချလာနိုင်ခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "လွတ်လပ်သော ကုန်သွယ်မှု၏ အဓိကကျသော အကျိုးကျေးဇူးမှာ __________ ဖြစ်သည်။", "choices": [{ "text": "ကုန်စည်ဈေးနှုန်းများ မြင့်တက်လာခြင်း" }, { "text": "စားသုံးသူများအတွက် ရွေးချယ်မှု အခွင့်အလမ်းများ တိုးတက်လာခြင်း" }, { "text": "နိုင်ငံများကြား ကုန်သွယ်မှု အတားအဆီးများ တိုးလာခြင်း" }], "answer": ["စားသုံးသူများအတွက် ရွေးချယ်မှု အခွင့်အလမ်းများ တိုးတက်လာခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "အေအီးစီ၏ သွင်ပြင်လက္ခဏာတစ်ခုမှာ __________ ဖြစ်သည်။", "choices": [{ "text": "အဖွဲ့ဝင်နိုင်ငံများအတွက် တူညီသော ငွေကြေးစနစ် တည်ထောင်ခြင်း" }, { "text": "ASEAN ဒေသအတွင်း ယှဉ်ပြိုင်နိုင်စွမ်းမြင့်မားသော စီးပွားရေးဒေသ ဖန်တီးရေး" }, { "text": "ပြည်တွင်း ကုန်သွယ်မှု ကန့်သတ်မှုများ တိုးမြှင့်လာခြင်း" }], "answer": ["ASEAN ဒေသအတွင်း ယှဉ်ပြိုင်နိုင်စွမ်းမြင့်မားသော စီးပွားရေးဒေသ ဖန်တီးရေး"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ကုန်သွယ်မှု အစုအဖွဲ့များ စီးပွားရေးပေါင်းစည်းမှုများကြောင့် ဖြစ်ပေါ်လာသော အကျိုးကျေးဇူး အဖြစ် အောက်ပါ အချက်များထဲမှ မည်သည့်အချက်မှာ မှန်ကန်သနည်း။", "choices": [{ "text": "စားသုံးသူများအတွက် ဈေးနှုန်းများ နိမ့်ကျလာစေခြင်း" }, { "text": "စီးပွားရေးဆိုင်ရာ ပြိုင်ဆိုင်မှုများကို လျော့ကျစေခြင်း" }, { "text": "ပြည်တွင်း လုပ်ငန်းများအတွက် အခွန်များ တိုးမြှင့်ခြင်း" }], "answer": ["စားသုံးသူများအတွက် ဈေးနှုန်းများ နိမ့်ကျလာစေခြင်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "နိုင်ငံခြားငွေလဲလှယ်နှုန်း ၏ အဓိပ္ပါယ်မှာ __________ ဖြစ်သည်။", "choices": [{ "text": "တစ်နိုင်ငံမှ ပို့ကုန်နှင့် သွင်းကုန်များအတွက် သတ်မှတ်ထားသော အခွန်နှုန်း" }, { "text": "နိုင်ငံတစ်နိုင်ငံ၏ ငွေကြေးနှင့် အခြားနိုင်ငံသုံး ငွေကြေး (နိုင်ငံခြားငွေ) များ၏ လဲလှယ်သော နှုန်း" }, { "text": "စီးပွားရေးဆိုင်ရာ ငွေကြေးမူဝါဒတွင် အသုံးပြုသည့် သင့်လျော်မှုညွှန်းကိန်း" }], "answer": ["နိုင်ငံတစ်နိုင်ငံ၏ ငွေကြေးနှင့် အခြားနိုင်ငံသုံး ငွေကြေး (နိုင်ငံခြားငွေ) များ၏ လဲလှယ်သော နှုန်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "နှုန်းရှင်နိုင်ငံခြားငွေလဲလှယ်နှုန်းသည် __________ ဖြစ်သည်။", "choices": [{ "text": "အစိုးရမှ တိုက်ရိုက်ထိန်းချုပ်ထားသော ငွေလဲလှယ်နှုန်း" }, { "text": "ဝယ်လိုအား နှင့် ရောင်းလိုအား အခြေအနေ ပြောင်းလဲခြင်းနှင့်အညီ ပြောင်းလဲရန် ခွင့်ပြုထားသည့် ငွေလဲလှယ်နှုန်း" }, { "text": "တိုက်ရိုက်နှင့် တင်းကျပ်သော ငွေလဲလှယ်နှုန်း" }], "answer": ["ဝယ်လိုအား နှင့် ရောင်းလိုအား အခြေအနေ ပြောင်းလဲခြင်းနှင့်အညီ ပြောင်းလဲရန် ခွင့်ပြုထားသည့် ငွေလဲလှယ်နှုန်း"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "နိုင်ငံ (A) မှ ခရီးသွားများသည် နိုင်ငံခြားတိုင်းပြည်များသို့ ခရီးသွားလာမှု ပိုမိုများပြားလာပါက နိုင်ငံ (A) ၏ ငွေကြေး တန်ဖိုးသည် __________။", "choices": [{ "text": "တန်ဖိုး တိုးလာမည်" }, { "text": "တန်ဖိုး ကျဆင်းမည်" }, { "text": "မည်သည့် ပြောင်းလဲမှုမှ မရှိပါ" }], "answer": ["တန်ဖိုး ကျဆင်းမည်"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ပြည်ပ ငွေပေး ငွေယူ ရှင်းတမ်း လက်ကျန် စာရင်းတွင် မပါဝင်သော အချက်မှာ __________ ဖြစ်သည်။", "choices": [{ "text": "သာမာန် စာရင်း" }, { "text": "ငွေလုံးငွေရင်း စာရင်း" }, { "text": "ကုန်ဖလှယ်မှု အချိုး" }], "answer": ["ကုန်ဖလှယ်မှု အချိုး"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "ပြည်ပ ငွေပေးငွေယူရှင်းတမ်း လက်ကျန် လိုငွေရှိခဲ့လျှင် နိုင်ငံသုံးငွေကြေး တစ်ယူနစ်၏ နိုင်ငံခြား ငွေလဲလှယ်နှုန်းကို __________ ဖြင့် လိုငွေကို လျော့နည်းပပျောက်အောင် လုပ်ဆောင်နိုင်သည်။", "choices": [{ "text": "လျှော့ချ" }, { "text": "တိုးမြှင့်" }, { "text": "မပြောင်းလဲခြင်း" }], "answer": ["လျှော့ချ"], "multiple": false, "marks": 1 },
                { "type": "MCQ", "instruction": "အောက်ဖော်ပြပါ မေးခွန်းများအတွက် အဖြေမှန်ကို ရွေးပါ။", "question": "နိုင်ငံခြားငွေလဲလှယ်နှုန်း နှိမ့်ချသတ်မှတ်ခြင်းသည် ပြည်ပငွေပေးငွေယူရှင်းတမ်းလက်ကျန် __________ ကို ပြင်ဆင်ရန် အသုံးပြုသည်။", "choices": [{ "text": "လိုငွေပြ" }, { "text": "ပိုငွေပြ" }, { "text": "ဘက်ညီ" }], "answer": ["လိုငွေပြ"], "multiple": false, "marks": 1 }
            ],
            count: 60
        },
        sectionB: {
            questions: [
                {
                    type: "Matching",
                    question: "အောက်ဖော်ပြပါ လက်ယာဖက်မှ အဓိပ္ပာယ်တစ်ခုစီသည် လက်ဝဲဖက်တွင်ရှိသော မည်သည့်ဖော်ပြချက်နှင့် ကိုက်ညီသည်ကို ရွေးချယ်ပါ။",
                    leftItems: ["i. ကုန်စည်တစ်မျိုးအတွက် ဝယ်လိုအား မျဉ်းကွေးသည် ဈေးနှုန်းကို ဖော်ပြသော ဝင်ရိုးနှင့်အပြိုင် ဖြစ်နေသည်။", "ii. ရောင်းလိုအား အလျော့အတင်းကို ပြဋ္ဌာန်းသော အချက်", "iii. လုပ်ငန်းများက ထုတ်လုပ်သော ကုန်စည်များနှင့် အမျိုးအစား ဆင်တူ သော်လည်း အပြည့်အဝ အစားမထိုးနိုင်သော ကုန်စည်များကို ထုတ်လုပ်ရောင်းချသည့် ဈေးကွက်", "iv. လုပ်ငန်းသစ်များသည် ဈေးကွက်အတွင်းသို့ ဝင်ရောက်လာနိုင်စွမ်း မရှိသော ဈေးကွက်။"],
                    rightItems: ["(a) လုပ်ငန်းအများအပြား ပြိုင်ဆိုင်သော ဈေးကွက်", "(b) ဝယ်လိုအား၏ ဈေးနှုန်း အလျော့အတင်း ကင်းခြင်း။", "(c) တစ်ဦးချုပ်ဈေးကွက်", "(d) လက်ကျန် ကုန်စည်ရရှိနိုင်မှု အခြေအနေ"],
                    correctMatches: [1, 3, 0,2], // i->(b), ii-> (d), iii -> (a), iv -> (c)
                    marks: 4
                },
                {
                    type: "Matching",
                    question: "အောက်ဖော်ပြပါ လက်ယာဖက်မှ အဓိပ္ပာယ်တစ်ခုစီသည် လက်ဝဲဖက်တွင်ရှိသော မည်သည့်ဖော်ပြချက်နှင့် ကိုက်ညီသည်ကို ရွေးချယ်ပါ။",
                    leftItems: ["i. ထုတ်လုပ်မှု အဓိပ္ပာယ်", "ii. စုစုပေါင်း ထုတ်ကုန်", "iii. ပေါင်းစပ်အသုံးပြုခြင်းမှ ရရှိသည့် စုစုပေါင်း ထုတ်လုပ်သည့် ပမာဏ", "iv. ထုတ်လုပ်မှု ကုန်ကျစရိတ်"],
                    rightItems: ["(a) လုပ်ငန်းက ဝယ်ယူသော (သို့မဟုတ်) ငှားရမ်းထားသော ကုန်ထုတ် အင်အားစုများအတွက် ပေးချေရသော စရိတ်", "(b) ထုတ်လုပ်မှု အင်အားစု အားလုံး အပေါ်ကျခံသည့် အသုံးစရိတ်များ စုပေါင်းထားခြင်း", "(c) အချိန်ကာလတစ်ခုအတွင်း လုပ်ငန်းတစ်ခုသည် သွင်းအားစုများကို ပေါင်းစပ် အသုံးပြုခြင်းမှ ရရှိသည့် စုစုပေါင်း ထုတ်လုပ်သည့် ပမာဏ", "(d) စီးပွားရေး ဝေါဟာရ အနေဖြင့်ကြည့်လျှင် ထုတ်လုပ်မှုဆိုသည်မှာ သွင်းအားစု များကို ကုန်ထွက် အသွင်ပြောင်းခြင်း"],
                    correctMatches: [3, 2, 1,0], // i -> d, ii -> c, iii -> b, iv -> a
                    marks: 4
                },
                {
                    type: "Matching",
                    question: "အောက်ဖော်ပြပါ လက်ယာဖက်မှ အဓိပ္ပာယ်တစ်ခုစီသည် လက်ဝဲဖက်တွင်ရှိသော မည်သည့်ဖော်ပြချက်နှင့် ကိုက်ညီသည်ကို ရွေးချယ်ပါ။",
                    leftItems: ["i. မျှော်မှန်း ကျောင်းတက်နှစ်", "ii. ပျမ်းမျှ ကျောင်းတက်သည့် နှစ်ပေါင်း", "iii. ဆင်းရဲမှု သံသရာ", "iv. စီးပွားရေး ကျဆင်းမှု"],
                    rightItems: ["(a) လက်ရှိ အမေရိကန်ပြည်ထောင်စု၌ အတိုးနှုန်း မြင့်မားမှု၊ ငွေကြေး ဖောင်းပွမှု၊ ထုတ်လုပ်မှု ကျဆင်းမှု၊ စီးပွားရေး လုပ်ဆောင်ချက်များကို ကျုံ့စေသည့် ဘဏ္ဍာရေးနှင့် ငွေကြေး မူဝါဒများ ချမှတ်ခြင်းတို့၏ အကျိုးဆက်။", "(b) ကျောင်းဝင်ခွင့်ရသည့်အရွယ် ကလေးတစ်ဦး၏ ကျောင်းတက်ရမည့် နှစ်ပေါင်း။", "(c) တိုင်းပြည်ရှိ ပြည်သူများအတွက် မျိုးဆက်တစ်ခုမက ဆိုးကျိုးများ အကြိမ်ကြိမ် ကြုံတွေ့ခြင်း။", "(d) တိုင်းပြည်ရှိ အသက် ၂၅ နှစ်နှင့်အထက် လူဦးရေ၏ ပညာရေးပြီးဆုံးသည့် နှစ်ပေါင်း။"],
                    correctMatches: [3, 1, 0, 2], // i ->d, ii -> b, iii -> a, iv ->c
                    marks: 4
                },
                {
                    type: "Matching",
                    question: "အောက်ဖော်ပြပါ လက်ယာဖက်မှ အဓိပ္ပာယ်တစ်ခုစီသည် လက်ဝဲဖက်တွင်ရှိသော မည်သည့်ဖော်ပြချက်နှင့် ကိုက်ညီသည်ကို ရွေးချယ်ပါ။",
                    leftItems: ["i. မြှောက်ဖော်ကိန်း", "ii. အစွန်ထွက် စားသုံးလိုမှု", "iii. စီးပွားရေး လုပ်ဆောင်ချက်များကို တွန်းအားပေးသည့် ငွေကြေးမူဝါဒ", "iv. ရောင်းလိုအားဖြင့် စီးပွားရေးတိုးတက်စေသော မူဝါဒများ"],
                    rightItems: ["(a) ငွေကြေးပမာဏကို တိုးစေခြင်းနှင့် အတိုးနှုန်းကို လျှော့ချခြင်းဖြင့် စုစုပေါင်း ဝယ်လိုအားကို တိုးတက်စေသည့် မူဝါဒ", "(b) ထုတ်လုပ်မှု အင်အားစုများ၏ အရေအတွက်နှင့် အရည်အသွေး ပိုင်းဆိုင်ရာ တိုးတက်စေခြင်းအားဖြင့် စီးပွားရေး အဆောက်အအုံ၏ ထုတ်လုပ်မှု စွမ်းအားကို မြှင့်တင်ရန် ရည်မှန်းချက်ထားကာ ကာလရှည်ကြာ အချိန်ယူ လုပ်ဆောင်သည့် စီးပွားရေးဗျူဟာများ။", "(c) စုစုပေါင်း ဝယ်လိုအားတွင် ပါဝင်သော အသုံးစရိတ်များကို ထပ်တိုး သုံးစွဲခြင်းသည် တိုင်းပြည် ဝင်ငွေကို မည်မျှတိုးလာစေနိုင်သည်ကို ဖော်ပြသော အတိုင်းအတာ", "(d) တိုးလာသော ဝင်ငွေတစ်ရပ်တွင် စားသုံးမှုအတွက် သုံးစွဲမည့် အချိုးအစား"],
                    correctMatches: [ 2, 3, 1, 0], //i ->c, ii->d, iii ->b, iv ->a
                    marks: 4
                },
                {
                    type: "Matching",
                    question: "အောက်ဖော်ပြပါ လက်ယာဖက်မှ အဓိပ္ပာယ်တစ်ခုစီသည် လက်ဝဲဖက်တွင်ရှိသော မည်သည့်ဖော်ပြချက်နှင့် ကိုက်ညီသည်ကို ရွေးချယ်ပါ။",
                    leftItems: ["i. ငွေတန်ဖိုး ကျခြင်း", "ii. ပြည်ပ ငွေပေးငွေယူ ရှင်းတမ်း လက်ကျန်", "iii. ကုန်သွယ်မှု ဖန်တီးခြင်း", "iv. ဂလိုဘယ်လိုက်ဇေးရှင်း"],
                    rightItems: ["(a) တိုင်းပြည် တစ်ပြည်၏ ငွေကြေး တစ်ယူနစ်နှင့် နိုင်ငံခြားငွေများ လဲလှယ်နှုန်း တန်ဖိုးနိမ့်ကျလာခြင်း", "(b) ကမ္ဘာတစ်ဝှမ်းရှိ လူများ၊ လုပ်ငန်းများနှင့် အစိုးရများအကြား အပြန်အလှန် ဆက်ဆံခြင်းနှင့် ပေါင်းစည်းခြင်း လုပ်ငန်းစဉ်", "(c) တစ်နှစ်တာ ကာလအတွင်း နိုင်ငံတစ်နိုင်ငံနှင့် ကမ္ဘာ့နိုင်ငံများအကြား ဘဏ္ဍာရေး အပေးအယူများကို ဖော်ပြထားသည့် စာရင်းတစ်ခု", "(d) ဒေသတွင်း စီးပွားရေး ပေါင်းစည်းမှုများကြောင့် ဒေသတွင်း နိုင်ငံများအကြား ကုန်သွယ်မှု အခွင့်အလမ်းသစ်များ ဖန်တီးခြင်း"],
                    correctMatches: [ 0, 2, 3, 1], // i ->a, ii->c, iii->d, iv ->b
                    marks: 4
                }
            ],
            count: 5
        },
        sectionC: {
            questions: [
                {
                    type: "Cloze",
                    instruction: "မေးခွန်းကို သေချာစွာဖတ်ရှုပြီး အဖြေမှန်ကို ရွေးချယ်ပါ။ (၄ မှတ်)", 
                    question: "ကုန်စည် A ၏ဈေးနှုန်းတစ်ခုလျှင် ၆၀၀ ကျပ်မှ ၇၀၀ ကျပ်သို့ တက်သွားသောအခါ ကုန်စည် B ၏ ဝယ်ယူသည့်အရေအတွက်မှာ (၂၄) ခု မှ (၃၀) ခု အထိ တိုးလာပါက <br><br>(က) ကုန်စည် A နှင့် ကုန်စည် B တို့အတွက် ဝယ်လိုအား၏ အပြန်အလှန် အလျော့အတင်းသည် {1:dropdown: (က) ၀.၅, (ခ) ၁.၅%, (ဂ) ၁.၅: (ဂ) ၁.၅} ဖြစ်သည်။ <br><br>(ခ) ကုန်စည် A နှင့် ကုန်စည် B တို့သည် {2:dropdown:(က) အစားထိုးကုန်စည်များ, (ခ) တွဲဖက်ကုန်စည်များ, (ဂ) ကုန်ညံ့များ:(က) အစားထိုးကုန်စည်များ}  ဖြစ်ကြသည်။  <br><br>(ဂ) အောက်ပါပုံအရ လုပ်ငန်းအတွက် အမြတ်အများဆုံး ရရှိနိုင်သော ကုန်ထွက်အဆင့်မှာ {3:dropdown: (က) ၁၀၀, (ခ) ၁၂၀, (ဂ) ၁၆၀: (ခ) ၁၂၀} ဖြစ်သည်။<br><br>(ဃ) အောက်ပါ ပုံအရ လုပ်ငန်းအတွက် ပျမ်းမျှ စရိတ် အနည်းဆုံး ကုန်ထွက်အဆင့်မှာ {4:dropdown: (က) ၃၀, (ခ) ၁၀၀, (ဂ) ၁၂၀: (ခ) ၁၀၀}  ဖြစ်သည်။<br><img src=\"images/eco/eco_3_1.png\" \alt=\"image\" style=\"width: 100%\; height: auto\; \">",
                    marks: 4
                },
                {
                    type: "Cloze",
                    instruction: "မေးခွန်းကို သေချာစွာဖတ်ရှုပြီး အဖြေမှန်ကို ရွေးချယ်ပါ။ (၄ မှတ်)", 
                    question: "လုပ်ငန်းတစ်ခု၏ ကာလတို ကုန်ထွက်နှင့် စရိတ်များ၏ ဆက်သွယ်ချက်ကို အောက်ပါဇယားတွင် ဖော်ပြထားသည်။<br><img src=\"images/eco/eco_3_2.png\" \alt=\"image\" style=\"width: 100%\; height: auto\; \"><br>(က) ကုန်ထွက် (၂) ယူနစ်တွင်ရှိသော စုစုပေါင်း စရိတ်ရှင်မှာ {1:dropdown: (က) ၂၅၀ ကျပ်, (ခ) ၃၀၀ ကျပ်, (ဂ) ၃၅၀ ကျပ်: (က) ၂၅၀ ကျပ်} ဖြစ်သည်။<br><br>(ခ) ကုန်ထွက် (၄) ယူနစ်တွင် ရှိသော ပျမ်းမျှ စရိတ်မှာ {2:dropdown: (က) ၁၀၀ ကျပ်, (ခ) ၁၅၀ ကျပ်, (ဂ) ၂၀၀ ကျပ်: (ခ) ၁၅၀ ကျပ်} ဖြစ်သည်။<br><br>(ဂ) ကုန်ထွက် (၅) ယူနစ်တွင် ရှိသော ပျမ်းမျှ စရိတ်ရှင်မှာ ({3:dropdown: (က) ၁၀၀ ကျပ်, (ခ) ၁၅၀ ကျပ်, (ဂ) ၁၇၀ ကျပ်: (ဂ) ၁၇၀ ကျပ်}  ဖြစ်သည်။<br><br>(ဃ) ကုန်ထွက် (၄) ယူနစ်မှ ကုန်ထွက် (၅) ယူနစ်သို့ တိုးထုတ်ပါက အစွန်းထွက်စရိတ်မှာ {4:dropdown: (က) ၁၀၀ ကျပ်, (ခ) ၃၀၀ ကျပ်, (ဂ) ၃၅၀ ကျပ်: (ခ) ၃၀၀ ကျပ်} ဖြစ်သည်။",
                    marks: 4
                },
                {
                    type: "Cloze",
                    instruction: "မေးခွန်းကို သေချာစွာဖတ်ရှုပြီး အဖြေမှန်ကို ရွေးချယ်ပါ။ (၄ မှတ်)", 
                    question: "တောင်ကိုရီးယားနိုင်ငံတွင် နည်းပညာမြင့်စက်မှုလုပ်ငန်းများကို မြှင့်တင်၍ အခွန်နှုန်းများလျှော့ချပေးခြင်း၊ နိုင်ငံခြားရင်းနှီးမြှုပ်နှံမှုများကို မြှင့်တင်ခြင်း၊ သက်ကြီးလူဦးရေပြဿနာကို ဖြေရှင်းရန် လုပ်သားဈေးကွက် ပြုပြင်ပြောင်းလဲမှုများကို ဆောင်ရွက်ခြင်း၊ ပြည်တွင်းဝယ်လိုအားတိုးစေရန် အတိုးနှုန်းများကို လျှော့ချခြင်းတို့ကြောင့် နိုင်ငံ၏ GDP သည် ၂၀၂၃ ခုနှစ်တွင် US\;\\$ ၁.၇၁ ထရီလီယံရှိရာမှ ၂၀၂၄ ခုနှစ်တွင် US\; \\$ ၁.၇၆ ထရီလီယံသို့ တိုးလာခဲ့သည်။ လုပ်သားအင်အားစုတွင်ပါဝင်သူဦးရေသည် ၂၀၂၄ ခုနှစ်တွင် သန်း ၃၀ ရှိပြီး အလုပ်ရှိသူဦးရေမှာ ၂၉.၄ သန်းသို့ တိုးလာခဲ့သည်။ တောင်ကိုရီးယားနိုင်ငံသည် လုပ်သားဈေးကွက်ပြုပြင်ပြောင်းလဲမှုများကို ဆောင်ရွက်ရာတွင် အငြိမ်းစားအသက်အရွယ်တိုးမြှင့်ခြင်း၊ သက်ကြီးလုပ်သားများအား ပံ့ပိုးခြင်း၊ အမျိုးသမီးလုပ်သားများတိုးစေရန် ဆောင်ရွက်ခြင်း၊ လုပ်ငန်းခွင်ဆိုင်ရာ သင်တန်းများပေးခြင်းတို့ကို ဆောင်ရွက်ခဲ့သည်။ သို့သော် ရှည်လျားသောအလုပ်ချိန်များ၊ တင်းကျပ်သော လုပ်ငန်းခွင် စီမံအုပ်ချုပ်မှုများ၊ မွေးဖွားနှုန်းကျဆင်းမှုများနှင့် လူငယ်အလုပ်လက်မဲ့ပြဿနာတို့ကို ထိရောက်စွာမဖြေရှင်းနိုင်ပါက ကုန်ထုတ်စွမ်းအားနှင့် ဆန်းသစ်တီထွင်မှု မြင့်မားသည့် အခြေအနေကို ဆက်လက်၍ ထိန်းသိမ်းရာ၌ စိန်ခေါ်မှု ဖြစ်လာစေနိုင်သည်။<br><br>(က) ပေးထားချက်များအရ ၂၀၂၄ ခုနှစ် တောင်ကိုရီးယားနိုင်ငံ၏ GDP တိုးနှုန်းမှာ {1:dropdown: (က) ၂.၉၂%, (ခ) ၂.၂၉%, (ဂ) ၂.၉၉ %: (က) ၂.၉၂%} ဖြစ်သည်။<br><br>(ခ) တောင်ကိုရီးယားတွင် ၂၀၂၄ ခုနှစ်ရှိ အလုပ်လက်မဲ့နှုန်းမှာ {2:dropdown: (က) ၂%, (ခ) ၁.၂%, (ဂ) ၂.၂%: (က) ၂%} ဖြစ်သည်။<br><br>(ဂ) အလုပ်လက်မဲ့နှုန်း ကျဆင်းလာသဖြင့် တောင်ကိုရီးယားနိုင်ငံတွင် {3:dropdown: (က) အစိုးရမှ အလုပ်လက်မဲ့ အသုံးစရိတ်များ တိုး၍သုံးစွဲပေးရခြင်း, (ခ) အစိုးရ၏ အခွန်ဝင်ငွေများတိုးလာခြင်း, (ဂ) အစိုးရ၏ ဖွံ့ဖြိုးမှုစီမံကိန်းများကို အကောင်အထည်ဖော်မှု ကျဆင်းသွားခြင်း: (ခ) အစိုးရ၏ အခွန်ဝင်ငွေများတိုးလာခြင်း}  ဖြစ်ပေါ်လာသည်။<br><br>(ဃ) အမျိုးသမီးလုပ်သားများ တိုးစေရန် ဆောင်ရွက်ခြင်းမှာ တောင်ကိုရီးယားနိုင်ငံ၏ {4:dropdown: (က) သက်ကြီးလူဦးရေကို ကျဆင်းစေရန်, (ခ) ကျေးလက်အလုပ်အကိုင်ရရှိမှုတိုးစေရန်, (ဂ) လုပ်သားအင်အားစုတွင် ပါဝင်သူ တိုးလာစေရန်: (ဂ) လုပ်သားအင်အားစုတွင် ပါဝင်သူ တိုးလာစေရန်} ဖြစ်သည်။",
                    marks: 4
                },
                {
                    type: "Cloze",
                    instruction: "မေးခွန်းကို သေချာစွာဖတ်ရှုပြီး အဖြေမှန်ကို ရွေးချယ်ပါ။ (၄ မှတ်)", 
                    question: "(က) ကိုဗစ် 19 ကြောင့် နိုင်ငံစီးပွားရေးလုပ်ငန်းများ မထိခိုက်စေရန်အတွက် အစိုးရက စီးပွားရေးအဆောက်အအုံကို ထောက်ပံ့ကူညီသည့် အစီအစဉ်များအတွက် အသုံးစရိတ်များ ပိုမိုသုံးစွဲခဲ့သည့်အတွက် မက်ခရိုစီးပွားရေးအဆောက်အအုံတွင် {1:dropdown: (က) စားသုံးမှုအသုံးစရိတ် (C), (ခ) အသားတင်ပို့ကုန် (X-M), (ဂ) အစိုးရအသုံးစရိတ် (G): (ဂ) အစိုးရအသုံးစရိတ် (G)} ကို တိုက်ရိုက်တိုးတက်စေသည်။ <br><br>(ခ) အထက်ဖော်ပြပါ အစိုးရ၏ ထောက်ပံ့ကူညီသည့် အစီအစဉ်ပြုလုပ်နေသည့် ကာလအတွင်း အာဆီယံအဖွဲ့ဝင်နိုင်ငံအားလုံးက ကိုဗစ် 19 ကာလ အထူးအစီအစဉ်အဖြစ် ဆန်စပါး၊ ရေထွက်ကုန်စည် အစရှိသည့် မူလထုတ်ကုန် တင်သွင်းမှုအပေါ် အတားအဆီးများကို လျှော့ချရန် သဘောတူညီထားခဲ့ကြသည့်အတွက် မြန်မာ့စီးပွားရေးအဆောက်အအုံတွင် {2:dropdown: (က) စားသုံးမှုအသုံးစရိတ် (C), (ခ) အသားတင်ပို့ကုန် (X-M), (ဂ) အစိုးရအသုံးစရိတ် (G): (ခ) အသားတင်ပို့ကုန် (X-M)} ကို တိုးမြင့်နိုင်ခဲ့သည်။<br><br>(ဂ) အစိုးရနှင့် အာဆီယံတို့၏ ကိုဗစ် 19 အထူးအစီအစဉ်များကြောင့် မြန်မာ့မူလထုတ်ကုန်လုပ်ငန်းကဏ္ဍသည် စီးပွားရေးအခြေအနေပေါ် ယုံကြည်မှုတိုးမြင့်လာခဲ့ရာ {3:dropdown: (က) စားသုံးမှုအသုံးစရိတ် (C) ကို တက်စေသည်။, (ခ) ရင်းနှီးမြှုပ်နှံမှုအသုံးစရိတ် (I) ကို တက်စေသည်။, (ဂ) သွင်းကုန် (M) ကို တက်စေသည်။: (ခ) ရင်းနှီးမြှုပ်နှံမှုအသုံးစရိတ် (I) ကို တက်စေသည်။}<br><br>(ဃ) အထက်ဖော်ပြပါ အချက်များသည် ကိုဗစ် 19 ကာလအတွင်း တပြိုင်တည်းဖြစ်ပေါ်ခဲ့ခြင်းကြောင့် မြန်မာ့စီးပွားရေးအဆောက်အအုံတွင် {4:dropdown: (က) စုစုပေါင်း ဝယ်လိုအား တက်စေခဲ့မည်, (ခ) စုစုပေါင်း ဝယ်လိုအား ကျစေခဲ့မည်, (ဂ) စုစုပေါင်း ရောင်းလိုအား ကျစေခဲ့မည်: (က) စုစုပေါင်း ဝယ်လိုအား တက်စေခဲ့မည်} ",
                    marks: 4
                },
                {
                    type: "Cloze",
                    instruction: "မေးခွန်းကို သေချာစွာဖတ်ရှုပြီး အဖြေမှန်ကို ရွေးချယ်ပါ။ (၄ မှတ်)", 
                    question: "အောက်တွင်ဖော်ပြထားသော ပုံသည် ဗြိတိန်နိုင်ငံ၏နိုင်ငံခြားငွေဈေးကွက်တွင် ဗြိတိန်သုံးငွေကြေးဖြစ်သောပေါင်အတွက် ဝယ်လိုအားနှင့် ရောင်းလိုအားတို့ကို ဖော်ပြထားသည်။ ဗြိတိန်နိုင်ငံမှ အမေရိကန်နိုင်ငံသို့ ပို့ကုန်တင်ပို့မှု တိုးတက်လာပါက ဗြိတိန်၏ နိုင်ငံခြားငွေဈေးကွက်အပေါ် မည်သို့အကျိုးသက်ရောက်မှုရှိသည်ကို အောက်ဖော်ပြပါပုံကိုအသုံးပြု၍ ရှင်းလင်းဖြေဆိုပါ။<br><img src=\"images/eco/eco_3_5.png\" \alt=\"image\" style=\"width: 100%\; height: auto\; \"><br>(က) ဗြိတိန်နိုင်ငံမှ အမေရိကန်နိုင်ငံသို့ ပို့ကုန်တင်ပို့မှုတိုးတက်လာပါက ဗြိတိန်၏ နိုင်ငံခြားငွေဈေးကွက်တွင် {1:dropdown: (က) ဗြိတိန်ပေါင်၏ ဝယ်လိုအားတိုးလာမည်။, (ခ) ဗြိတိန်ပေါင်၏ ဝယ်လိုအားကျသွားမည်။, (ဂ) ဗြိတိန်ပေါင်၏ ရောင်းလိုအားတိုးလာမည်။: (က) ဗြိတိန်ပေါင်၏ ဝယ်လိုအားတိုးလာမည်။} <br><br>(ခ) ဗြိတိန်နိုင်ငံမှ အမေရိကန်နိုင်ငံသို့ ပို့ကုန်တင်ပို့မှုတိုးတက်လာပါက {2:dropdown: (က) ဗြိတိန်ပေါင်၏ နိုင်ငံခြားငွေလဲလှယ်နှုန်း မပြောင်းလဲပေ။, (ခ) ဗြိတိန်ပေါင်၏ ငွေကြေးတန်ဖိုး ကျမည်။, (ဂ) ဗြိတိန်ပေါင်၏ ငွေကြေးတန်ဖိုး တက်မည်။: (ဂ) ဗြိတိန်ပေါင်၏ ငွေကြေးတန်ဖိုး တက်မည်။}<br><br>(ဂ) ဗြိတိန်နိုင်ငံမှ အမေရိကန်နိုင်ငံသို့ ပို့ကုန်တင်ပို့မှုတိုးတက်လာပါက {3:dropdown: (က) ပေါင်ဝယ်လိုအားမျဉ်းကွေး ဘယ်ဖက်သို့ရွေ့မည်။, (ခ) ပေါင်ဝယ်လိုအားမျဉ်းကွေး ညာဖက်သို့ရွေ့မည်။, (ဂ) ပေါင်ရောင်းလိုအားမျဉ်းကွေး ဘယ်ဖက်သို့ရွေ့မည်။: (ခ) ပေါင်ဝယ်လိုအားမျဉ်းကွေး ညာဖက်သို့ရွေ့မည်။}<br><br>(ဃ) ဗြိတိန်နိုင်ငံမှ အမေရိကန်နိုင်ငံသို့ ပို့ကုန်တင်ပို့မှုတိုးတက်လာပါက အမေရိကန်နိုင်ငံသားများအနေဖြင့် နိုင်ငံခြားငွေဈေးကွက်တွင် {4:dropdown: (က) ဗြိတိန်ပေါင်များကို ရောင်းချမည်။, (ခ) ငွေကြေးလဲလှယ်နှုန်း မတည်ငြိမ်မှုကို စိုးရိမ်သောကြောင့် အမေရိကန်ဒေါ်လာကို ကိုင်ထားမည်။, (ဂ) ဗြိတိန်ပေါင်ဝယ်ယူရန် နိုင်ငံခြားငွေဈေးကွက်တွင် အမေရိကန်ဒေါ်လာ ရောင်းလိုအားတိုးလာမည်။: (ဂ) ဗြိတိန်ပေါင်ဝယ်ယူရန် နိုင်ငံခြားငွေဈေးကွက်တွင် အမေရိကန်ဒေါ်လာ ရောင်းလိုအားတိုးလာမည်။} ",
                    marks: 4
                }
            ],
            count: 5
        }
    }
};

const overviews = {
    "Myanmar": {
        title: "မြန်မာစာဘာသာရပ် စမ်းသပ်အကဲဖြတ်ခြင်း (Sample Test)",
        text: `
            <h1>မြန်မာစာဘာသာရပ် စစ်ဆေးအကဲဖြတ်ခြင်းလမ်းညွှန်</h1>
            <br>
            <h2>စစ်ဆေးအကဲဖြတ်ခြင်းရည်ရွယ်ချက်</h2>
            <ul>
            <li>ကျောင်းသားကျောင်းသူများ အခြေခံပညာပြီးမြောက်၍ အဆင့်မြင့်ပညာနှင့် သက်မွေးပညာရပ်များ ဆက်လက်လေ့လာ သင်ကြားဆည်းပူးနိုင်စေရန် ရည်ရွယ်၍ စစ်ဆေးအကဲဖြတ်ခြင်းကို ကျင်းပပါသည်။</li>
            </ul>
            <br>
            <h2>သင်ရိုးညွှန်းတမ်း</h2>
            <ul>
            <li><strong>စနစ်သစ် ဒွါဒသမတန်း (Grade 12) သင်ရိုးညွှန်းတမ်းကို အခြေခံပါသည်။</strong></li>
            </ul>
            <br>
            <h2>မေးခွန်းအရေအတွက်</h2>
            <ul>
            <li>မေးခွန်းအားလုံးကို ဖြေဆိုရမည်။</li>
            </ul>
            <br>
            <h2>သတ်မှတ်ချိန်</h2>
            <ul>
            <li>ဖြေဆိုချိန် (၂) နာရီ ဖြစ်ပါသည်။</li>
            <li>မေးခွန်းကို စတင်ဖြေဆိုသည့်အချိန်မှစ၍ ဖြေဆိုချိန်ကို ရေတွက်ပါမည်။</li>
            <li>ဖြေဆိုချိန် (၂) နာရီပြည့်ပါက အလိုအလျောက် submit ပြုလုပ်သွားမည် ဖြစ်ပါသည်။ သို့သော် FINISH ATTEMPT ကို နှိပ်ရန် လိုအပ်ပါသည်။</li>
            <li>သို့ဖြစ်ပါ၍ ပေးထားသော အချိန်အတွင်း မေးခွန်းအားလုံးကို ပြီးဆုံးအောင် အစဉ်အတိုင်း တစ်ထိုင်တည်း ဖြေဆိုသွားရန် လိုအပ်ပါသည်။</li>
            </ul>
            <br>
            <h2>ဖြေဆိုသူ၏ ကတိကဝတ်</h2>
            <ul>
            <li>ကျွန်တော်/ကျွန်မတို့သည် ဤမေးခွန်းလွှာကို ဖြေဆိုသည်မှ ရရှိလာသော အမှတ်များကို လက်ခံသဘောတူပါသည်။</li>
            <li>ဖြေဆိုသည့် အဖြေအားလုံးသည် ကျွန်တော်/ကျွန်မတို့ တတ်မြောက်သည့်အတိုင်း ကိုယ်တိုင်ဖြေဆိုသည်ကို ကတိပြုပါသည်။</li>
            
            </ul>
        `,
        buttonText: "မြန်မာစာမေးခွန်းလွှာကို ဖြေရန်နှိပ်ပါ။\nOpened: Sunday, 13 April 2025, 12:04PM"
    },
    "English": {
        title: "အင်္ဂလိပ်စာ ဘာသာရပ် စစ်ဆေးအကဲဖြတ်ခြင်း (Sample Test)",
        text: ` <h2>Guidelines for Basic Education Completion Assessment</h2>
                <h2>English Subject</h2>
                <h2><br />Syllabus</h2>
                <ul>
                <li>English Text (Grade 12) (New System)</li>
                </ul>
                <p>&nbsp;</p>
                <h2>Number of questions</h2>
                <ul>
                <li>The candidate has to answer ALL questions.</li>
                <li>All questions are multiple choice questions, each of which has 4 choices. The candidate has to choose ONE BEST answer.</li>
                </ul>
                <p>&nbsp;</p>
                <h2>Time allowed</h2>
                <ul>
                <li>120 minutes</li>
                <li>no break time is given</li>
                <li>If the time allowed runs out, the quiz will be automatically submitted. But you must click FINISH ATTEMPT.</li>
                </ul>
                <p>&nbsp;</p>
                <h2>Candidate's declaration</h2>
                <p>By attempting this examination, I acknowledge that</p>
                <ul>
                <li>I have read and understand the examination conduct requirements for this examination .</li>
                <li>the work I submitted is a result of my own unaided effort.</li>
                <li>accept the result and marks in the answering of this examination.</li>
                </ul> 
            `,
        buttonText: "Click here to take English Test.\nOpened: Sunday, 13 April 2025, 12:04PM"
    },
    "Mathematics": {
        title: "သင်္ချာဘာသာရပ် စစ်ဆေးအကဲဖြတ်ခြင်း (Sample Test)",
        text: ` <h1>သင်္ချာဘာသာရပ် စစ်ဆေးအကဲဖြတ်ခြင်း လမ်းညွှန်</h1>
                <p>&nbsp;</p>
                <h2>စစ်ဆေးအကဲဖြတ်ခြင်းရည်ရွယ်ချက်</h2>
                <p>&nbsp;</p>
                <ul>
                <li>ကျောင်းသား၊ကျောင်းသူများ အခြေခံပညာပြီးမြောက်၍ အဆင့်မြင့်ပညာနှင့်သက်မွေးပညာရပ်များ ဆက်လက်လေ့လာ သင်ကြားဆည်းပူးနိုင်စေရန် ရည်ရွယ်၍ စစ်ဆေးအကဲဖြတ်ခြင်းကို ကျင်းပပါသည်။&nbsp;</li>
                </ul>
                <p>&nbsp;</p>
                <p>&nbsp;</p>
                <h2>သင်ရိုးညွှန်းတမ်း</h2>
                <p>&nbsp;</p>
                <ul>
                <li>စနစ်သစ် ဒွါဒသမတန်း (Grade 12) သင်ရိုးညွှန်းတမ်းကို အခြေခံပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>မေးခွန်းအရေအတွက်</h2>
                <ul>
                <li>မေးခွန်းအားလုံးဖြေဆိုရမည်ဖြစ်ပါသည်။</li>
                </ul>
                <p>ရွေးချယ်ဖြေဆိုရသော မေးခွန်းများ (Multiple choice questions) ဖြစ်ကြပါသည်။</p>
                <p>&nbsp;</p>
                <h2>သတ်မှတ်ချိန်</h2>
                <ul>
                <li>ဖြေဆိုချိန် (၂) နာရီ ဖြစ်ပါသည်။</li>
                <li>မေးခွန်းကို စတင်ဖြေဆိုသည့်အချိန်မှစ၍ ဖြေဆိုချိန်ကို ရေတွက်မည်ဖြစ်ပါသည်။</li>
                <li>ဖြေဆိုချိန် (၂) နာရီ ပြည့်ပါက အလိုအလျောက် submit ပြုလုပ်သွားမည်ဖြစ်ပါသည်။ သို့သော် FINISH ATTEMPT ကိုနှိပ်ရန် လိုအပ်ပါသည်။</li>
                <li>သို့ဖြစ်ပါ၍ ပေးထားသော အချိန်အတွင်း မေးခွန်းအားလုံးကို ပြီးဆုံးအောင် အစဉ်အတိုင်း တစ်ထိုင်တည်း ဖြေဆိုသွားရန် လိုအပ်ပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <p>&nbsp;</p>
                <h2>ဖြေဆိုသူ၏ ကတိကဝတ်</h2>
                <ul>
                <li>ကျွန်တော်/ကျွန်မတို့သည် ဤမေးခွန်းလွှာကို ဖြေဆိုသည်မှ ရရှိလာသော အမှတ်များကို လက်ခံသဘောတူပါသည်။</li>
                <li>ဖြေဆိုသည့် အဖြေများအားလုံးသည် ကျွန်တော်/ကျွန်မတို့၏ တတ်မြောက်သည့်အတိုင်း ကိုယ်တိုင်ဖြေဆိုသည်ကို ကတိပြုပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <p><strong>သင်္ချာမေးခွန်းများကို ဖြေဆိုရာ၌ ပေးထားသောဖြေဆိုပုံစံအတိုင်း အဆင့်လိုက် </strong><strong>စဉ်းစား တွက်ချက်၍ အဖြေမှန်ရွေးချယ်ရမည်။</strong></p>
            `,
            buttonText: "Click here to take Mathematics Test.\nOpened: Sunday, 13 April 2025, 12:04PM"
        },
    "Chemistry": {
            title: "ဓာတုဗေဒဘာသာရပ် စစ်ဆေးအကဲဖြတ်ခြင်း(Sample Test)",
            text: `<h1>ဓာတုဗေဒဘာသာရပ်&nbsp;စစ်ဆေးအကဲဖြတ်ခြင်းလမ်းညွှန်</h1>
                    <p>&nbsp;</p>
                    <p>&nbsp;</p>
                    <h2>စစ်ဆေးအကဲဖြတ်ခြင်းရည်ရွယ်ချက်</h2>
                    <ul>
                    <li>ကျောင်းသားကျောင်းသူများ အခြေခံပညာပြီးမြောက်၍ အဆင့်မြင့်ပညာနှင့် သက်မွေးပညာရပ်များ ဆက်လက်လေ့လာ သင်ကြားဆည်းပူးနိုင်စေရန် ရည်ရွယ်၍ စစ်ဆေးအကဲဖြတ်ခြင်းကို ကျင်းပပါသည်။</li>
                    </ul>
                    <p>&nbsp;</p>
                    <h2>သင်ရိုးညွှန်းတမ်း</h2>
                    <ul>
                    <li>စနစ်သစ် ဒွါဒသမတန်း (Grade 12) သင်ရိုးညွှန်းတမ်းကို အခြေခံပါသည်။</li>
                    </ul>
                    <p>&nbsp;</p>
                    <h2>မေးခွန်းအရေအတွက်</h2>
                    <ul>
                    <li>မေးခွန်းအားလုံးကို ဖြေဆိုရမည်။</li>
                    <li>Section A တစ်မှတ်တန် အပုဒ် (၆၀)</li>
                    <li>Section B ၂ မှတ်တန် အပုဒ် (၂၀)</li>
                    </ul>
                    <p>&nbsp;</p>
                    <h2>သတ်မှတ်ချိန်</h2>
                    <ul>
                    <li>ဖြေဆိုချိန် (၂) နာရီ ဖြစ်ပါသည်။</li>
                    <li>မေးခွန်းကို စတင်ဖြေဆိုသည့်အချိန်မှစ၍ ဖြေဆိုချိန်ကို ရေတွက်ပါမည်။</li>
                    <li>ဖြေဆိုချိန် (၂) နာရီပြည့်ပါက အလိုအလျောက် submit ပြုလုပ်သွားမည် ဖြစ်ပါသည်။ သို့သော် FINISH ATTEMPT ကို နှိပ်ရန် လိုအပ်ပါသည်။</li>
                    <li>သို့ဖြစ်ပါ၍ ပေးထားသော အချိန်အတွင်း မေးခွန်းအားလုံးကို ပြီးဆုံးအောင် အစဉ်အတိုင်း တစ်ထိုင်တည်း ဖြေဆိုသွားရန် လိုအပ်ပါသည်။</li>
                    </ul>
                    <p>&nbsp;</p>
                    <h2>ဖြေဆိုသူ၏ ကတိကဝတ်</h2>
                    <ul>
                    <li>ကျွန်တော်/ကျွန်မတို့သည် ဤမေးခွန်းလွှာကို ဖြေဆိုသည်မှ ရရှိလာသော အမှတ်များကို လက်ခံသဘောတူပါသည်။</li>
                    <li>ဖြေဆိုသည့် အဖြေအားလုံးသည် ကျွန်တော်/ကျွန်မတို့ တတ်မြောက်သည့်အတိုင်း ကိုယ်တိုင်ဖြေဆိုသည်ကို ကတိပြုပါသည်။</li>
                    </ul>
                `,
        buttonText: "Click here to take Chemistry Test.\nOpened: Sunday, 13 April 2025, 12:04PM"
    },
    "Physics": {
        title: "ရူပဗေဒဘာသာရပ်စစ်ဆေးအကဲဖြတ်ခြင်း (Sample Test)",
        text: `<h1>ရူပဗေဒဘာသာရပ်စစ်ဆေးအကဲဖြတ်ခြင်းလမ်းညွှန်</h1>
<p>&nbsp;</p>
<h2>စစ်ဆေးအကဲဖြတ်ခြင်းရည်ရွယ်ချက်</h2>
<ul>
<li>ကျောင်းသား၊ကျောင်းသူများ အခြေခံပညာပြီးမြောက်၍ အဆင့်မြင့်ပညာနှင့်သက်မွေးပညာရပ်များ ဆက်လက်လေ့လာ သင်ကြားဆည်းပူးနိုင်စေရန် ရည်ရွယ်၍ စစ်ဆေးအကဲဖြတ်ခြင်းကို ကျင်းပပါသည်။&nbsp;&nbsp;</li>
</ul>
<p>&nbsp;</p>
<h2>သင်ရိုးညွှန်းတမ်း</h2>
<ul>
<li>စနစ်သစ် ဒွါဒသမတန်း (Grade 12) သင်ရိုးညွှန်းတမ်းကို အခြေခံပါသည်။</li>
</ul>
<p>&nbsp;</p>
<h2>မေးခွန်းအရေအတွက်</h2>
<ul>
<li>မေးခွန်းအားလုံးဖြေဆိုရမည် ဖြစ်ပါသည်။
</li>
<li>မေးခွန်းများတွင် အဖြေ(၄)ခုပေးထားပြီး အသင့်တော်ဆုံးအဖြေမှန်တစ်ခုကိုသာ ရွေးချယ်(Click)ဖြေဆိုရသော မေးခွန်းများ (Multiple choice questions) ဖြစ်ကြပါသည်။</li>
</ul>
<p>&nbsp;</p>
<h2>သတ်မှတ်ချိန်</h2>
<ul>
<li>ဖြေဆိုချိန် (၂း၀၀) နာရီ ဖြစ်ပါသည်။</li>
<li>မေးခွန်းကို စတင်ဖြေဆိုသည့်အချိန်မှစ၍ ဖြေဆိုချိန်ကို ရေတွက်မည်ဖြစ်ပါသည်။</li>
<li>မေးခွန်းများ ဖြေဆိုနေစဥ် နားချိန်များပေးမထားပါ။</li>
<li>ဖြေဆိုချိန် (၂း၀၀) နာရီ ပြည့်ပါက အလိုအလျောက် Submit ပြုလုပ်သွားမည်ဖြစ်ပါသည်။ သို့သော် FINISH ATTEMPT ကိုနှိပ်ရန် လိုအပ်ပါသည်။</li>
<li>သို့ဖြစ်ပါ၍ ပေးထားသော အချိန်အတွင်း မေးခွန်းအားလုံးကို ပြီးဆုံးအောင် အစဉ်အတိုင်း တစ်ထိုင်တည်း ဖြေဆိုသွားရန် လိုအပ်ပါသည်။</li>
</ul>
<p>&nbsp;</p>
<h2>ဖြေဆိုသူ၏ ကတိကဝတ်</h2>
<ul>
<li>ကျွန်တော်/ကျွန်မတို့သည် ဤမေးခွန်းလွှာကို ဖြေဆိုသည်မှ ရရှိလာသော အမှတ်များကို လက်ခံသဘောတူပါသည်။</li>
<li>ဖြေဆိုသည့် အဖြေများအားလုံးသည် ကျွန်တော်/ကျွန်မတို့၏ တတ်မြောက်သည့်အတိုင်း ကိုယ်တိုင်ဖြေဆိုသည်ဟု ကတိပြုပါသည်။</li>
</ul>`,
        buttonText: "Click here to take Physics Test.\nOpened: Sunday, 13 April 2025, 12:04PM"
    },
    "Biology": {
        title: "ဇီဝဗေဒဘာသာရပ်စစ်ဆေးအကဲဖြတ်ခြင်း (Sample Test)",
        text: `<h1>ဇီဝဗေဒဘာသာရပ်စစ်ဆေးအကဲဖြတ်ခြင်း လမ်းညွှန်</h1>
                <p>&nbsp;</p>
                <h2>စစ်ဆေးအကဲဖြတ်ခြင်းရည်ရွယ်ချက်</h2>
                <ul>
                <li>ကျောင်းသား၊ကျောင်းသူများ အခြေခံပညာပြီးမြောက်၍ အဆင့်မြင့်ပညာနှင့်သက်မွေးပညာရပ်များ ဆက်လက်လေ့လာ သင်ကြားဆည်းပူးနိုင်စေရန် ရည်ရွယ်၍ စစ်ဆေးအကဲဖြတ်ခြင်းကို ကျင်းပပါသည်။&nbsp;&nbsp;</li>
                </ul>
                <p>&nbsp;</p>
                <h2>သင်ရိုးညွှန်းတမ်း</h2>
                <ul>
                <li>စနစ်သစ် ဒွါဒသမတန်း (Grade 12) သင်ရိုးညွှန်းတမ်းကို အခြေခံပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>မေးခွန်းအရေအတွက်</h2>
                <ul>
                <li>မေးခွန်းအားလုံးဖြေဆိုရမည်ဖြစ်ပါသည်။</li>
                <li>ရွေးချယ်ဖြေဆိုရသော မေးခွန်းများ (Multiple choice questions) ဖြစ်ကြပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>သတ်မှတ်ချိန်</h2>
                <ul>
                <li>ဖြေဆိုချိန် (၂) နာရီ ဖြစ်ပါသည်။</li>
                <li>မေးခွန်းကို စတင်ဖြေဆိုသည့်အချိန်မှစ၍ ဖြေဆိုချိန်ကို ရေတွက်မည်ဖြစ်ပါသည်။</li>
                <li>ဖြေဆိုချိန် (၂) နာရီ ပြည့်ပါက အလိုအလျောက် submit ပြုလုပ်သွားမည်ဖြစ်ပါသည်။ သို့သော် FINISH ATTEMPT ကိုနှိပ်ရန် လိုအပ်ပါသည်။</li>
                <li>သို့ဖြစ်ပါ၍ ပေးထားသော အချိန်အတွင်း မေးခွန်းအားလုံးကို ပြီးဆုံးအောင် အစဉ်အတိုင်း တစ်ထိုင်တည်း ဖြေဆိုသွားရန် လိုအပ်ပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>ဖြေဆိုသူ၏ ကတိကဝတ်</h2>
                <ul>
                <li>ကျွန်တော်/ကျွန်မတို့သည် ဤမေးခွန်းလွှာကို ဖြေဆိုသည်မှ ရရှိလာသော အမှတ်များကို လက်ခံသဘောတူပါသည်။</li>
                <li>ဖြေဆိုသည့် အဖြေများအားလုံးသည် ကျွန်တော်/ကျွန်မတို့၏ တတ်မြောက်သည့်အတိုင်း ကိုယ်တိုင်ဖြေဆိုသည်ကို ကတိပြုပါသည်။</li>
                </ul> 
            `,
        buttonText: "Click here to take Biology Test.\nOpened: Sunday, 13 April 2025, 12:04PM"
    },
    "Economics": {
        title: "ဘောဂဗေဒဘာသာရပ် စစ်ဆေးအကဲဖြတ်ခြင်း (Sample Test)",
        text: `<h1>ဘောဂဗေဒဘာသာရပ်&nbsp;စစ်ဆေးအကဲဖြတ်ခြင်းလမ်းညွှန်</h1>
                <p>&nbsp;</p>
                <h2>စစ်ဆေးအကဲဖြတ်ခြင်းရည်ရွယ်ချက်</h2>
                <ul>
                <li>ကျောင်းသားကျောင်းသူများ အခြေခံပညာပြီးမြောက်၍ အဆင့်မြင့်ပညာနှင့် သက်မွေးပညာရပ်များ ဆက်လက်လေ့လာ သင်ကြားဆည်းပူးနိုင်စေရန် ရည်ရွယ်၍ စစ်ဆေးအကဲဖြတ်ခြင်းကို ကျင်းပပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>သင်ရိုးညွှန်းတမ်း</h2>
                <ul>
                <li>စနစ်သစ် ဒွါဒသမတန်း (Grade 12) သင်ရိုးညွှန်းတမ်းကို အခြေခံပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>မေးခွန်းအရေအတွက်</h2>
                <ul>
                <li>မေးခွန်းအားလုံးကို ဖြေဆိုရမည်။</li>
                <li>မေးခွန်း နံပါတ် ၁ တွင် ရွေးချယ်ဖြေဆိုရသော မေးခွန်းအမျိုးအစား (Multiple choice Question) ဖြစ်သည်။
                <ul>
                <li>၁ မှတ်တန် မေးခွန်းအပုဒ် (၆၀) မေးခွန်း</li>
                <li>နံပါတ် ၂ တွင် ဆီလျော်ရာ ယှဉ်တွဲဖြေဆိုခြင်း ၅ မှတ်တန် (၆) ပုဒ်</li>
                <li>မေးခွန်း နံပါတ် ၃ တွင် တွက်ချက်သုံးသပ်၍ရွေးချယ်ဖြေဆိုခြင်း ၁၀မှတ်တန် (၁) ပုဒ်</li>
                </ul>
                </li>
                </ul>
                <p>&nbsp;</p>
                <h2>သတ်မှတ်ချိန်</h2>
                <ul>
                <li>ဖြေဆိုချိန် (၂) နာရီ ဖြစ်ပါသည်။</li>
                <li>မေးခွန်းကို စတင်ဖြေဆိုသည့်အချိန်မှစ၍ ဖြေဆိုချိန်ကို ရေတွက်ပါမည်။</li>
                <li>ဖြေဆိုချိန် (၂) နာရီပြည့်ပါက အလိုအလျောက် submit ပြုလုပ်သွားမည် ဖြစ်ပါသည်။ သို့သော် FINISH ATTEMPT ကို နှိပ်ရန် လိုအပ်ပါသည်။</li>
                <li>သို့ဖြစ်ပါ၍ ပေးထားသော အချိန်အတွင်း မေးခွန်းအားလုံးကို ပြီးဆုံးအောင် အစဉ်အတိုင်း တစ်ထိုင်တည်း ဖြေဆိုသွားရန် လိုအပ်ပါသည်။</li>
                </ul>
                <p>&nbsp;</p>
                <h2>ဖြေဆိုသူ၏ ကတိကဝတ်</h2>
                <ul>
                <li>ကျွန်တော်/ကျွန်မတို့သည် ဤမေးခွန်းလွှာကို ဖြေဆိုသည်မှ ရရှိလာသော အမှတ်များကို လက်ခံသဘောတူပါသည်။</li>
                <li>ဖြေဆိုသည့် အဖြေအားလုံးသည် ကျွန်တော်/ကျွန်မတို့ တတ်မြောက်သည့်အတိုင်း ကိုယ်တိုင်ဖြေဆိုသည်ကို ကတိပြုပါသည်။</li>
                </ul>
            `,
        buttonText: "ဘောဂဗေဒဘာသာရပ် မေးခွန်းလွှာကို ဖြေရန်နှိပ်ပါ။\nOpened: Sunday, 13 April 2025, 12:04PM"
    },
    // Add for each subject...
};

let quizQuestions = [];
let userAnswers = [];
let currentQuestionIndex = 0;
let timeLeft = 7200; // Default: 2 hours in seconds
let timerInterval;
let startTime;
let currentSubject;
let audioPlayCount = 0;
let isPlaying = false;
var quizSubmitted = false;
let shuffleEnabled = true;
let shuffleChoiceEnabled = true;

function startQuiz(subject) {
    currentSubject = subject;
    const pools = questionPools[subject];
    if (!pools) {
        showPopup("Subject not implemented. <br>Coming soon ...");
        return;
    }else {
        confirmDialog(subject);
    }
   // startTime = Date.now();
   // loadQuizData(subject);
   // update the timer
   updateNativeTimerByScreen();
}
window.startQuiz = startQuiz;


function loadQuizData(subject) {
    updateShuffleState(); // Get the latest value before proceeding

    const pools = questionPools[subject];
    quizQuestions = [];
    for (const poolName in pools) {
        const pool = pools[poolName];
        const questions = shuffleEnabled ? shuffleArray([...pool.questions]) : pool.questions;
        const selectedQuestions = questions.slice(0, pool.count);
        quizQuestions = quizQuestions.concat(selectedQuestions);
    }

    userAnswers = new Array(quizQuestions.length).fill(null);
    currentQuestionIndex = 0;
    startTimer();
    showQuizScreen();
    displayQuestion(currentQuestionIndex);
    updateDrawer();
}
window.loadQuizData = loadQuizData;

function shuffleArray(array) {
    return array.sort(() => Math.random() - 0.5);
}
window.shuffleArray = shuffleArray;

function toggleDrawer() {
    const drawer = document.getElementById('drawer');
    const closeDrawer = document.getElementById('close-drawer');
    const hamburger = document.getElementById('hamburger');

    // Determine current state using computed style
    const isOpen = parseInt(window.getComputedStyle(drawer).right, 10) === 0;

    if (isOpen) {
        // CLOSE drawer
        drawer.style.right = "-210px";
        closeDrawer.style.display = "none";
        hamburger.style.display = "block";
    } else {
        // OPEN drawer
        drawer.style.right = "0px";
        closeDrawer.style.display = "block";
        hamburger.style.display = "none";
    }
}
window.toggleDrawer = toggleDrawer;


function toggleReviewDrawer() {
    const drawer = document.getElementById('review-drawer');
    const closeDrawer = document.getElementById('review-close-drawer');
    const hamburger = document.getElementById('review-hamburger');

    const isOpen = parseInt(window.getComputedStyle(drawer).right, 10) === 0;

    if (isOpen) {
        drawer.style.right = "-210px";
        closeDrawer.style.display = "none";
        hamburger.style.display = "block";
    } else {
        drawer.style.right = "0px";
        closeDrawer.style.display = "block";
        hamburger.style.display = "none";
    }
}
window.toggleReviewDrawer =toggleReviewDrawer; 

function toggleDrawerButton() {
    const drawer = document.getElementById('drawer');
    const closeDrawer = document.getElementById('close-drawer');
    const openDrawer = document.getElementById('hamburger');

    // Use computed style to get the actual rendered value
    const right = parseInt(window.getComputedStyle(drawer).right, 10);

    if (right === 0) {
        closeDrawer.style.display = "block";
        openDrawer.style.display = "none";
    } else {
        closeDrawer.style.display = "none";
        openDrawer.style.display = "block";
    }
}
window.toggleDrawerButton = toggleDrawerButton;

function toggleReviewDrawerButton() {
    const drawer = document.getElementById('review-drawer');
    const closeDrawer = document.getElementById('review-close-drawer');
    const openDrawer = document.getElementById('review-hamburger');

    const right = parseInt(window.getComputedStyle(drawer).right, 10);

    if (right === 0) {
        closeDrawer.style.display = "block";
        openDrawer.style.display = "none";
    } else {
        closeDrawer.style.display = "none";
        openDrawer.style.display = "block";
    }
}

window.toggleReviewDrawerButton = toggleReviewDrawerButton;

function showQuizScreen() {
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'block';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showQuizScreen = showQuizScreen;


function displayQuestion(index) {
    updateShuffleChoiceState();
    const q = quizQuestions[index];
    let isAnswered = userAnswers[index] && (Array.isArray(userAnswers[index]) ? userAnswers[index].length > 0 : userAnswers[index] !== "");
    
    let html = `
        <div class="question-header">
            <p class="no-zoom"><strong>Question ${index + 1}</strong></p>
        </div>
    `;

    // Render question based on type

    if (q.type === 'TF') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        html += `<h2>${q.question}</h2>`;
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls controlsList="nodownload">
                        <source src="${q.audio}" type="audio/mpeg">
                        Your device does not support the audio element.
                    </audio>
                </div>
                `;
        }
        html += q.choices.map(choice => `
            <div class="choice">
                <label><input type="radio" name="answer_${index}" value="${choice}" 
                ${userAnswers[index] === choice ? 'checked' : ''} 
                onchange="saveAnswer(${index}, this)"> ${choice}</label>
            </div>
        `).join('');
    } else if (q.type === 'Information') {
        html += `<h1>${q.section}</h1>`;
        html += `<h2>${q.instruction}</h2>`;
    }else if (q.type === 'MCQ') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        html += `<h2>${q.question}</h2>`;
    
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
    
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
            `;
        }
    
        const inputType = q.multiple ? 'checkbox' : 'radio';
        let choices = q.choices;
    
        if (shuffleChoiceEnabled) {
            choices = shuffleChoiceArray([...choices]); // Shuffle a copy
        }
    
        html += choices.map((choice, i) => {
            const choiceValue = choice.text || choice;
            const isChecked = q.multiple 
                ? (userAnswers[index] && userAnswers[index].includes(choiceValue)) 
                : (userAnswers[index] === choiceValue);
            return `
                <div class="choice">
                    <label>
                        <input type="${inputType}" name="answer_${index}" value="${choiceValue}" 
                        ${isChecked ? 'checked' : ''} 
                        onchange="saveAnswer(${index}, this)"> ${choiceValue}
                        ${choice.image ? `<img src="${choice.image}" alt="${choice.text}"
                            class="choice-image">` : ''}
                    </label>
                </div>
            `;
        }).join('');
    } else if (q.type === 'MWQ') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
                `;
        }
        let mwqContent = '';
        let parts = q.question.split(/\[(\d+)\]/);
        mwqContent += parts.map((part, i) => {
            if (i % 2 === 1) {
                let blank = q.blanks.find(b => b.position == part);
                const blankIndex = parseInt(part) - 1;
                const selectedValue = userAnswers[index]?.[blankIndex] || '';
                const displayValue = selectedValue.replace(/^\$|\$/g, '');
                if (currentSubject === 'Mathematics') {
                    return `
                    <div class="mwq-dropdown" data-blank-index="${blankIndex}">
                        <div class="mwq-selected" onclick="toggleMWQDropdown(${index}, ${blankIndex})">
                            <span class="mwq-selected-text">${displayValue ? `\\(${displayValue}\\)` : 'Select'}</span>
                        </div>
                        <div class="mwq-options" id="mwq-options_${index}_${blankIndex}" style="display: none;">
                            <div class="mwq-option" onclick="selectMWQOption(${index}, ${blankIndex}, '')">Select</div>
                            ${blank.options.map(opt => {
                                const cleanOpt = opt.replace(/^\$|\$/g, '');
                                return `
                                    <div class="mwq-option" onclick="selectMWQOption(${index}, ${blankIndex}, '${opt}')">
                                        \\(${cleanOpt}\\)
                                    </div>
                                `;
                            }).join('')}
                        </div>
                    </div>
                    `;
                } else {
                    return `
                    <div class="mwq-dropdown" data-blank-index="${blankIndex}">
                        <div class="mwq-selected" onclick="toggleMWQDropdown(${index}, ${blankIndex})">
                            <span class="mwq-selected-text">${displayValue ? `${displayValue}` : 'Select'}</span>
                        </div>
                        <div class="mwq-options" id="mwq-options_${index}_${blankIndex}" style="display: none;">
                            <div class="mwq-option" onclick="selectMWQOption(${index}, ${blankIndex}, '')">Select</div>
                            ${blank.options.map(opt => {
                                const cleanOpt = opt.replace(/^\$|\$/g, '');
                                return `
                                    <div class="mwq-option" onclick="selectMWQOption(${index}, ${blankIndex}, '${opt}')">
                                        ${cleanOpt}
                                    </div>
                                `;
                            }).join('')}
                        </div>
                    </div>
                    `;
                }
            }
            return part;
        }).join('');
        html += `<div class="mwq-question">${mwqContent}</div>`;
    } else if (q.type === 'ParagraphMCQ') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
                `;
        }
        html += `<div class="paragraph">${q.paragraph}</div>`;
        q.questions.forEach((subQ, subIndex) => {
            html += `<div class="sub-question">
                <p>${subQ.question}</p>
                ${subQ.choices.map((choice, i) => `
                    <div class="choice">
                        <label><input type="radio" name="answer_${subIndex}" value="${choice}"
                        ${userAnswers[index]?.[subIndex] === choice ? 'checked' : ''} 
                        onchange="saveAnswer(${index}, this, ${subIndex})"> ${choice}</label>
                    </div>
                `).join('')}
            </div>`;
        });
    } else if (q.type === 'Matching') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        html += `<h2>${q.question}</h2>`;
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
                `;
        }
        html += '<div class="matching-question">';
        q.leftItems.forEach((left, i) => {
            const userAnswer = userAnswers[index]?.[i]; // <-- FIXED
        
            html += `
                <div class="matching-pair">
                    <span>${left}</span>
                    <select onchange="saveAnswer(${index}, this, ${i})">
                        <option value="">Select</option>
                        ${q.rightItems.map((right, j) => `
                            <option value="${j}" ${userAnswer === j ? 'selected' : ''}>${right}</option>
                        `).join('')}
                    </select>
                </div>
            `;
        });
        html += '</div>';
    }else if (q.type === 'Cloze') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        
        
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls controlsList="nodownload">
                        <source src="${q.audio}" type="audio/mpeg">
                        Your device does not support the audio element.
                    </audio>
                </div>
            `;
        }
        
        // Wrap Cloze content in a div for consistency and clarity
        let clozeContent = '<div class="cloze-question">';
        let parts = q.question.split(/\{(\d+):([^:]+):([^}]+)\}/g);
        let htmlParts = [];
        let inputIndex = 0;
        for (let i = 0; i < parts.length; i++) {
            if (i % 4 === 0) {
                htmlParts.push(parts[i]);
            } else if (i % 4 === 1) {
                // Skip the position number
                continue;
            } else if (i % 4 === 2) {
                const type = parts[i];
                const optionsAndAnswer = parts[i + 1];
                let options = [];
                let correctAnswer = '';
                if (type === 'text') {
                    correctAnswer = optionsAndAnswer;
                    const userAnswer = userAnswers[index]?.[inputIndex] || '';
                    htmlParts.push(`<input type="text" class="cloze-input" data-input-index="${inputIndex}" value="${userAnswer}" onchange="saveAnswer(${index}, this, ${inputIndex})">`);
                } else if (type === 'dropdown') {
                    const [optionsString, answer] = optionsAndAnswer.split(':');
                    options = optionsString.split(',');
                    correctAnswer = answer;
                    const userAnswer = userAnswers[index]?.[inputIndex] || '';
                    let dropdownOptions = `<option value="">Select</option>`;
                    dropdownOptions += options.map(opt => `<option value="${opt}" ${userAnswer === opt ? 'selected' : ''}>${opt}</option>`).join('');
                    htmlParts.push(`<select class="cloze-dropdown" data-input-index="${inputIndex}" onchange="saveAnswer(${index}, this, ${inputIndex})">${dropdownOptions}</select>`);
                }
                inputIndex++;
                i++; // Skip the optionsAndAnswer part since we’ve processed it
            }
        }
        clozeContent += htmlParts.join('') + '</div>';
        html += clozeContent;
    }
    
    // Update the question container
    const questionContainer = document.getElementById('question-container');
    questionContainer.innerHTML = html;

    // Apply specific font size for MWQ questions
    if (q.type === 'MWQ') {
        const mwqElement = questionContainer.querySelector('.mwq-question');
        if (mwqElement) {
            mwqElement.style.fontSize = '18px';
        }
    }

    // Render MathJax for MWQ and Mathematics questions
    if ((currentSubject === 'Mathematics'||'Chemistry'||'Physics'||'Biology'||'Economics') && typeof MathJax !== 'undefined') {
        MathJax.typesetPromise([questionContainer])
            .catch(err => console.log('MathJax typesetting error:', err));
    }

    // Apply the Pyidaungsu font and font size for Myanmar subject
    if (currentSubject === 'Myanmar'||'Economics') {
        questionContainer.classList.add('myanmar-font');
        questionContainer.style.fontSize = '16px';
    } else {
        questionContainer.classList.remove('myanmar-font');
        questionContainer.style.fontSize = '18px';
    }

    // Toggle navigation button visibility
    const prevBtn = document.getElementById('prev-btn');
    const nextBtn = document.getElementById('next-btn');
    const submitBtn = document.getElementById('submit-btn');
    prevBtn.style.visibility = index === 0 ? 'hidden' : 'visible';
    nextBtn.style.display = index === quizQuestions.length - 1 ? 'none' : 'inline-block';
    submitBtn.style.display = index === quizQuestions.length - 1 ? 'inline-block' : 'none';

    toggleDrawerButton();
}
window.displayQuestion = displayQuestion;


function toggleDropdown(element) {
    const options = element.nextElementSibling;
    const allOptions = document.querySelectorAll('.dropdown-options');

    allOptions.forEach(opt => {
        if (opt !== options) opt.style.display = 'none';
    });

    options.style.display = options.style.display === 'block' ? 'none' : 'block';
}
window.toggleDropdown=toggleDropdown;

function toggleMWQDropdown(questionIndex, blankIndex) {
    const optionsDiv = document.getElementById(`mwq-options_${questionIndex}_${blankIndex}`);
    optionsDiv.style.display = optionsDiv.style.display === 'block' ? 'none' : 'block';
}
window.toggleMWQDropdown = toggleMWQDropdown;


function selectMWQOption(questionIndex, blankIndex, value) {
    const selectedDiv = document.querySelector(`#question-container .mwq-dropdown[data-blank-index="${blankIndex}"] .mwq-selected-text`);
    if (currentSubject === 'Mathematics') {
        if (selectedDiv) {
            const cleanValue = value.replace(/^\$|\$/g, '');
            selectedDiv.textContent = cleanValue ? `\\(${cleanValue}\\)` : 'Select';
            userAnswers[questionIndex] = userAnswers[questionIndex] || [];
            userAnswers[questionIndex][blankIndex] = value;
            MathJax.typesetPromise([selectedDiv])
                .catch(err => console.log('MathJax typesetting error:', err));
            updateDrawer();
            updateClearChoicesVisibility(questionIndex);
        }
    } else {
        if (selectedDiv) {
            const cleanValue = value.replace(/^\$|\$/g, '');
            selectedDiv.textContent = cleanValue ? `${cleanValue}` : 'Select';
            userAnswers[questionIndex] = userAnswers[questionIndex] || [];
            userAnswers[questionIndex][blankIndex] = value;
            MathJax.typesetPromise([selectedDiv])
                .catch(err => console.log('MathJax typesetting error:', err));
            updateDrawer();
            updateClearChoicesVisibility(questionIndex);
        }
    }
    toggleMWQDropdown(questionIndex, blankIndex);
}
window.selectMWQOption = selectMWQOption;


function saveAnswer(index, element, subIndex = null) {
    const q = quizQuestions[index];
    if (q.type === 'TF') {
        if (!element || typeof element.value === 'undefined') {
            console.error(`saveAnswer: Invalid element for Q${index}`, element);
            return;
        }
        userAnswers[index] = element.value;
        console.log(`TF Answer Saved for Q${index}: ${userAnswers[index]}`);
    } else if (q.type === 'MCQ') {
        if (q.multiple) {
            userAnswers[index] = userAnswers[index] || [];
            const value = element.value;
            if (element.checked) {
                if (!userAnswers[index].includes(value)) {
                    userAnswers[index].push(value);
                }
            } else {
                userAnswers[index] = userAnswers[index].filter(a => a !== value);
            }
            console.log(`MCQ Multiple Answer Saved for Q${index}: ${JSON.stringify(userAnswers[index])}`);
        } else {
            userAnswers[index] = element.value;
            console.log(`MCQ Single Answer Saved for Q${index}: ${userAnswers[index]}`);
        }
    } else if (q.type === 'MWQ') {
        // Handled by selectMWQOption
    } else if (q.type === 'ParagraphMCQ') {
        userAnswers[index] = userAnswers[index] || Array(q.questions.length).fill('');
        userAnswers[index][subIndex] = element.value;
    } else if (q.type === 'SA') {
        userAnswers[index] = element.value;
    } else if (q.type === 'Matching') {
        userAnswers[index] = userAnswers[index] || Array(q.leftItems.length).fill(null);
        userAnswers[index][subIndex] = parseInt(element.value);  // ← FIXED
    }
     else if (q.type === 'Cloze') {
        userAnswers[index] = userAnswers[index] || [];
        userAnswers[index][subIndex] = element.value;
    }
    updateDrawer();
    updateClearChoicesVisibility(index);
}
window.saveAnswer = saveAnswer;

function updateClearChoicesVisibility(index) {
    let clearChoices = document.getElementById('clear-choices');
    let hasSelection = false;

    if (quizQuestions[index].type === 'TF' || quizQuestions[index].type === 'MCQ') {
        let checkedInputs = document.querySelectorAll(`input[name="answer_${index}"]:checked`);
        hasSelection = checkedInputs.length > 0;
    } else if (quizQuestions[index].type === 'MWQ') {
        hasSelection = userAnswers[index] && userAnswers[index].some(val => val !== "Select");
    } else if (quizQuestions[index].type === 'SA' || quizQuestions[index].type === 'Essay') {
        hasSelection = userAnswers[index] && userAnswers[index].trim() !== "";
    } else if (quizQuestions[index].type === 'Matching') {
        hasSelection = userAnswers[index] && userAnswers[index].some(val => val !== null && val !== "");
    } else if (quizQuestions[index].type === 'Cloze') {
        hasSelection = userAnswers[index] && userAnswers[index].some(val => val !== "");
    } 

    if (hasSelection) {
        clearChoices.style.display = 'block';
        clearChoices.onclick = () => clearAnswer(index);
    } else {
        clearChoices.style.display = 'none';
    }
}
window.updateClearChoicesVisibility =updateClearChoicesVisibility;

function clearAnswer(index) {
    userAnswers[index] = null;
    displayQuestion(index);
    updateDrawer();
}
window.clearAnswer = clearAnswer;

function updateDrawer() {
    let drawerItems = document.getElementById('drawer-items');
    if (!drawerItems) return;

    let html = quizQuestions.map((question, i) => {
        let userAnswer = userAnswers[i] ?? null;
        let expectedLength = question.type === 'MWQ' ? question.blanks.length : 
                           (question.type === 'ParagraphMCQ' ? question.questions.length : 
                           (question.type === 'Matching' ? question.leftItems.length :
                           (question.type === 'Cloze' ? (question.question.match(/\{(\d+):/g) || []).length :
                           (Array.isArray(question.answer) ? question.answer.length : 1))));

        let answered = false;
        let partiallyAnswered = false;

        if (question.type === 'MWQ' || question.type === 'ParagraphMCQ' || question.type === 'Matching' || question.type === 'Cloze') {
            if (userAnswer && Array.isArray(userAnswer)) {
                let filledCount = userAnswer.filter(val => val !== "" && val !== null && val !== undefined).length;
                answered = filledCount === expectedLength;
                partiallyAnswered = filledCount > 0 && filledCount < expectedLength;
            }
        } else if (question.type === 'MCQ') {
            if (question.multiple) { 
                // Multiple-Answer MCQ
                if (userAnswer && Array.isArray(userAnswer)) {
                    let selectedCount = userAnswer.length;
                    answered = selectedCount === expectedLength;
                    partiallyAnswered = selectedCount > 0 && selectedCount < expectedLength;
                }
            } else {
                //Single-Answer MCQ
                answered = userAnswer !== null && userAnswer !== "";
                partiallyAnswered = false;
            }
        } else if (question.type === 'TF') {
            answered = userAnswer === 'TRUE' || userAnswer === 'FALSE';
            partiallyAnswered = false;
        } else if (question.type === 'SA') {
            answered = userAnswer && userAnswer.trim() !== "";
            partiallyAnswered = false;
        }

        let className = answered ? 'answered' : (partiallyAnswered ? 'partially-answered' : 'unanswered');
        return `<div class="${className}" onclick="goToQuestion(${i})">${i + 1}</div>`;
    }).join('');

    drawerItems.innerHTML = html;
}
window.updateDrawer = updateDrawer;

function updateReviewDrawer() {
    let drawerItems = document.getElementById('review-drawer-items');
    if (!drawerItems) return;

    let html = quizQuestions.map((question, i) => {
        let status = questionStatus[i];
        let className = '';
        if (status === 'correct') {
            className = 'correct';
        } else if (status === 'partially-correct') {
            className = 'partially-correct';
        } else if (status === 'incorrect') {
            className = 'incorrect';
        } else if (status === 'not-answered') {
            className = 'not-answered';
        }
        return `<div class="${className}" onclick="goToReviewQuestion(${i})">${i + 1}</div>`;
    }).join('');

    drawerItems.innerHTML = html;
}
window.updateReviewDrawer = updateReviewDrawer;


function goToReviewQuestion(index) {
    currentQuestionIndex = index;
    displayReviewQuestion(index);
    toggleReviewDrawer();
}
window.goToReviewQuestion = goToReviewQuestion;


function goToQuestion(index) {
    currentQuestionIndex = index;
    displayQuestion(index);
    updateClearChoicesVisibility(currentQuestionIndex);
    toggleDrawer();
}
window.goToQuestion = goToQuestion;


function prevQuestion() {
    if (currentQuestionIndex > 0) {
        currentQuestionIndex--;
        displayQuestion(currentQuestionIndex);
        updateClearChoicesVisibility(currentQuestionIndex);
    }
}
window.prevQuestion = prevQuestion;


function nextQuestion() {
    if (currentQuestionIndex < quizQuestions.length - 1) {
        currentQuestionIndex++;
        displayQuestion(currentQuestionIndex);
        updateClearChoicesVisibility(currentQuestionIndex);
    } else {
        submitQuiz();
    }
}
window.nextQuestion = nextQuestion;


function startTimer() {
    const isVisible =
        window.AndroidPreference?.isTimerVisible?.() ?? true; // fallback to true

    // If native timer overlay is available
    if (window.NativeTimerOverlay?.start) {
        if (isVisible) {
            // Start native timer and show native view
            NativeTimerOverlay.start(7200); // 2 hours(7200)
            document.getElementById('timer').style.visibility = 'hidden';
        } else {
            console.log("Timer is hidden — native timer will run silently");
            NativeTimerOverlay.start(7200); // Still start it, but Java will not show the view
        }
    } else {
        // Fallback: use HTML-based timer
        console.warn("NativeTimerOverlay not available. Using fallback timer.");
        const timerElement = document.getElementById('timer');
        timerElement.style.visibility = isVisible ? 'visible' : 'hidden';
        startFallbackTimer(isVisible);
    }
}

window.startTimer =startTimer;


function startFallbackTimer(autoSubmit = true) {
    let timeLeft = 7200;
    const timerElement = document.getElementById('timer');

    timerInterval = setInterval(() => {
        timeLeft--;
        const hours = Math.floor(timeLeft / 3600);
        const minutes = Math.floor((timeLeft % 3600) / 60);
        const seconds = timeLeft % 60;

        timerElement.textContent = `Time Left: ${String(hours).padStart(2, '0')}:${String(minutes).padStart(2, '0')}:${String(seconds).padStart(2, '0')}`;

        if (timeLeft <= 300) {
            timerElement.classList.add('blinking');
        } else {
            timerElement.classList.remove('blinking');
        }

        if (timeLeft <= 0) {
            clearInterval(timerInterval);
            if (autoSubmit) {
                submitQuiz(true);
            } else {
                console.log("Time up, but auto-submit is disabled.");
            }
        }
    }, 1000);
}

function stopTimer() {
    if (window.NativeTimerOverlay?.stop) {
        NativeTimerOverlay.stop();
    } else if (window.timerInterval) {
        clearInterval(timerInterval);
    }
}


function submitQuiz(auto = false) {
    clearInterval(timerInterval);
    let answered = userAnswers.filter(a => a && (Array.isArray(a) ? a.length > 0 && a.some(v => v !== "") : true)).length;
    let message = `${auto ? 'Time is up! Submitting automatically.' : 'Once you submit your answers, you won’t be able to change them.'}`;

    let drawer = document.getElementById('drawer');

    if (drawer.style.right === "0px") {
        drawer.style.right = "-210px";
    }

    if (auto) {
        calculateResult();
        showResultScreen();
    } else {
        let dialog = document.getElementById('submit-dialog');
        let messageElement = document.getElementById('submit-message');
        let messageTitle = document.getElementById('submit-title');
        let remainingQuestion = document.getElementById('remaining-question');
        remainingQuestion.hidden = false;
        let title = "Submit all your answers and finish?";
        let remainingQuestionCount = quizQuestions.length - answered;
        messageTitle.textContent = title;
        messageElement.textContent = message;
        dialog.style.display = 'flex';
        if (remainingQuestionCount > 0) {
            remainingQuestion.textContent = `Questions without a response: ${remainingQuestionCount}`
        } else {
            remainingQuestion.style.display = 'none';
        }
        document.getElementById('submit-yes').textContent = 'SUMMIT ALL AND FINISH';
        document.getElementById('submit-yes').style.backgroundColor = '#007BFF';
        document.getElementById('submit-yes').style.color = 'white';
        document.getElementById('submit-yes').onclick = () => {
            quizSubmitted = true;
            dialog.style.display = 'none';
            calculateResult();
            showResultScreen();
        };
        document.getElementById('submit-no').onclick = () => {
            dialog.style.display = 'none';
            startTimer();
            displayQuestion(currentQuestionIndex);
            toggleDrawerButton();
        };
    }
}
window.submitQuiz =submitQuiz;

function calculateResult() {
    let totalScore = 0, maxScore = 0, correctCount = 0;
    let questionStatus = [];
    quizQuestions.forEach((q, i) => {
        let marks = Number(q.marks) || 0;
        if (q.type === 'ParagraphMCQ') {
            marks = q.questions.reduce((sum, subQ) => sum + (Number(subQ.marks) || 0), 0);
        } else if (!Number.isFinite(marks)) {
            console.warn(`Invalid marks for question ${i}: ${q.marks}, defaulting to 0`);
            marks = 0;
        }
        maxScore += marks;
        console.log(`Processing Q${i} (type: ${q.type}, marks: ${marks})`);
        console.log(`userAnswers[${i}]:`, userAnswers[i]);

        if (q.type === 'TF') {
            if (userAnswers[i] === String(q.answer)) {
                totalScore += marks;
                correctCount++;
                questionStatus[i] = 'correct';
            } else if (userAnswers[i] !== String(q.answer)) {
                questionStatus[i] = 'incorrect';
            } else {
                questionStatus[i] = 'not-answered';
            }
        } else if (q.type === 'MCQ') {
            let userAns = userAnswers[i] || (q.multiple ? [] : '');
            let correctAns = Array.isArray(q.answer) ? q.answer : [q.answer];
        
            if (q.multiple) {
                if (userAns.length > 0) {
                    let correctSelections = userAns.filter(a => correctAns.includes(a)).length;
                    let incorrectSelections = userAns.filter(a => !correctAns.includes(a)).length;
        
                    if (correctSelections > 0 && incorrectSelections === 0 && correctSelections === correctAns.length) {
                        totalScore += marks;
                        correctCount++;
                        questionStatus[i] = 'correct';
                    } else if (correctSelections > 0 && incorrectSelections > 0) {
                        questionStatus[i] = 'partially-correct';
                    } else {
                        questionStatus[i] = 'incorrect';
                    }
                } else {
                    questionStatus[i] = 'not-answered';
                }
            } else {
                if (userAns === correctAns[0]) {
                    totalScore += marks;
                    correctCount++;
                    questionStatus[i] = 'correct';
                } else if (userAns !== '') {
                    questionStatus[i] = 'incorrect';
                } else {
                    questionStatus[i] = 'not-answered';
                }
            }
        } else if (q.type === 'MWQ') {
            let userAns = Array.isArray(userAnswers[i]) ? userAnswers[i] : Array(q.blanks.length).fill('');
            let sortedBlanks = [...q.blanks].sort((a, b) => a.position - b.position);
            let correctBlanks = 0;
            sortedBlanks.forEach((b, j) => {
                let userVal = userAns[j] || '';
                let correctVal = b.answer || '';
                if (userVal === correctVal) {
                    correctBlanks++;
                }
            });
        
            totalScore += (correctBlanks / sortedBlanks.length) * marks; // Partial scoring
        
            if (correctBlanks === sortedBlanks.length) {
                correctCount++;
                questionStatus[i] = 'correct';
            } else if (correctBlanks > 0) {
                questionStatus[i] = 'partially-correct';
            } else {
                questionStatus[i] = userAns.some(ans => ans !== '') ? 'incorrect' : 'not-answered';
            }
        } else if (q.type === 'ParagraphMCQ') {
            let subCorrect = 0;
            let userAns = Array.isArray(userAnswers[i]) ? userAnswers[i] : Array(q.questions.length).fill('');
            
            q.questions.forEach((subQ, subI) => {
                let correctAns = Array.isArray(subQ.answer) ? subQ.answer[0] : subQ.answer;
                if ((userAns[subI] || '') === (correctAns || '')) {
                    subCorrect++;
                }
            });
        
            totalScore += (subCorrect / q.questions.length) * marks; // Partial scoring
        
            if (subCorrect === q.questions.length) {
                correctCount++;
                questionStatus[i] = 'correct';
            } else if (subCorrect > 0) {
                questionStatus[i] = 'partially-correct';
            } else {
                questionStatus[i] = userAns.some(ans => ans !== '') ? 'incorrect' : 'not-answered';
            }
        } else if (q.type === 'SA') {
            let userAns = userAnswers[i] || '';
            let isCorrect = Array.isArray(q.correctAnswers) && q.correctAnswers.some(ans => {
                if (ans.includes('*')) {
                    let regexStr = '^' + ans.replace(/[.*+?^${}()|[\]\\]/g, '\\$&').replace(/\*/g, '.*') + '$';
                    let regex = new RegExp(regexStr);
                    return q.caseSensitive ? regex.test(userAns) : regex.test(userAns.toLowerCase());
                }
                return q.caseSensitive ? userAns === ans : userAns.toLowerCase() === ans.toLowerCase();
            });
        
            if (isCorrect) {
                totalScore += marks;
                correctCount++;
                questionStatus[i] = 'correct';
            } else {
                questionStatus[i] = userAns !== '' ? 'incorrect' : 'not-answered';
            }
        } else if (q.type === 'Matching') {
            const userAns = Array.isArray(userAnswers[i]) ? userAnswers[i] : []; // Ensure it's an array
const correctAns = Array.isArray(q.correctMatches) ? q.correctMatches : []; // Ensure correctMatches is an array

let correctMatches = 0;

// Debugging log for correct matches
console.log(`Matching question ${i} - correctMatches:`, correctAns);
console.log(`userAns:`, userAns);

// Loop through each left item and check if the user answer matches the correct answer
for (let j = 0; j < correctAns.length; j++) {
    if (Number(userAns[j]) === Number(correctAns[j])) {
        correctMatches++;
    }
}

// Avoid division by zero
if (correctAns.length > 0) {
    totalScore += (correctMatches / correctAns.length) * marks;
} else {
    console.warn(`No correct answers for Matching question ${i}. Skipping score calculation.`);
}

if (correctMatches === correctAns.length) {
    correctCount++;
    questionStatus[i] = 'correct';
} else if (correctMatches > 0) {
    questionStatus[i] = 'partially-correct';
} else {
    questionStatus[i] = userAns.length > 0 ? 'incorrect' : 'not-answered';
}

        } else if (q.type === 'Cloze') {
            let userAns = Array.isArray(userAnswers[i]) ? userAnswers[i] : [];
            let matches = Array.from(q.question.matchAll(/\{(\d+):([^:]+):([^}]+)\}/g));
            let correctCountCloze = 0;
            
            if (matches.length === 0) {
                questionStatus[i] = 'not-answered';
            } else {
                let idx = 0;
                for (let match of matches) {
                    let type = match[2];
                    let correct = type === 'dropdown' ? match[3].split(':').pop() : match[3];
                    if ((userAns[idx] || '') === (correct || '')) correctCountCloze++;
                    idx++;
                }
        
                totalScore += (correctCountCloze / matches.length) * marks; // Partial scoring
        
                if (correctCountCloze === matches.length) {
                    correctCount++;
                    questionStatus[i] = 'correct';
                } else if (correctCountCloze > 0) {
                    questionStatus[i] = 'partially-correct';
                } else {
                    questionStatus[i] = userAns.length > 0 ? 'incorrect' : 'not-answered';
                }
            }
        }        
    });
    window.questionStatus = questionStatus;
    let percentage = maxScore > 0 ? (totalScore / maxScore) * 100 : 0;
    let timeUsed = (Date.now() - startTime) / 1000;
    let bestScore = Number(localStorage.getItem(`bestScore_${currentSubject}`)) || 0;
    if (totalScore > bestScore) {
        bestScore = totalScore;
        localStorage.setItem(`bestScore_${currentSubject}`, totalScore);
    }

    console.log(`Final Scores - totalScore: ${totalScore}, maxScore: ${maxScore}, correctCount: ${correctCount}, bestScore: ${bestScore}`);
    document.getElementById('best-score').textContent = `${bestScore}`; // Best score across all attempts
    document.getElementById('current-score').textContent = `${totalScore}`; // Current attempt
    document.getElementById('time-used').textContent = `${Math.floor(timeUsed / 60)}m ${Math.floor(timeUsed % 60)}s`;
    document.getElementById('percentage').textContent = `${percentage.toFixed(2)} out of 100.00`;
}
window.calculateResult = calculateResult;

function showResultScreen() {
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'block';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('drawer').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showResultScreen = showResultScreen;


function retryQuiz() {
     // update the timer
     updateNativeTimerByScreen();
    userAnswers = new Array(quizQuestions.length).fill(null);
    timeLeft = 7200;
    startTime = Date.now();
    quizSubmitted = false;
    startTimer();
    showQuizScreen();
    displayQuestion(0);
    updateDrawer();
    document.getElementById('drawer').style.display = 'block';
}
window.retryQuiz = retryQuiz;


function reviewQuiz() {
    currentQuestionIndex = 0;
    showReviewScreen();
    updateReviewDrawer();
    displayReviewQuestion(currentQuestionIndex);
}
window.reviewQuiz = reviewQuiz;

function showReviewScreen() {
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'block';
    document.getElementById('summary-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showReviewScreen = showReviewScreen;

function displayReviewQuestion(index) {
    if (index < 0 || index >= quizQuestions.length) {
        console.error(`Invalid question index: ${index}`);
        return; // Prevent processing invalid index
    }
    let q = quizQuestions[index];
    let html = `<div class="question-header"><p class="no-zoom">Question ${index + 1} of ${quizQuestions.length}</p></div>`;

    // Handle different question types
    if (q.type === 'TF') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        html += `<h2>${q.question}</h2>`;
            if (q.image) {
        html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
    }
    if (q.audio) {
        html += `
            <div class="audio-container">
                <audio id="question-audio" controls>
                    <source src="${q.audio}" type="audio/mpeg">
                    Your browser does not support the audio element.
                </audio>
            </div>
        `;
    }
        html += q.choices.map(choice => {
            const isSelected = userAnswers[index] === choice;
            const isCorrect = choice === q.answer;
            let className = '';
            if (isSelected) {
                className = isCorrect ? 'correct' : 'incorrect';
            } else if (isCorrect) {
                className = 'correct';
            }
            return `
                <div class="choice ${className}">
                    <label><input type="radio" disabled ${isSelected ? 'checked' : ''}> ${choice}</label>
                </div>
            `;
        }).join('');
        if (userAnswers[index]) {
            const isCorrect = userAnswers[index] === q.answer;
            html += `<div class="feedback">${isCorrect ? '<span class="correct">Correct</span>' : '<span class="incorrect">Incorrect</span>'}</div>`;
        } else {
            html += `<div class="feedback"><span class="not-answered">Not Answered</span></div>`;
        }
    } else if (q.type === 'PlainText') {
        html += `<h1>${q.section}</h1>`;
        html += `<h2>${q.instruction}</h2>`;
    } else if (q.type === 'MCQ') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        html += `<div class="question-text"><h2>${q.question}</h2></div>`;
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
            `;
        }
        html += generateReviewChoices(q, userAnswers[index]);

    } else if (q.type === 'MWQ') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
            `;
        }
        // Validate q.blanks
        if (!Array.isArray(q.blanks)) {
            console.error(`Question ${index} has invalid blanks property:`, q.blanks);
            html += `<div class="question-text"><h2>${q.question} (Error: Invalid question format)</h2></div>`;
        } else {
            let parts = q.question.split(/\[(\d+)\]/);
            let userAns = Array.isArray(userAnswers[index]) ? userAnswers[index] : [];
            let htmlParts = [];
            let blankIndex = 0;
            for (let i = 0; i < parts.length; i++) {
                if (i % 2 === 0) {
                    // Plain text part
                    htmlParts.push(parts[i]);
                } else {
                    // Placeholder [n]
                    let position = parseInt(parts[i]);
                    let blank = q.blanks[blankIndex];
                    let userVal = userAns[blankIndex] || '';
                    let correctVal = blank && blank.answer ? blank.answer : '';
                    let isCorrect = userVal === correctVal && userVal !== '';
                    let className = userVal ? (isCorrect ? 'correct' : 'incorrect') : 'not-answered';
                    let displayText = userVal || 'Not Answered';
                    if (currentSubject === 'Mathematics') {
                        displayText = userVal ? `\\(${userVal.replace(/^\$|\$/g, '')}\\)` : 'Not Answered';
                    }
                    htmlParts.push(`<span class="${className}">${displayText}</span>`);
                    blankIndex++;
                }
            }
            html += `<div class="question-text"><h2>${htmlParts.join('')}</h2></div>`;
        }
    } else if (q.type === 'ParagraphMCQ') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
            `;
        }
        q.questions.forEach((subQ, subI) => {
            html += `<div class="sub-question">`;
            html += `<div <h2>class="question-text">${subQ.question}</h2></div>`;
            html += generateReviewChoices(subQ, userAnswers[index] ? userAnswers[index][subI] : null);
            html += `</div>`;
        });
    } else if (q.type === 'Matching') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        html += `<div class="matching-question">`;
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
            `;
        }
        q.leftItems.forEach((left, i) => {
            let userSelectedIndex = userAnswers[index] ? userAnswers[index][i] : null;
            let userSelectedText = userSelectedIndex !== null ? q.rightItems[userSelectedIndex] : 'Not Answered';
            let isCorrect = userSelectedIndex == q.correctMatches[i];
            let className = userSelectedIndex !== null ? (isCorrect ? 'correct' : 'incorrect') : 'not-answered';
            html += `<div class="matching-pair">
                <span>${left}</span>
                <span class="${className}">${userSelectedText}</span>
            </div>`;
        });
        html += `</div>`;
    } else if (q.type === 'Cloze') {
        if (q.instruction) { 
            html += `<h2 class="instruction">${q.instruction}</h2>`; 
        }
        
        if (q.image) {
            html += `<img src="${q.image}" alt="Question Image" class="question-image">`;
        }
        if (q.audio) {
            html += `
                <div class="audio-container">
                    <audio id="question-audio" controls>
                        <source src="${q.audio}" type="audio/mpeg">
                        Your browser does not support the audio element.
                    </audio>
                </div>
            `;
        }
        let questionText = q.question;
        let matches = Array.from(questionText.matchAll(/\{(\d+):([^:]+):([^}]+)\}/g));
        let userAns = Array.isArray(userAnswers[index]) ? userAnswers[index] : [];
        let idx = 0;
        for (let match of matches) {
            let position = parseInt(match[1]);
            let type = match[2];
            let content = match[3];
            let userVal = userAns[idx] || '';
            let correctVal = type === 'text' ? content : content.split(':').pop();
            let isCorrect = userVal === correctVal;
            let className = userVal ? (isCorrect ? 'correct' : 'incorrect') : 'not-answered';
            let displayText = userVal || 'Not Answered';
            questionText = questionText.replace(match[0], `<span class="${className}">${displayText}</span>`);
            idx++;
        }
        html += `<div class="question-text"><h2>${questionText}</h2></div>`;
    }

    const reviewContainer = document.getElementById('review-question-container');
    reviewContainer.innerHTML = html;

    if ((currentSubject === 'Mathematics'||'Chemistry'||'Physics'||'Biology') && typeof MathJax !== 'undefined') {
        MathJax.typesetPromise([reviewContainer])
            .catch(err => console.log('MathJax typesetting error:', err));
    }
    // Apply the Pyidaungsu font and font size for Myanmar subject
    if (currentSubject === 'Myanmar'||'Economics') {
        reviewContainer.classList.add('myanmar-font');
        reviewContainer.style.fontSize = '16px';
    } else {
        reviewContainer.classList.remove('myanmar-font');
        reviewContainer.style.fontSize = '18px';
    }
    document.getElementById('review-prev-btn').style.display = index === 0 ? 'none' : 'inline-block';
    document.getElementById('review-next-btn').style.display = index === quizQuestions.length - 1 ? 'none' : 'inline-block';
}
window.displayReviewQuestion = displayReviewQuestion;

function generateReviewChoices(q, userAnswer) {
    let html = '';
    let isCorrect = false;
    let choices = q.choices;

    // Determine overall correctness
    if (q.type === 'MCQ') {
        if (q.multiple) {
            let correctSet = new Set(q.answer);
            let userSet = new Set(userAnswer || []);
            isCorrect = [...correctSet].every(a => userSet.has(a)) && [...userSet].every(a => correctSet.has(a));
        } else {
            isCorrect = userAnswer === q.answer[0];
        }
    }

    // Generate choices with user selections and feedback
    q.choices.forEach((choice) => {
        let choiceValue = choice.text || choice; // Handle both object and string choices
        let isSelected = false;
        if (q.type === 'MCQ' && q.multiple) {
            isSelected = userAnswer && userAnswer.includes(choiceValue);
        } else {
            isSelected = userAnswer === choiceValue;
        }
        let isChoiceCorrect = false;
        if (q.type === 'MCQ') {
            if (q.multiple) {
                isChoiceCorrect = q.answer.includes(choiceValue);
            } else {
                isChoiceCorrect = choiceValue === q.answer[0];
            }
        }
        let className = '';
        if (isSelected) {
            className = isChoiceCorrect ? 'correct' : 'incorrect';
        } else if (isChoiceCorrect) {
            className = 'correct'; // Show correct answer in green even if not selected
        }
        html += `<div class="choice ${className}">
            <input type="${q.multiple ? 'checkbox' : 'radio'}" disabled ${isSelected ? 'checked' : ''}>
            <label>${choiceValue}</label>
        </div>`;
    });

    // Add feedback
    let feedback = '';
    if (userAnswer) {
        feedback = isCorrect ? '<span class="correct">Correct</span>' : '<span class="incorrect">Incorrect</span>';
    } else {
        feedback = '<span class="not-answered">Not Answered</span>';
    }
    html += `<div class="feedback">${feedback}</div>`;
    return html;
}
window.generateReviewChoices = generateReviewChoices;

function reviewPrevQuestion() {
    if (currentQuestionIndex > 0) {
        currentQuestionIndex--;
        displayReviewQuestion(currentQuestionIndex);
    }
}
window.reviewPrevQuestion = reviewPrevQuestion;


function reviewNextQuestion() {
    if (currentQuestionIndex < quizQuestions.length - 1) {
        currentQuestionIndex++;
        displayReviewQuestion(currentQuestionIndex);
    }
}
window.reviewNextQuestion = reviewNextQuestion;

function exitReview() {
    showResultScreen();
}
window.exitReview = exitReview;

function showPopup(message) {
    let popup = document.createElement("div");
    popup.id = "custom-popup";
    popup.innerHTML = `
        <div class="popup-content">
            <p>${message}</p>
            <button onclick="closePopup()">OK</button>
        </div>
    `;

    // Style the popup
    popup.style.position = "fixed";
    popup.style.top = "50%";
    popup.style.left = "50%";
    popup.style.transform = "translate(-50%, -50%)";
    popup.style.background = "#fff";
    popup.style.padding = "20px";
    popup.style.borderRadius = "10px";
    popup.style.boxShadow = "0px 0px 10px rgba(0,0,0,0.3)";
    popup.style.zIndex = "1000";
    popup.style.textAlign = "center";
    popup.style.width = "85%";
    popup.style.fontSize = "18px";
    popup.style.color = "red";
    popup.style.fontWeight = "bold";
    // Style the button
    let button = popup.querySelector("button");
    button.style.padding = "10px 20px";
    button.style.marginTop = "10px";
    button.style.border = "none";
    button.style.background = "#007bff";
    button.style.color = "#fff";
    button.style.cursor = "pointer";
    button.style.borderRadius = "5px";

    document.body.appendChild(popup);
}
window.showPopup = showPopup;


// Function to close the popup
function closePopup() {
    let popup = document.getElementById("custom-popup");
    if (popup) {
        popup.remove();
    }
}
window.closePopup = closePopup;

function confirmDialog(subject) {
    currentSubject = subject;
    let confirmDialog = document.getElementById('confirm-dialog');
    let messageElement = document.getElementById('confirm-message');
    let messageTitle = document.getElementById('confirm-title');
    let title = "Time limit";
    let message = "Your attempt will have a time limit of 2 hours. When you start, the timer will begin to count down and cannot be paused. You must finish your attempt before it expires. Are you sure you wish to start now?";
    messageTitle.textContent = title;
    messageElement.textContent = message;
    confirmDialog.style.display = 'flex';

    document.getElementById('confirm-yes').onclick = () => {
        confirmDialog.style.display = 'none';
        startTime = Date.now();
        loadQuizData(subject);
    };
    document.getElementById('confirm-no').onclick = () => {
        confirmDialog.style.display = 'none';
    };
    
}
window.confirmDialog = confirmDialog;

let initialDistance = null;
let baseFontSizes = {}; // Store initial font sizes
let isPinching = false; // Track if pinch gesture is active

document.addEventListener("DOMContentLoaded", () => {
    document.querySelectorAll(`
        h1, h2, p, button, input, select, textarea, label,
        .instruction, .choice, .mwq-question, .mwq-selected, .mwq-options, .mwq-option,
        .paragraph, .sub-question, .matching-pair, .matching-pair span, .matching-pair select,
        .cloze-dropdown, .mwq-selected-text, .cloze-question, .feedback
    `).forEach(el => {
        if (!el.classList.contains("no-zoom") && !el.closest("#drawer-items")) {  
            baseFontSizes[el] = parseFloat(window.getComputedStyle(el).fontSize);
        }
    });

});

document.addEventListener("touchstart", (event) => {
    if (event.touches.length === 2) {
        initialDistance = getPinchDistance(event.touches);
        isPinching = true; // Enable pinch tracking
        event.preventDefault(); // Prevent default zooming
    }
}, { passive: false });

document.addEventListener("touchmove", (event) => {
    if (event.touches.length === 2 && initialDistance) {
        let newDistance = getPinchDistance(event.touches);
        let scale = newDistance / initialDistance;

        document.querySelectorAll(`
            h1, h2, p, button, input, select, textarea, label,
            .instruction, .choice, .mwq-question, .mwq-selected, .mwq-options, .mwq-option,
            .paragraph, .sub-question, .matching-pair, .matching-pair span, .matching-pair select,
            .cloze-dropdown, .mwq-selected-text, .cloze-question, .feedback
        `).forEach(el => {
            if (!el.classList.contains("no-zoom") && !el.closest("#drawer-items")) {  
                let newSize = Math.max(12, Math.min(30, baseFontSizes[el] * scale)); // Limit font size
                el.style.fontSize = newSize + "px";
            }
        });

        event.preventDefault(); // Prevent page zooming
    }
}, { passive: false });

document.addEventListener("touchend", () => {
    if (initialDistance) {
        initialDistance = null;
        isPinching = false; // Reset pinch tracking

        document.querySelectorAll(`
            h1, h2, p, button, input, select, textarea, label,
            .instruction, .choice, .mwq-question, .mwq-selected, .mwq-options, .mwq-option,
            .paragraph, .sub-question, .matching-pair, .matching-pair span, .matching-pair select,
            .cloze-dropdown, .mwq-selected-text, .cloze-question, .feedback
        `).forEach(el => {
            if (!el.classList.contains("no-zoom") && !el.closest("#drawer-items")) {  
                baseFontSizes[el] = parseFloat(window.getComputedStyle(el).fontSize);
            }
        });
    }
});

document.addEventListener("touchmove", (event) => {
    // Allow scrolling if not pinching
    if (!isPinching) {
        return;
    }
    
    event.preventDefault(); // Only prevent when pinching
}, { passive: false });

function getPinchDistance(touches) {
    let dx = touches[0].clientX - touches[1].clientX;
    let dy = touches[0].clientY - touches[1].clientY;
    return Math.sqrt(dx * dx + dy * dy);
}


function showOverview(subject) {
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'block';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('overview-screen').style.fontFamily = 'Pyidaungsu';
    const overview = overviews[subject];

    document.getElementById('overview-title').textContent = overview.title;
    document.getElementById('overview-text').innerHTML = overview.text;

    // Update the label text inside the start button only
    const buttonLines = overview.buttonText.split('\n');
    document.querySelector('#overview-start-text .line1').textContent = buttonLines[0] || '';
    document.querySelector('#overview-start-text .line2').textContent = buttonLines[1]?.trim() || '';


    // Set the start button action
    const startBtn = document.getElementById('overview-start-btn');
    startBtn.onclick = () => startQuiz(subject);
    // update the timer
    updateNativeTimerByScreen();
}

window.showOverview = showOverview;

function goToMain() {
    document.getElementById('main-screen').style.display = 'block';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}




function showSummaryScreen() {
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'block';

    const table = document.getElementById('summary-table');
    table.innerHTML = '';

    let html = `
        <table>
            <thead>
                <tr>
                    <th>Question</th>
                    <th>Status</th>
                </tr>
            </thead>
            <tbody>
    `;

    quizQuestions.forEach((question, i) => {
        let userAnswer = userAnswers[i] ?? null;
        let expectedLength = question.type === 'MWQ' ? question.blanks.length : 
                           (question.type === 'ParagraphMCQ' ? question.questions.length : 
                           (question.type === 'Matching' ? question.leftItems.length :
                           (question.type === 'Cloze' ? (question.question.match(/\{(\d+):/g) || []).length :
                           (Array.isArray(question.answer) ? question.answer.length : 1))));

        let answered = false;
        let partiallyAnswered = false;

        if (question.type === 'MWQ' || question.type === 'ParagraphMCQ' || question.type === 'Matching' || question.type === 'Cloze') {
            if (userAnswer && Array.isArray(userAnswer)) {
                let filledCount = userAnswer.filter(val => val !== "" && val !== null && val !== undefined).length;
                answered = filledCount === expectedLength;
                partiallyAnswered = filledCount > 0 && filledCount < expectedLength;
            }
        } else if (question.type === 'MCQ') {
            if (question.multiple) {
                if (userAnswer && Array.isArray(userAnswer)) {
                    let selectedCount = userAnswer.length;
                    answered = selectedCount === expectedLength;
                    partiallyAnswered = selectedCount > 0 && selectedCount < expectedLength;
                }
            } else {
                answered = userAnswer !== null && userAnswer !== "";
                partiallyAnswered = false;
            }
        } else if (question.type === 'TF') {
            answered = userAnswer === 'TRUE' || userAnswer === 'FALSE';
            partiallyAnswered = false;
        } else if (question.type === 'SA') {
            answered = userAnswer && userAnswer.trim() !== "";
            partiallyAnswered = false;
        }

        let status = answered ? 'answered' : (partiallyAnswered ? 'partially-answered' : 'not-answered');
        let statusLabel = '';

        switch (status) {
            case 'answered':
                statusLabel = 'Answer saved';
                break;
            case 'partially-answered':
                statusLabel = 'Incomplete answer';
                break;
            case 'not-answered':
            default:
                statusLabel = 'Not yet answered';
        }

        html += `
            <tr class="${status}">
                <td><button onclick="goToQuestionFromSummary(${i})">${i + 1}</button></td>
                <td>${statusLabel}</td>
            </tr>
        `;
    });

    html += `</tbody></table>`;
    table.innerHTML = html;
    // update the timer
    updateNativeTimerByScreen();
}


function goToQuestionFromSummary(index) {
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'block';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    displayQuestion(index);
    currentQuestionIndex = index;
    updateClearChoicesVisibility(index);
    // update the timer
    updateNativeTimerByScreen();
}


function returnToQuiz(){
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'block';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}


// Navigation functions
function showMain() {
    console.log('showMain called');
    document.getElementById('main-screen').style.display = 'block';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showMain = showMain;


function showQuiz() {
    console.log('showQuiz called');
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'block';
    document.getElementById('summary-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showQuiz = showQuiz;

function showSummary() {
    console.log('showSummary called');
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'block';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showSummary = showSummary;

function showResult() {
    console.log('showResult called');
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'block';
    document.getElementById('review-screen').style.display = 'none';
    // update the timer
    updateNativeTimerByScreen();
}
window.showResult = showResult;

function showReview() {
    console.log('showReview called');
    document.getElementById('main-screen').style.display = 'none';
    document.getElementById('overview-screen').style.display = 'none';
    document.getElementById('quiz-screen').style.display = 'none';
    document.getElementById('summary-screen').style.display = 'none';
    document.getElementById('result-screen').style.display = 'none';
    document.getElementById('review-screen').style.display = 'block';
    // update the timer
    updateNativeTimerByScreen();
}
window.showReview = showReview;


// Back button handling

var lastBackPress = 0;
function handleBackPress() {
    console.log('Back button pressed');
    // Main Screen: Double back to exit
    if (document.getElementById('main-screen').style.display === 'block') {
        if (window.AndroidBack && window.AndroidBack.exitApp) {
            window.AndroidBack.exitApp();
        }
        /**
        *Double Backpress to Exit
            var now = Date.now();
            if (now - lastBackPress < 2000) {
                if (window.AndroidBack && window.AndroidBack.exitApp) {
                    window.AndroidBack.exitApp();
                }
            } else {
                lastBackPress = now;
                if (window.AndroidBack && window.AndroidBack.showToast) {
                    window.AndroidBack.showToast('Tap again to exit App');
                }
            }
        */
    }
    // Overview Screen: Close confirm-dialog if open, else back to main
    else if (document.getElementById('overview-screen').style.display === 'block') {
        let confirmDialog = document.getElementById('confirm-dialog');
        if (confirmDialog.style.display === 'flex') {
            confirmDialog.style.display = 'none';
        } else {
            showMain();
        }
    }
// Quiz Screen: Close drawer, confirm exit if unsubmitted, else to main
else if (document.getElementById('quiz-screen').style.display === 'block') {
    let drawer = document.getElementById('drawer');
    if (drawer.style.right === '0px') {
        toggleDrawer();
    } else if (!quizSubmitted) {
        let submitDialog = document.getElementById('submit-dialog');
        let messageElement = document.getElementById('submit-message');
        let messageTitle = document.getElementById('submit-title');
        let remainingQuestion = document.getElementById('remaining-question');
        remainingQuestion.hidden = true;
        messageTitle.textContent = "Exit Quiz";
        messageElement.textContent = "Are you sure you want to exit? \nYou should finish the quiz before leaving.";
        submitDialog.style.display = 'flex';

        let noBtn = document.getElementById('submit-no');
        noBtn.textContent = 'Cancel';
        noBtn.onclick = () => {
            quizSubmitted = false;
            submitDialog.style.display = 'none';
        };

        let yesBtn = document.getElementById('submit-yes');
        yesBtn.textContent = 'Exit Anyway';
        yesBtn.style.backgroundColor = 'red';
        yesBtn.color = 'white';
        yesBtn.onclick = () => {
            submitDialog.style.display = 'none';
            goToMain();
        };
    } else {
        goToMain();
    }
}
    // Summary Screen: Back to quiz
    else if (document.getElementById('summary-screen').style.display === 'block') {
        let submitDialog = document.getElementById('submit-dialog');
        if (submitDialog.style.display === 'flex') {
            submitDialog.style.display = 'none';
        } else {
            showQuiz();
        } 
    }
    // Result Screen: Back to main
    else if (document.getElementById('result-screen').style.display === 'block') {
        showMain();
    }
    // Review Screen: Close review drawer if open, else back to result
    else if (document.getElementById('review-screen').style.display === 'block') {
        let reviewDrawer = document.getElementById('review-drawer');
        if (reviewDrawer.style.right === '0px') {
            toggleReviewDrawer();
        } else {
            showResult();
        }
    }else {
        if (window.AndroidBack && window.AndroidBack.exitApp) {
            window.AndroidBack.exitApp();
        }
        /**
         * Double Backpress to Exit
        var now = Date.now();
        if (now - lastBackPress < 2000) {
            if (window.AndroidBack && window.AndroidBack.exitApp) {
                window.AndroidBack.exitApp();
            }
        } else {
            lastBackPress = now;
            if (window.AndroidBack && window.AndroidBack.showToast) {
                window.AndroidBack.showToast('Tap again to exit App');
            }
        }
        **/
    }
};
window.handleBackPress = handleBackPress;


function exitQuiz(){
    if (window.AndroidBack && window.AndroidBack.showToast) {
        window.AndroidBack.exitApp();
    }
}
window.exitQuiz = exitQuiz;


function updateShuffleState() {
    try {
        if (window.AndroidPreference && typeof window.AndroidPreference.isShuffleEnabled === "function") {
            shuffleEnabled = window.AndroidPreference.isShuffleEnabled();
            console.log("Shuffle state from Android:", shuffleEnabled);
        }
    } catch (e) {
        console.error("Failed to get shuffle state:", e);
    }
}

function shuffleChoiceArray(array) {
    return array
        .map(value => ({ value, sort: Math.random() }))
        .sort((a, b) => a.sort - b.sort)
        .map(({ value }) => value);
}

function updateShuffleChoiceState() {
    try {
        if (window.AndroidPreference && typeof window.AndroidPreference.isShuffleChoiceEnabled === "function") {
            shuffleChoiceEnabled = window.AndroidPreference.isShuffleChoiceEnabled();
            console.log("Shuffle Choice state from Android:", shuffleChoiceEnabled);
        }
    } catch (e) {
        console.error("Failed to get shuffle state:", e);
    }
}

function updateNativeTimerByScreen() {
    const quizScreenVisible = document.getElementById('quiz-screen')?.style.display === 'block';

    if (quizScreenVisible) {
        window.NativeTimerOverlay?.stop?.(); // safety stop before start
        window.NativeTimerOverlay?.start?.(7200); // or whatever time you need
    } else {
        window.NativeTimerOverlay?.stop?.(); // stop if on any other screen
    }
}

window.addEventListener('load', () => {
    updateNativeTimerByScreen();
});

